/*第8题 （10.0分）        题号:993        难度:中        第7章
-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：从低位开始取出长整型变量s奇数位上的数，依次构成一个新数放在t中。     
例如：当s中的数为：7654321时，t中的数为：7531。


-------------------------------------------------------*/

#include <stdio.h>
long fun (long s,long t)
{  
  long sl=10;          
t = s % 10;
while(s > 0)     
{ s = s/100; 
/************SPACE***********/    
t =sl*(s%10) + t;
sl = sl * 10;
}
 /***********SPACE***********/
  return t;
}  

main()     
{
/***********SPACE***********/
  double s, t=0,m;
  printf("\nPlease enter s:");
/***********SPACE***********/
 scanf("%ld", &s);     
/***********SPACE***********/
  m=fun(s,t);
  printf("The result is: %ld\n", m);

}

