
/*第9题 （10.0分）        题号:994        难度:中        第7章
-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：题目：编程求所有4位数，这些数具有以下特点：这数本身是平方数，且其低2位和高2位所组成的2个2位数也是平方数。

-------------------------------------------------------*/
#include <stdio.h>
/***********SPACE***********/
#include <math.h>
main(){
/***********SPACE***********/
        int qw,bw,sw,gw; 
        int a,b; 
        int i;  
        for(i=1000;i<10000;i++)//4位数
        {
                if(sqrt(i)==(int)sqrt(i))
                {   
                        qw=i/1000;
                        bw=i%1000/100;
                        /***********SPACE***********/
                        sw=i%100/10;
                        gw=i%10;
                        
                        a=qw*10+bw;
                        /***********SPACE***********/
                        b=sw*10+gw;
                        /***********SPACE***********/
                        if(sqrt(a)==(int)sqrt(a) && sqrt(b)==(int)sqrt(b))
                        {
                                printf("%d\n",i);   
                        } 
                }
        }
}

