/*
第10题 （10.0分）        题号:965        难度:中        第7章
-------------------------------------------------------
【程序填空】
---------------------------------------------------------

功能：编写程序，输入两个整数，和+、－、*、/之中的任意一个
运算符，输出计算结果。

-------------------------------------------------------*/
#include<stdio.h>
void main()
{
/***********SPACE***********/
long int a,b;
char c;
printf("请输入一个运算符：\n");
/***********SPACE***********/
scanf("%c",&c);
printf("请输入两个整数:\n");
/***********SPACE***********/
scanf("%d,%d",&a,&b);
/***********SPACE***********/
switch(c)
{
case '+':printf("%d\n",a+b);break;
case '-':printf("%f\n",a-b);break;
case '*':printf("%f\n",a*b);break;
case '/':printf("%f\n",a/b);break;
/***********SPACE***********/
defaule:printf("错误");
}
}


