/*第5题 （10.0分）        题号:1071        难度:中        第7章
-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：一球从100米高度自由落下，每次落地后反跳回原高度的
      一半；再落下，求它在第10次落地时，共经过多少米？
      第10次反弹多高?
次数	弹起	落下	当前总和	总和
1		100	100	100
2	50	50	100	200
3	25	25	50	250

-------------------------------------------------------*/
#include<stdio.h>
main()
{
/***********SPACE***********/
 float sn=100.0,hn=sn/2;
  int n;
/***********SPACE***********/
  for(n=2; n<=1;n++)
  {
/***********SPACE***********/
    sn=sn+2*hn;
/***********SPACE***********/
    hn=hn/2; 
  }
  printf("the total of road is %f\n",sn);
/***********SPACE***********/
  printf("the tenth is %f meter\n",hn);
}



