/*第8题 （10.0分）        题号:1074        难度:中        第7章
-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：功能：有5个人坐在一起，问第五个人多少岁？他说比第4个人
      大2岁。问第4个人岁数，他说比第3个人大2岁。问第三
      个人，又说比第2人大两岁。问第2个人，说比第一个人
      大两岁。最后问第一个人，他说是10岁。请问第五个人
      多大？
-------------------------------------------------------*/
#include<stdio.h>
int age(int n){
  int c;
  if(n==1) 
    c=10;
	else{
  		//printf("%d ",c);
  		c=age(n-1)+2; //c=age(1)+2+2+2+2
  }
	//printf("%d\n",c);
  return(c);
}
main()
{
  printf("\n\nage=%d",age(5)); //18
}
/*-------------------------*/
#include<stdio.h>
int age(int n){
	
  int c=10;
  if(n!=1){
  		//printf("%d ",c);
  		c=age(n-1)+2; //c=age(1)+2+2+2+2
  }
	//printf("%d\n",c);
  return(c);
}
main()
{
  printf("\n\nage=%d",age(5)); //18
}
/*-------------------------*/
