/*第9题 （10.0分）        题号:1075        难度:中        第7章
-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：功能：一个偶数总能表示为两个素数之和。

-------------------------------------------------------*/
#include <stdio.h>
/***********SPACE***********/
#include <math.h>
main()
{
  int a,b,c,d;
/***********SPACE***********/
  scanf("%d",&a);
  for(b=3;b<=a/2;b+=2)
  {
	    for(c=2;c<=sqrt(b);c++)
	/***********SPACE***********/
	      if(b%c==0) 
	        break;
	        
	    if(c>sqrt(b))
	      d=a-b;
	    else
	      break;
	      
	    for(c=2;c<=sqrt(d);c++)
	/***********SPACE***********/
	      if(d%c==0)
	    break;
	    
	/***********SPACE***********/
	    if(c>=sqrt(d))
	    	printf("%d=%d+%d\n",a,b,d);
  }
}


