/*第4题 （10.0分）        题号:616        难度:中        第1章
-------------------------------------------------------
【程序填空】
---------------------------------------------------------

给定程序中，程序的功能是：由键盘输入10个整数，计算这10个整数中的奇数和与偶数和。请填空。

-------------------------------------------------------*/
#include <stdio.h>

void main()
{
  int a,b,c,i;
  a=c=0;
  for(i=1;i<=10;i++)
  {  
    scanf("%d",&b);
/***********SPACE***********/
    if(b%2==0)
    a=a+b;   
    else 
/***********SPACE***********/
    c=c+b;
  }
  printf("偶数的和=%d\n",a);
  printf("奇数的和=%d\n",c);
}

