/*第3题 （10.0分）        题号:1059        难度:中        第7章
-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：下列给定的程序中，函数fun的功能是：计算并输出k以内最大的10个能被13或17
整除的自然数之和。k的值由主函数传入，若k的值为500，则函数的值为4622。

-------------------------------------------------------*/
#include <stdio.h>
#include <conio.h>
#include <stdlib.h>
int fun(int k)
{ 
        int m=0,mc=0;
/***********SPACE***********/
        while((k>=2)&&(mc<10))
        {
/***********SPACE***********/
            if((k%13==0 || k%17==0))
            { 
                    m=m+k;
                    mc++;
            }
/***********SPACE***********/
            k--;
		}
/***********SPACE***********/
        return m;
}
main()
{
        system("CLS");
/***********SPACE***********/
        printf("%d\n ",fun(500));
}

