/*第5题 （10.0分）        题号:1061        难度:中        第7章
-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：判断整数x是否是同构数。若是同购数，函数返回1；否则返回0。
说明：所谓"同构数"是指这个数出现在它的平方数的右边。
例如：输入整数25，25的平方数是625，25是625中右侧的数，
      所以25是同构数。
注意：x的值由主函数从键盘读入，要求不大于1000。
-------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
/***********SPACE***********/
int fun(int x)
{
  int k;
  k=x*x;
/***********SPACE***********/
  if(x==k%100)
    return 1;
  else
/***********SPACE***********/
    return 0;
}
main()
{
  int x,y;
  printf("\nPlease enter a integer numbers:");
  scanf("%d",&x);
  if(x>100){printf("data error!\n");exit(0);}
/***********SPACE***********/
  x=fun(x);
/***********SPACE***********/
  if(x)   
    printf("%d YES\n",x);
  else 
    printf("%d NO\n",x);
}



