/*第1题 （10.0分）        题号:1057        难度:中        第7章
-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：下列给定程序中，函数fun的功能是：根据整型形参n，计算如下公式的值。
      A1＝1，A2＝1/(1＋A1)，A3＝1/(1＋A2)，…，An＝1/(1＋A(n－1))

例如：若n＝10，则应输出0.617977。
-------------------------------------------------------*/
#include  <stdlib.h>
#include  <conio.h>
#include  <stdio.h>
/***********SPACE***********/
float fun(int n)
{ 
        float a=1;int i;
/***********SPACE***********/
        for(i=2;i<=n;i++)
                a=1.0/(1+a);
/***********SPACE***********/
        return a;
}
main()
{
        int n;
        system("CLS");
        printf("\nPlease enter n: ");
/***********SPACE***********/
        scanf("%d",&n);
/***********SPACE***********/
        printf("a%d=%lf\n",n, fun(n));
}

