/*第2题 （10.0分）        题号:1058        难度:中        第7章
-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：下列给定程序中，函数fun的功能是：传入一个整数m，计算如下公式的值。
       t＝1/2－1/3－…－1/m

例如：若输入5，则应输出－0.283333。

-------------------------------------------------------*/
#include  <stdlib.h>
#include  <conio.h>
#include  <stdio.h>
double fun(int m)
{
/***********SPACE***********/
        double t=1.0/2;
        int i;
/***********SPACE***********/
        for(i=2; i<m;i++)
/***********SPACE***********/
                t=t-1.0/(i+1);
/***********SPACE***********/
        return t;
}
main()
{
        int m;
        system("CLS");
        printf("\nPlease enter 1 integer numbers:\n");
        scanf("%d",&m);
/***********SPACE***********/
        printf("\n\nThe result is %1f\n", fun(m));
}

