试卷编号：7
所属语言：C语言
试卷方案：题库
试卷总分：2860分
共有题型：1种
一、程序设计   共286题 （共计2860分）
第1题 （10.0分）        题号:1        难度:难        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：求出1000以内前20个不能被2，3，5，7整除的数之和。
要求：使用程序中定义的变量
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdio.h>
#include<stdlib.h>
int  fun(int n)  
{
        int i,j=0,a[20],sum=0; /*前20个不能被2,3,5,7整除的数保存在a数组中，它们的和保存在sum中。*/
        /**********Program**********/

        for(i=0;【?】)
        {
                if((【?】))
                {
                        a[j++]【?】;  
                        //printf("%d,",i);
                }
                if(j>n-1) break;                
        }

        for(i=0;【?】)
                【?】a[i];
        /**********  End  **********/
        return sum;
}
main()
{
        printf("和为：%d\n",fun(20));
        system("pause");
}

答案：	for(i=0;i<1000;i++)
	{
		if((i%2!=0)&&(i%3!=0)&&(i%5!=0)&&(i%7!=0))
		{
			a[j++]=i;  
			//printf("%d,",i);
		}
		if(j>n-1) break;		
	}

	for(i=0;i<n;i++)
		sum+=a[i];

第2题 （10.0分）        题号:2        难度:难        第1章
/*----------------------------------------------------------------------
【程序设计】
------------------------------------------------------------------------
 题目：   编写程序，要求读入一个英文文本行，将其中每个单词的第一个字母改
          成大写，然后输出此文本行(这里"单词"是指由空格隔开的字符串)。
          例如，若输入：I am a student to take the examination.，
          则应输出：I Am A Student To Take The Examination.。
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdlib.h>
#include<ctype.h>
#include<string.h>
#include<stdio.h>
void upfst(char *p)
{  
    /**********Program**********/
【?】 k=0;
for(【?】)
  if(k)
   { 
          if(【?】) 
          k=0;
    }
   else if(【?】)
          {  k=1;【?】;}      
    /**********  End  **********/
}
int main()
{          
    char chrstr[81];
    printf("\nPlease enter an English text line:\n");
    gets(chrstr);
    printf("\nBefore changing:\n %s",chrstr);
    upfst(chrstr);
    printf("\nAfter changing:\n %s\n ",chrstr);
    system("pause");
}
答案：int k=0;
for(;*p;p++)
  if(k)
   { 
          if(*p==' ') 
          k=0;
    }
   else if(*p!= ' ')
          {  k=1;*p=toupper(*p);}

第3题 （10.0分）        题号:3        难度:难        第1章
/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------
函数fun的功能：对一个任意位数的正整数n，，从十位起计算隔位数字之和，即十位、
千位、……等数字之和。例如输入1234567，6+4+2的结果为12。
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
int fun(int n)
{
    int sum=0;
    /**********Program**********/
    n=【?】;

     【?】(n>0)
     {  
          【?】+=【?】;  
          n=【?】;
     }
    /**********  End  **********/  
    return sum;
}

#include <stdio.h>
int main()
{
    int n;
    printf("输入一个正整数: ");
    scanf("%d",&n);
    printf("从十位起,隔位数字之和是%d\n",fun(n));
    return 0;
} 
答案： n=n/10;
 while(n>0)
{  sum=sum+n%10;
    n=n/100;
}

第4题 （10.0分）        题号:4        难度:难        第1章
/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------
程序功能：从键盘输入三个整数，比较三个数并显示相应信息，具体如下：
（1）如果三个数都相等，显示"***"；
（2）如果三个数中只有某两个数相等，显示"$$"；
（3）如果三个数互不相等，则显示"#"。
（输出要换行） 
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include<stdio.h>
int main()
{
    int a,b,c;
    scanf("%d%d%d",&a,&b,&c);
    /**********Program**********/
    if(【?】)  printf("【?】");
    else if(【?】)  printf("【?】");
    else  printf("【?】");
    /**********  End  **********/
    return 0;
}
答案：if(a==b && b==c)  printf("***\n");
else if(a==b || b==c || c==a)  printf("$$\n");
else  printf("#\n");

第5题 （10.0分）        题号:5        难度:难        第1章
/*--------------------------------------------------------------------
【程序设计】
----------------------------------------------------------------------
题目：s=1+(2*2)+(3*3*3)+(4*4*4*4)+...+(9*9*9*9*9*9*9*9*9)的值
要求：使用循环实现。 输出格式：s=405071317
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdio.h>
int main()
{
    int i;
    int j;
    int sum = 0;
    int tmp;
    /**********Program**********/
      for (i=1;【?】)
  {
      【?】;
      for (j = 1; 【?】)
      {
          【?】;
      }
       【?】;
  }
    /**********  End  **********/
    printf("s=%d\n", sum);
    return (0);
}
答案：for (i = 1; i <= 9; ++i)
  {
      tmp = 1;
      for (j = 1; j <= i; j++)
      {
          tmp *= i;
      }
      sum += tmp;
  }
第6题 （10.0分）        题号:6        难度:难        第1章
/*--------------------------------------------------------------------
【程序设计】
----------------------------------------------------------------------
题目：有如下数列：1,2,2,3,3,3,4,4,4,4,5,5,5,5,5,..计算并输出前1000项的和
要求：使用循环实现。 输出结果的形式为：s=29820
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdio.h>
int main()
{
    int j = 1;
    int num = 1;
    int countNum = 0;
    int sum = 0;
    /**********Program**********/
 while (【?】)
    {
        for (【?】)
        {
            【?】;
            if (【?】)
            {
                break;
            }
            【?】 num;
        }
        ++num;
    }
    /**********  End  **********/
    printf("s=%d", sum);
    fclose(stdout);
    return (0);
}
答案： while (countNum <= 1000)
    {
        for (j = 1; j <= num; j++)
        {
            ++countNum;
            if (countNum > 1000)
            {
                break;
            }
            sum += num;
        }
        ++num;
    }

第7题 （10.0分）        题号:7        难度:难        第1章
/*--------------------------------------------------------------------
【程序设计】
----------------------------------------------------------------------
题目：根据下式求s的值。s=1/1+1/4+1/7+1/10+...+1/298.
要求：要求使用循环实现，输出结果的形式为：s=2.579
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdio.h>
int main()
{
    double sum = 1.0f;
    int i = 4;
    /**********Program**********/
 for (【?】 )
    {
        【?】 1.0【?】;
        【?】+=【?】;
    }
    /**********  End  **********/
    printf("s=%.3f", sum);
    return (0);
}
答案： for (i=4; i <= 298; )
    {
        sum += 1.0/i;
        i +=3;
    }

第8题 （10.0分）        题号:8        难度:难        第1章
/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------
题目：函数fun的功能：返回1+12+123+1234+12345……，共n（≤9）项相加的值。
例如：输入5，输出 sum=13715  
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdio.h>
int fun(int n)
{
    int sum=0;
    /**********Program**********/
【?】=0,i;
for(【?】)
{
    t【?】;
    【?】t;
【?】

    /**********  End  **********/
    return sum;
}
int main()
{
    int n;
    do
    {   printf("请输入n（1~9）：");
        scanf("%d",&n);
    }while(n<1||n>9);
    printf ("sum =%d\n",fun(n)) ;
    return 0;
}
答案：int t=0,i;
for(i=1;i<=n;i++)
{
    t=t*10+i;
    sum+=t;
  }
第9题 （10.0分）        题号:9        难度:难        第1章
/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------
题目：编写函数fun，该函数的数学表达式如样张所示。
      程序输出：
      fun(-2.1) =   -2.100
      fun(0.3) =    1.350
      fun(1.5) =    0.162
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/

#include<stdio.h>
#include<math.h>
double fun(double x)
{ 
    double y;
    /**********Program**********/
if【?】
        【?】;
    else if【?】
            y= 【?】;
    else
           【?】;
    /**********  End  **********/         
    return y;
}
int main()
{        
    printf("fun(-2.1) = %8.3lf\n", fun(-2.1));
    printf("fun(0.3) = %8.3lf\n", fun(0.3));
    printf("fun(1.5) = %8.3lf\n", fun(1.5));
}
答案： if(x<-1)
	y=x;
    else if(x<=1)
	    y= exp(x);
    else
	    y=log(x)/(x+1);

第10题 （10.0分）        题号:10        难度:难        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：求出1000以内前20个不能被2，3，5，7整除的数之和。
要求：使用程序中定义的变量
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdio.h>
#include<stdlib.h>
int  fun(int n)  
{
        int i,j=0,a[20],sum=0; /*前20个不能被2,3,5,7整除的数保存在a数组中，它们的和保存在sum中。*/
        /**********Program**********/

        for(i=0;【?】)
        {
                if((【?】))
                {
                        a[j++]【?】;  
                        //printf("%d,",i);
                }
                if(j>n-1) break;                
        }

        for(i=0;【?】)
                【?】a[i];
        /**********  End  **********/
        return sum;
}
main()
{
        printf("和为：%d\n",fun(20));
        system("pause");
}
答案：	for(i=0;i<1000;i++)
	{
		if((i%2!=0)&&(i%3!=0)&&(i%5!=0)&&(i%7!=0))
		{
			a[j++]=i;  
			//printf("%d,",i);
		}
		if(j>n-1) break;		
	}

	for(i=0;i<n;i++)
		sum+=a[i];

第11题 （10.0分）        题号:11        难度:难        第1章
/*----------------------------------------------------------------------
【程序设计】
------------------------------------------------------------------------
 题目：   编写程序，要求读入一个英文文本行，将其中每个单词的第一个字母改
          成大写，然后输出此文本行(这里"单词"是指由空格隔开的字符串)。
          例如，若输入：I am a student to take the examination.，
          则应输出：I Am A Student To Take The Examination.。

------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdlib.h>
#include<ctype.h>
#include<string.h>
#include<stdio.h>
void upfst(char *p)
{  
    /**********Program**********/
【?】 k=0;
for(【?】)
  if(k)
   { 
          if(【?】) 
          k=0;
    }
   else if(【?】)
          {  k=1;【?】;}

    /**********  End  **********/
}
int main()
{          
    char chrstr[81];
    printf("\nPlease enter an English text line:\n");
    gets(chrstr);
    printf("\nBefore changing:\n %s",chrstr);
    upfst(chrstr);
    printf("\nAfter changing:\n %s\n ",chrstr);
    system("pause");
}
答案：int k=0;
for(;*p;p++)
  if(k)
   { 
          if(*p==' ') 
          k=0;
    }
   else if(*p!= ' ')
          {  k=1;*p=toupper(*p);}

第12题 （10.0分）        题号:12        难度:难        第1章
/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------
函数fun的功能：对一个任意位数的正整数n，，从十位起计算隔位数字之和，即十位、
千位、……等数字之和。例如输入1234567，6+4+2的结果为12。
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
int fun(int n)
{
    int sum=0;
    /**********Program**********/
    n=【?】;
     【?】(n>0)
     {  
          【?】+=【?】;
    
          n=【?】;
     }
    /**********  End  **********/  
    return sum;
}
#include <stdio.h>
int main()
{
    int n;
    printf("输入一个正整数: ");
    scanf("%d",&n);
    printf("从十位起,隔位数字之和是%d\n",fun(n));
    return 0;
} 
答案： n=n/10;
 while(n>0)
{  sum=sum+n%10;
    n=n/100;
}

第13题 （10.0分）        题号:13        难度:难        第1章
/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------

程序功能：从键盘输入三个整数，比较三个数并显示相应信息，具体如下：
（1）如果三个数都相等，显示"***"；
（2）如果三个数中只有某两个数相等，显示"$$"；
（3）如果三个数互不相等，则显示"#"。
（输出要换行）
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include<stdio.h>
int main()
{
    int a,b,c;
    scanf("%d%d%d",&a,&b,&c);
    /**********Program**********/
    if(【?】)  printf("【?】");
    else if(【?】)  printf("【?】");
    else  printf("【?】");
    /**********  End  **********/
    return 0;
}
答案：if(a==b && b==c)  printf("***\n");
else if(a==b || b==c || c==a)  printf("$$\n");
else  printf("#\n");

第14题 （10.0分）        题号:14        难度:难        第1章
/*--------------------------------------------------------------------
【程序设计】
----------------------------------------------------------------------
题目：s=1+(2*2)+(3*3*3)+(4*4*4*4)+...+(9*9*9*9*9*9*9*9*9)的值
要求：使用循环实现。 输出格式：s=405071317
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdio.h>
int main()
{
    int i;
    int j;
    int sum = 0;
    int tmp;
    /**********Program**********/

      for (i=1;【?】)
  {
      【?】;
      for (j = 1; 【?】)
      {
          【?】;
      }
       【?】;
  }
    /**********  End  **********/
    printf("s=%d\n", sum);
    return (0);
}
答案：for (i = 1; i <= 9; ++i)
  {
      tmp = 1;
      for (j = 1; j <= i; j++)
      {
          tmp *= i;
      }
      sum += tmp;
  }
第15题 （10.0分）        题号:15        难度:难        第1章
/*--------------------------------------------------------------------
【程序设计】
----------------------------------------------------------------------
题目：有如下数列：1,2,2,3,3,3,4,4,4,4,5,5,5,5,5,..计算并输出前1000项的和
要求：使用循环实现。 输出结果的形式为：s=29820
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdio.h>
int main()
{
    int j = 1;
    int num = 1;
    int countNum = 0;
    int sum = 0;
    /**********Program**********/

 while (【?】)
    {
        for (【?】)
        {
            【?】;
            if (【?】)
            {
                break;
            }
            【?】 num;
        }
        ++num;
    }
    /**********  End  **********/
    printf("s=%d", sum);
    fclose(stdout);
    return (0);
}
答案： while (countNum <= 1000)
    {
        for (j = 1; j <= num; j++)
        {
            ++countNum;
            if (countNum > 1000)
            {
                break;
            }
            sum += num;
        }
        ++num;
    }
第16题 （10.0分）        题号:16        难度:难        第1章
/*--------------------------------------------------------------------
【程序设计】
----------------------------------------------------------------------
题目：根据下式求s的值。s=1/1+1/4+1/7+1/10+...+1/298.
要求：要求使用循环实现，输出结果的形式为：s=2.579
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdio.h>
int main()
{
    double sum = 1.0f;
    int i = 4;
    /**********Program**********/

 for (【?】 )
    {
        【?】 1.0【?】;
        【?】+=【?】;
    }
    /**********  End  **********/
    printf("s=%.3f", sum);
    return (0);
}
答案： for (i=4; i <= 298; )
    {
        sum += 1.0/i;
        i +=3;
    }
第17题 （10.0分）        题号:17        难度:难        第1章
/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------
题目：函数fun的功能：返回1+12+123+1234+12345……，共n（≤9）项相加的值。
例如：输入5，输出 sum=13715  

------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdio.h>
int fun(int n)
{
    int sum=0;
    /**********Program**********/
【?】=0,i;
for(【?】)
{
    t【?】;
    【?】t;
【?】
    /**********  End  **********/
    return sum;
}
int main()
{
    int n;
    do
    {   printf("请输入n（1~9）：");
        scanf("%d",&n);
    }while(n<1||n>9);
    printf ("sum =%d\n",fun(n)) ;
    return 0;
}
答案：int t=0,i;
for(i=1;i<=n;i++)
{
    t=t*10+i;
    sum+=t;
  }

第18题 （10.0分）        题号:18        难度:难        第1章
/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------
题目：编写函数fun，该函数的数学表达式如样张所示。

      程序输出：
      fun(-2.1) =   -2.100
      fun(0.3) =    1.350
      fun(1.5) =    0.162
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include<stdio.h>
#include<math.h>
double fun(double x)
{ 
    double y;
    /**********Program**********/
   
 if【?】
        【?】;
    else if【?】
            y= 【?】;
    else
           【?】;
   /**********  End  **********/         
    return y;
}

int main()
{        
    printf("fun(-2.1) = %8.3lf\n", fun(-2.1));
    printf("fun(0.3) = %8.3lf\n", fun(0.3));
    printf("fun(1.5) = %8.3lf\n", fun(1.5));
}
答案： if(x<-1)
	y=x;
    else if(x<=1)
	    y= exp(x);
    else
	    y=log(x)/(x+1);
第19题 （10.0分）        题号:19        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：求出1000以内前20个不能被2,3,5,7整除的数之和。
要求：使用程序中定义的变量
-------------------------------------------------------*/
#include"stdio.h"
void wwjt();

//fun函数功能：求出求出1000以内，前n个不能被2,3,5,7整除的数，求出这些数的和
int  fun(int n)  
{
        int i,j=0,a[20],sum=0; //前20个不能被2,3,5,7整除的数保存在a数组中，它们的和保存在sum中。
        /**********Program**********/
      

 /**********  End  **********/
       return sum;

}
void main()
{
        printf("和为：%d\n",fun(20));
                wwjt();
}
void wwjt()
{
        FILE *IN,*OUT;
        int i,n;
        IN=fopen("in.dat","r");
        if(IN==NULL)
        {
                printf("Please Verify The Current Dir..It May Be Changed");
        }
        OUT=fopen("out.dat","w");
        if(OUT==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<5;i++)
        { 
                fscanf(IN,"%i",&n);
                fprintf(OUT,"%ld\n",fun(n));  
        }
        
        fclose(IN);
        fclose(OUT);
}


答案：	for(i=0;i<1000;i++)
	{
		if((i%2!=0)&&(i%3!=0)&&(i%5!=0)&&(i%7!=0))
		{
			a[j++]=i;  
			//printf("%d,",i);
		}
		if(j>n-1) break;		
	}

	for(i=0;i<n;i++)
		sum+=a[i];

第20题 （10.0分）        题号:20        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：写程序求1-3+5-7+…-99+101的值
要求：使用程序中定义的变量  
-------------------------------------------------------*/
#include"stdio.h"
void wwjt();
//函数功能：求1-3+5-7+…-+n的值
int fun(int n)
{
int i,s=0,f=1;//i定义为循环变量，s为1-3+5-7+…-n的值
/**********Program**********/



/**********  End  **********/
        return s;
}

main()
{

        printf("%d",fun(101));

                wwjt();
}
void wwjt()
{
        FILE *IN,*OUT;
        int i,n;
        IN=fopen("in.dat","r");
        if(IN==NULL)
        {
                printf("Please Verify The Current Dir..It May Be Changed");
        }
        OUT=fopen("out.dat","w");
        if(OUT==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<5;i++)
        { 
                fscanf(IN,"%i",&n);
                fprintf(OUT,"%ld\n",fun(n));  
        }
        
        fclose(IN);
        fclose(OUT);
}
答案：	for (i=1;i<=n;i+=2)
	{
		s=s+i*f;
		f=-f;
	}
第21题 （10.0分）        题号:21        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
  题目：公式e=1+1/1!+1/2!+1/3!+......,求 e 的近似值，精度为10的-6次方。  
-------------------------------------------------------*/
#include<stdio.h>
void wwjt();
//函数功能：计算e,精度为f;
double fun(double f)
{

        double e=1;
        double jc=1;//求阶乘，并存入jc中
        /**********Program**********/



    /**********  End  **********/
        return e;
}

void main()
{
        printf("e=%f\n",fun(10e-6));
        wwjt();
}
void wwjt()
{
        FILE *IN,*OUT;
        int i;
        float  n;
        IN=fopen("in.dat","r");
        if(IN==NULL)
        {
                printf("Please Verify The Current Dir..It May Be Changed");
        }
        OUT=fopen("out.dat","w");
        if(OUT==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<5;i++)
        { 
                fscanf(IN,"%f",&n);
                fprintf(OUT,"%f\n",fun(n));  
        }      
        fclose(IN);
        fclose(OUT);
}
答案：	int i=1;
	while(1/jc>=f)
	{
		e=e+1/jc;
		i++;
		jc=jc*i;
	}
第22题 （10.0分）        题号:22        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：编程求所有4位数，这些数具有以下特点：这数本身是平方数，且其低2位和高2位所组成的2个2位数也是平方数。
要求：使用程序中定义的变量  
-------------------------------------------------------*/
#include <stdio.h>
#include <math.h>
main(){       
        int qw,bw,sw,gw; // qw 千位数 bw 百位数 sw 十位数 gw 个位数
        int a,b; //a 高两位 低两数
        int i;  //循环变量
        /**********Program**********/
  


        /**********  End  **********/

}
答案：	for(i=1000;i<10000;i++)
	{
		if(sqrt(i)==(int)sqrt(i))
		{   
			qw=i/1000;
			bw=i%1000/100;
			sw=i%100/10;
			gw=i%10;
			
			a=qw*10+bw;
			b=sw*10+gw;
			
			if(sqrt(a)==(int)sqrt(a) && sqrt(b)==(int)sqrt(b))
			{
				printf("%d\n",i);   
			} 
		}
	}

第23题 （10.0分）        题号:23        难度:中        第1章
/*------------------------------------------------
【程序设计】
--------------------------------------------------
功能：从键盘为一维整型数组输入10个整数，调用fun 函
      数找出其中最小的数，并在main函数中输出。。
------------------------------------------------*/

#include "stdio.h"
void wwjt();
int fun(int x[],int n) {  
        /**********Program**********/  




        
        /**********  End  **********/  
}
void main(){
        int a[10],i,min;
        for(i=0;i<10;i++)
                scanf("%d",&a[i]);
        for(i=0;i<10;i++)
                printf("%3d",a[i]);
        printf("\n");
        min=fun(a,10);
        printf("%d\n",min); 

        wwjt();
} 



void wwjt()
{
  FILE *IN,*OUT;
  int in[4],out;
  IN=fopen("in.dat","r");
  if(IN==NULL)    printf("Read FILE Error");
  OUT=fopen("out.dat","w");
  if(OUT==NULL)   printf("Write FILE Error");
  
  for(int j=0;j<5;j++)
  {
          
          for(int i=0;i<4;i++)
          {   
                  fscanf(IN,"%d",&in[i]);
          }   
          out=fun(in,4);
          fprintf(OUT,"%d\n",out);
  }
  fclose(IN);
  fclose(OUT);
}

答案： int min,i;
	min=x[0];
	for(i=1;i<n;i++)
	{if(x[i]<min) min=x[i];}
	return min;
第24题 （10.0分）        题号:24        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
  题目：在矩阵a中选出各行最大的元素组成一个一维数组b。
        如图片1所示。 
-------------------------------------------------------*/
#include  <stdio.h>
void wwjt();
#define R  3
#define C  4
int * MaxRow(int a[R][C])
{
        int static  b[R];
        int i,j,imax;
/**********Program**********/




/**********  End  **********/
        return b;
}
void main()
{  
        int  a[R][C];
        int  *b,i,j;
        for(i=0;i<R;i++)
                for(j=0;j<C;j++)
                        scanf("%d",&a[i][j]);

    b=MaxRow(a);
        for(i=0;i<R;i++)
        {
                printf("%4d",b[i]);
        }
        wwjt();
}
void wwjt()
{
        FILE *IN,*OUT;
        int  a[R][C];
        int  *b,i,j;
        IN=fopen("in.dat","r");
        if(IN==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        OUT=fopen("out.dat","w");
        if(OUT==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<R;i++)
        {
                for(j=0;j<C;j++)
                {
            fscanf(IN,"%d",&a[i][j]);
                }
        } 

    b=MaxRow(a);
    for(i=0;i<R;i++)
        {
                fprintf(OUT,"%d\n",b[i]);
        } 
        fclose(IN);
        fclose(OUT);
} 
答案：
	for( i=0;i<R;i++)
	{
		imax=a[i][0];
		for(j=1;j<C;j++)
			if(imax<a[i][j])
				imax=a[i][j];
			b[i]=imax;			
	}

第25题 （10.0分）        题号:25        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
  题目：C语言编程题实现以下功能：
  1) 从键盘输入10个学生的成绩，计算平均成绩ave
  2) 统计及格人数pass，计算高于平均分的学生的人数better
  3) 将10个学生成绩排名。  
-------------------------------------------------------*/
#include "stdio.h"
#define N 10
void main()
{
        int i,j,a[N],ave,sum=0,pass=0,better=0,t;

/**********Program**********/




/**********  End  **********/
        printf("平均分:%d\n及格人数%d\n高于平均分人数%d\n",ave,pass,better);
}


答案：        for(i=0;i<N;i++)
        {
                scanf("%d",&a[i]);
                sum+=a[i];
        }
        ave=sum/N;
        for(i=0;i<N;i++)
        {
                if(a[i]>=60)
                        pass++;
                if(a[i]>ave)
                        better++;
        }
        for(i=0;i<N;i++)
                for(j=i+1;j<N;j++)
                {
                        if (a[i]<a[j])
                        {
                                t=a[i];
                                a[i]=a[j];
                                a[j]=t;
                        }
                }
                for(i=0;i<N;i++)
                {
                        printf("%d",a[i]);
                }

第26题 （10.0分）        题号:26        难度:中        第91章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
  题目：输出6~10000之间的亲密数对。说明：若(a,b)是亲密数对，则a的因子和等于b，
  b的因子和等于a，且a不等于b。如(220,284)是一对亲密数对。
-------------------------------------------------------*/
#include <stdio.h>
void wwjt();
//如果a存在亲密数b，返回b，否则返回0.
int isClose(int a)
{
        int i,b=1,c=1;
/**********Program**********/



/**********  End  **********/
}

void main( )
{  
        int  a,b=1;
        for(a=6;a<=10000;a++) 
        {
                if (isClose(a))
                {
                        printf("%6d,%6d\n",a,isClose(a));
                }
        }

        wwjt();
}
void wwjt()
{
        
        FILE *IN,*OUT;
        int j,a;
        IN=fopen("in.dat","r");
        if(IN==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        OUT=fopen("out.dat","w");
        if(OUT==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(j=0;j<16;j++)
        {
                fscanf(IN,"%d",&a);
            //fscanf(IN,"%d",&b);

                if (isClose(a))
                {
                        fprintf(OUT,"%6d,%6d\n",a,isClose(a));
                }
        } 

        
        fclose(IN);
        fclose(OUT);
}
答案：	for(i=2;i<=a/2;i++)
		if(a%i==0)  b=b+i;
		for(i=2;i<=b/2;i++)
			if(b%i==0)  c=c+i;			
	if(a==c&&a!=b)	return b;

	return 0;

第27题 （10.0分）        题号:27        难度:中        第91章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

  题目：编程序按如图片所示公式计算s的值（其中x1、x2、、…、x10由键盘输入）。
         （其中x0是x1、x2、、…、x10的平均值） 
-------------------------------------------------------*/
#include <stdio.h>
void wwjt();
#define N 10

float fun(float x0,float x[N])
{
        int i;
        float s=0;
/**********Program**********/


/**********  End  **********/
        return s;
}


void main( )
{  
        float  x[N], x0=0, s=0;
        int i;
        for (i=0 ; i<N; i++)   scanf( "%f", &x[i]); 
    s=fun(x0,x);
        printf( "s=%f\n", s);

        wwjt();
}

void wwjt()
{        
        FILE *IN,*OUT;
        int j;
        float x[N];
        IN=fopen("in.dat","r");
        if(IN==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        OUT=fopen("out.dat","w");
        if(OUT==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(j=0;j<10;j++)
        {
                fscanf(IN,"%f",&x[j]);
        } 
        fprintf(OUT,"%f\n",fun(0,x));
        
        fclose(IN);
        fclose(OUT);
}
答案：
	for (i=0 ; i<N; i++)  x0=x0+x[i];
	x0=x0/N;
	for(i=0 ; i<N; i++)  s=s+(x[i]-x0) * (x[i]-x0);
第28题 （10.0分）        题号:28        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：编写函数fun，其功能是：根据以下公式求π的值(要求精度0.0005，即某项
      小于0.0005时停止迭代)。
      程序运行后，若输入精度0.0005，则程序应输出为3.14…。
注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。
-------------------------------------------------------*/
#include <stdio.h>
#include <math.h>

void wwjt();

double  fun ( double  eps)
{
        double s=1.0,s1=1.0;
        int n=1;
        /**********Program**********/


        /**********  End  **********/
}
main( )
{ 
        double  x;
        printf("Input eps:") ;
        scanf("%lf",&x); printf("\neps = %lf, PI=%lf\n", x, fun(x));

        wwjt();
}
void wwjt()
{
        FILE *IN,*OUT;
        int i;
        double iIN;
        double iOUT;
        IN=fopen("in.dat","r");
        if(IN==NULL)
        {
                printf("Please Verify The Currernt Dir..it May Be Changed");
        }
        OUT=fopen("out.dat","w");
        if(OUT==NULL)
        {
                printf("Please Verify The Current Dir.. it May Be Changed");
        }
        for(i=0;i<10;i++)
        {        
                fscanf(IN,"%lf",&iIN);
                iOUT=fun(iIN);
                fprintf(OUT,"%lf\n",iOUT);
        }
        fclose(IN);
        fclose(OUT);
}

答案：    while(s1>=eps)       
    {
        s1=s1*n/(2*n+1);    
        s=s+s1;            
        n++;
    }
    return 2*s;

第29题 （10.0分）        题号:29        难度:中        第92章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编程序按如图片所示公式计算y的值（精度为1e-6，即最后一项的绝对值小于
       1e-6时结束。）
   
-------------------------------------------------------*/
#include <stdio.h>
void main( )
{ 
/**********Program**********/


/**********  End  **********/
}  


答案：	   int r=1;
	   double x, y=0 ;
	   while(x>=1e-6) 
	   {
		   x=1.0/(r*r+1);  
		   printf("x=%f\n", x);
		   y=y+x; 
		   r++;
	   }
	   printf("y=%f\n",y);

第30题 （10.0分）        题号:30        难度:中        第92章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

  题目：已知某班5名学生的三门课成绩。试编写程序，输入这5个学生的三门课成绩
        a[5][3]，输出每门课成绩的平均分vag[3]。

-------------------------------------------------------*/
#include <stdio.h>
void main( )
{  

/**********Program**********/


/**********  End  **********/


}


答案：    float  a[5][3], vag[ ]={0,0,0};
	int  i ,j;
	printf("每人一行的输入5名学生的三种成绩\n");
	for(i=0; i<5; i++)
		for(j=0; j<3; j++)
			scanf("%f", &a[i][j]) ;
		for(j=0 ; j<3; j++)
			for(i=0; i<5; i++)  vag[j]=vag[j]+a[i][j];
			for(j=0; j<3; j++)  vag[j]=vag[j]/5;
            printf("课程一的平均分=%f\n课程二的平均分=%f\n课程三的平均分=%f\n ", vag[0],vag[1],vag[2]);

第31题 （10.0分）        题号:31        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun,其功能是：求出1~100之间能被7或11整除，但不能同时被7和11整
      除的所有整数，并将其放在a所指的数组中，通过n返回这些数的个数。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt();

void  fun (int *a, int *n)
{

        /**********Program**********/
          

        /**********  End  **********/
}

main( )
{  
        int aa[100], n, k ;

        fun ( aa, &n ) ;
        for ( k = 0 ; k < n ; k++ )
                if((k + 1) % 10 == 0) 
                        printf("\n") ;
                else
                        printf("%5d", aa[k]) ;
        wwjt( );
}

void wwjt ( )
{/* 本函数用于打开文件，输入测试数据，调用fun函数，输出数据，关闭文件。*/
        FILE *out ;
        int aa[100], n, k ;

        out = fopen("out.dat","w") ;
        fun ( aa, &n ) ;
        for ( k = 0 ; k < n ; k++ )
                if((k + 1) % 10 == 0) 
                        fprintf(out, "\n") ;
                else 
                        fprintf(out, "%5d", aa[k]) ;
        fclose(out) ;
}


答案：    int i,j=0;
    for(i=1;i<=100;i++)    
        if((i%7==0||i%11==0)&&i%77!=0) 
            a[j++]=i;
            *n=j;

第32题 （10.0分）        题号:32        难度:中        第93章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：求Sn=a+aa+aaa+……+aa…a之值，其a中代表1到9中的一个数字。例如：a代表2，
      则求2+22+222+2222+22222（此时n=5），a和n由键盘输入。

-------------------------------------------------------*/
#include <stdio.h>
void wwjt();

int fun(int a,int n)
{
        int t=a,i,s;  /*  t 表示每个项   */

/**********Program**********/



/**********  End  **********/
}


void main( )
{  
        int a, n, s ;
        printf("输入a和n的值：");
        scanf("%d,%d", &a, &n) ;
        printf("a=%d, n=%d:\n", a, n) ;
    s=fun(a,n);
        printf("a+aa+aaa+...+aa..a=%d\n", s);
        wwjt();
}



void wwjt()
{
        
        FILE *IN,*OUT;
        int j;
        int a,n;
        IN=fopen("in.dat","r");
        if(IN==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        OUT=fopen("out.dat","w");
        if(OUT==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(j=0;j<3;j++)
        {
                fscanf(IN,"%d",&a);
                fscanf(IN,"%d",&n);
                fprintf(OUT,"%d\n",fun(a,n));

        } 
        
        fclose(IN);
        fclose(OUT);
}


答案：	for(i=1, s=0; i<=n; i++) 
	{
		s=s+t;  /*  s 表示求和项  */
		t=t*10+a ;  /*  计算下一项  */
	}
	return s;

第33题 （10.0分）        题号:33        难度:中        第93章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写一个C程序，定义一个日期结构变量date(由年year、月month、日day3个整型数据组成)，
      从键盘为该变量中的各成员输入数据，然后再将输入的日期显示出来。

-------------------------------------------------------*/
#include <stdio.h>

void main()
{  

/**********Program**********/


/**********  End  **********/

}


答案：    struct  DATE
	{ 
		int  year; 
		int month;
		int day;
	} ;

	struct  DATE date;

	printf("please  input:");
	scanf("%d%d%d", &date.year, &date.month, &date.day);
	printf("please  output: ");
	printf("%d-%d-%d\n", date.year, date.month, date.day);

第34题 （10.0分）        题号:34        难度:中        第1章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数fun求1!+2!+3!+ …… +n!的和,在main函
      数中由键盘输入n值，并输出运算结果。请编写fun
      函数。
例如：若n值为5，则结果为153。

------------------------------------------------*/
    
#include<stdio.h>
void wwjt();
 
long int  fun(int n)
{
  
  /**********Program**********/

  
  
  
  
  /**********  End  **********/
  
}

main()
{
  int n;
  long int result;
  scanf("%d",&n);
  result=fun(n);
  printf("%ld\n",result);
  wwjt();
}

void wwjt()
{
FILE *IN,*OUT;
  int i;
  int iIN;
  long int iOUT;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..It May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. It May Be Changed");
  }
  for(i=0;i<10;i++)
  {        
    fscanf(IN,"%d",&iIN);
    iOUT=fun(iIN);
    fprintf(OUT,"%ld\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i;
float f=1,s=0;
for(i=1;i<=n;i++)
 {f=f*i;
  s=s+f;}
 return s;
----------------------

第35题 （10.0分）        题号:35        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：规定输入的字符串中只包含字母和*号。编写函数fun，其功能是：删除字符串中所
      有的*号。编写函数时，不得使用C语言提供的字符串函数。

例如：字符串中的内容为：****A*BC*DEF*G*******，删除后字符串中的内容应当
      是：ABCDEFG。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干的语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt();

void  fun( char *a )
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{  
        char s[81];
   
        printf("Enter a string:\n");
        gets(s);
        fun( s );
        printf("The string after deleted:\n");
        puts(s);

        wwjt();
}

void wwjt()
{
        FILE *IN,*OUT;
        int i;
        char s[81];
        
        IN=fopen("in.dat","r");
        if(IN==NULL)
        {
                printf("Please Verify The Currernt Dir..it May Be Changed");
        }
        OUT=fopen("out.dat","w");
        if(OUT==NULL)
        {
                printf("Please Verify The Current Dir.. it May Be Changed");
        }
        for(i=0;i<10;i++)
        {        
                fscanf(IN,"%s",s);
                fun(s);
                fprintf(OUT,"%s\n",s);
        }
        fclose(IN);
        fclose(OUT);
}

答案：	int i,j=0;
      	for(i=0;a[i]!='\0';i++)
		if(a[i]!='*') 
			a[j++]=a[i];    /*若不是要删除的字符'*'则留下*/
	a[j]='\0';


第36题 （10.0分）        题号:36        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：实现两个字符串的连接(不要使用库函数strcat)，即
      把p2所指的字符串连接到p1所指的字符串的后面。

例如：分别输入下面两个字符串：FirstString－－SecondString

程序输出：FirstString－－SecondString

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt();

void fun(char p1[], char p2[])
{

        /**********Program**********/


        /**********  End  **********/
}

main()
{    
        char s1[80], s2[40] ;

        printf("Enter s1 and s2:\n") ;
        scanf("%s%s", s1, s2) ;
        printf("s1=%s\n", s1) ;
        printf("s2=%s\n", s2) ;
        printf("Invoke fun(s1,s2):\n") ;
        fun(s1, s2) ;
        printf("After invoking:\n") ;
        printf("%s\n", s1) ;
        wwjt() ;
}

void wwjt ()
{/* 本函数用于打开文件，输入测试数据，调用fun函数，输出数据，关闭文件。*/
        int i ;
        FILE *IN, *OUT ;
        char s1[80], s2[40] ;

        IN=fopen("in.dat","r");
        if(IN==NULL)
        {
                printf("Please Verify The Currernt Dir..it May Be Changed");
        }
        OUT=fopen("out.dat","w");
        if(OUT==NULL)
        {
                printf("Please Verify The Current Dir.. it May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(IN, "%s", s1) ;
                fscanf(IN, "%s", s2) ;
                fun(s1, s2) ;
                fprintf(OUT, "%s\n", s1) ;
        }
        fclose(IN) ;
        fclose(OUT) ;
}


答案：	int i,j;
	for(i=0;p1[i]!='\0';i++)  ;  
	for(j=0;p2[j]!='\0';j++)
		p1[i++]=p2[j];
		p1[i]='\0';


第37题 （10.0分）        题号:37        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：某学生的记录由学号、8门课程成绩和平均分组成，学号和8门课程的成绩已在
      主函数中给出，请编写函数fun，其功能是：求出该学生的平均分，并放入记
      录的ave成员中。

例如：学生的成绩是：85.5,76,69.5,85,91,72,64.5，87.5，则他的平均分应为78.875。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun部位中填入你编写
      的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

#define   N   8

void wwjt (  );

typedef  struct
{  
        char  num[10];
        double  s[N];
        double  ave;
} STREC;

void  fun(STREC *a)
{

        /**********Program**********/


        /**********  End  **********/
}

main()
{  
        STREC  s={"GA005",85.5,76,69.5,85,91,72,64.5,87.5};
        int  i;
        fun( &s );
        printf("The %s's student data:\n", s.num);
        for(i=0;i<N; i++)
                printf("%4.1f\n",s.s[i]);
                printf("\nave=%7.3f\n",s.ave);
        wwjt();
}
void wwjt()
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *out ;
        int i ; STREC s[10] = {
        {"GA005",85.5,76,69.5,85,91,72,64.5,87.5},
        {"GA001",82.5,66,76.5,76,89,76,46.5,78.5},
        {"GA002",72.5,56,66.5,66,79,68,46.5,58.5},
        {"GA003",92.5,76,86.5,86,99,86,56.5,88.5},
        {"GA004",82,66.5,46.5,56,76,75,76.5,63.5},
        {"GA006",75.5,74,71.5,85,81,79,64.5,71.5},
        {"GA007",92.5,61,72.5,84,79,75,66.5,72.5},
        {"GA008",72.5,86,73.5,80,69,63,76.5,53.5},
        {"GA009",66.5,71,74.5,70,61,82,86.5,58.5},
        {"GA010",76,66.5,75.5,60,76,71,96.5,93.5},
        };
        out = fopen("out.dat","w") ;
        for(i = 0 ; i < 10 ; i++) 
        {
                fun(&s[i]) ;
                fprintf(out, "%7.3f\n", s[i].ave) ;
        }
        fclose(out) ;
}



答案：	double ave=0.0;
	int i;
	for(i=0;i<N;i++)
		a->ave=a->ave+a->s[i];
		a->ave/=N;

第38题 （10.0分）        题号:38        难度:易        第1章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：从键盘为一维整型数组输入10个整数，调用fun
      函数找出其中最小的数，并在main函数中输出。
      请编写fun函数。

-------------------------------------------------*/

#include "stdio.h"
void wwjt();

int fun(int x[],int n)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
  
}

main()
{
  int a[10],i,min;
  for(i=0;i<10;i++)
    scanf("%d",&a[i]);
  for(i=0;i<10;i++)
    printf("%3d",a[i]);
  printf("\n");
  min=fun(a,10);
  printf("%d\n",min);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int iIN[10],i;
  int iOUT,iCOUNT;
  IN=fopen("4.IN","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("4.out","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<10;i++)
  {   
    for(iCOUNT=0;iCOUNT<10;iCOUNT++)
      fscanf(IN,"%d",&iIN[iCOUNT]);
    iOUT=fun(iIN,10);
    fprintf(OUT,"%d\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int min,i;
min=x[0];
for(i=1;i<n;i++)
{if(x[i]<min) min=x[i];}
return min;
----------------------

第39题 （10.0分）        题号:39        难度:中        第1章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：从键盘输入一个大于3的整数，调用函数fun判断
      其是否素数，然后在main函数中输出相应的结论
      信息。
例如：7是素数，8不是素数。请编写fun函数。素数是
      仅能被1和自身整除的数

-------------------------------------------------*/

#include <stdio.h>
void wwjt();

int fun(int n)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
} 
    
main()
{
  int m,flag;
  printf("input an integer:");
  scanf("%d",&m);
  flag=fun(m);
  if(flag)
    printf("%d is a prime.\n",m);
  else
    printf("%d is not a prime.\n",m);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int iIN,iOUT,i;
  IN=fopen("5.IN","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("5.out","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<10;i++)        
  {        
    fscanf(IN,"%d",&iIN);
    iOUT=fun(iIN);
    fprintf(OUT,"%d\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i;
int j;
j= 1;
for(i=2;i<n;i++)
{if(n%i==0) j= 0;
}
return j;
----------------------

第40题 （10.0分）        题号:40        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：N名学生的成绩已在主函数中放入一个带头节点的链表结构中，h指向链表的头节点。
      请编写函数fun，其功能是：求出平均分，并由函数值返回。

例如：若学生的成绩是：85　76　69　85　91　72　64　87，则平均分应当是：78.625。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入你
      编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>

#define   N   8

void wwjt (  );

struct  slist
{  
        double   s;
        struct slist  *next;
};
typedef  struct slist  STREC;
double  fun( STREC *h  )
{
        /**********Program**********/
 

        /**********  End  **********/
}

STREC * creat( double *s)
{ 
        STREC  *h,*p,*q;   int  i=0;
        h=p=(STREC*)malloc(sizeof(STREC));p->s=0;
        while(i<N)
        {        
                q=(STREC*)malloc(sizeof(STREC));
                q->s=s[i]; i++;  p->next=q; p=q;
        }
        p->next=0;
        return  h;
}
outlist( STREC *h)
{ 
        STREC  *p;
        p=h->next; printf("head");
        do
        {
                printf("->%4.1f",p->s);p=p->next;
        }
        while(p!=0);
        printf("\n\n");
}
main()
{  
        double  s[N]={85,76,69,85,91,72,64,87},ave;
        STREC  *h;
        h=creat( s );   
        outlist(h);
        ave=fun( h );
        printf("ave= %6.3f\n",ave);
        wwjt();
}
void wwjt()
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i,j ; double  s[N],ave;
        STREC *h ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                for(j=0 ; j < N; j++) 
                        fscanf(in, "%lf,", &s[j]) ;
                h=creat( s );
                ave=fun( h );
                fprintf(out, "%6.3lf\n", ave) ;    
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	double ave=0.0;
	STREC *p=h->next;
	while(p!=NULL)
	{	
		ave=ave+p->s; 
		p=p->next;
	}
	return ave/N;

第41题 （10.0分）        题号:41        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：将所有大于1小于整数m的非素数存入xx所指数组中，非
      素数的个数通过k返回。

例如：若输入17，则应输出：4　6　8　9　10　12　14　15　16。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt (  );

void fun( int m, int *k, int xx[] )
{

        /**********Program**********/


        /**********  End  **********/
}

main()
{
        int m, n, zz[100];
        printf( "\nPlease enter an integer number between 10 and 100: " );
        scanf(  "%d", &n );
        fun( n, &m, zz );
        printf( "\n\nThere are %d non-prime numbers less than %d:", m, n );
        for( n = 0; n < m; n++ )
                printf( "\n  %4d", zz[n] );
        wwjt();
}

void wwjt()
{        
        FILE *in, *out ;
        int m, n, zz[100];

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        fscanf( in, "%d", &n );
        fun( n, &m, zz );
        fprintf(out, "%d\n%d\n", m, n );
        for( n = 0; n < m; n++ )
                fprintf(out, "%d\n", zz[n] );
        fclose(in) ;
        fclose(out) ;
}

答案：	int i,j,n=0;
	for(i=4;i<m;i++)  /*找出大于1小于整数m的非素数*/
	{	
		for(j=2;j<i;j++)
			if(i%j==0) 
				break;
		if(j<i) 
			xx[n++]=i;
	}
	*k=n;    /*返回非素数的个数*/

第42题 （10.0分）        题号:42        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：求ss所指字符串中指定字符的个数，并返回此值。

例如：若输入字符串123412132，输入字符为1，则输出3。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>

#define  M 81

void wwjt (  );

int fun(char *ss, char c)
{
        /**********Program**********/


        /**********  End  **********/
}

main()
{ 
        char  a[M], ch;
        printf("\nPlease enter a string:");
        gets(a);
        printf("\nPlease enter a char:"); 
        ch = getchar();
        printf("\nThe number of the char is: %d\n", fun(a, ch));
        wwjt ( );
}

void wwjt ( )
{/* 本函数用于打开文件，输入测试数据，调用fun函数，输出数据，关闭文件。*/
        int i ;
        FILE *in, *out ;
        char a[M], b[M], ch ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%s", a) ;
                fscanf(in, "%s", b) ;
                ch = *b ;
                fprintf(out, "%c=%d\n", ch, fun(a, ch)) ;
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	int i=0;
	for(;*ss!='\0';ss++)
		if(*ss==c) 
			i++;
	return i;

第43题 （10.0分）        题号:43        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：计算n门课程的平均分，结果作为函数值返回。

例如：若有5门课程的成绩是：90.5,72,80,61.5,55，则函数的值为：71.80。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中的填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt (  );

float  fun ( float  *a ,  int  n )
{

        /**********Program**********/


        /**********  End  **********/
}

main()
{ 
        float score[30]={90.5, 72, 80, 61.5, 55}, aver;
        aver = fun( score, 5 );
        printf( "\nAverage score  is: %5.2f\n", aver);

        wwjt ( );
}

void wwjt ( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, j ;
        float aver, score[5] ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                for(j = 0 ; j < 5 ; j++) 
                        fscanf(in,"%f,",&score[j]) ;
                aver = fun(score, 5) ;
                fprintf(out, "%5.2f\n", aver) ;
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	int i;
	float av=0.0; 
	for(i=0; i<n;i++)
	av=av+a[i]; 
	return(av/n);

第44题 （10.0分）        题号:44        难度:中        第4章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：对任意输入的 x，用下式计算并输出 y 的值。
            5      x<10
      y=    0      x=10
           -5      x>10

------------------------------------------------*/

#include<stdio.h>
void wwjt();

int fun(int n)
{
 
  /**********Program**********/





  /**********  End  **********/
  
}

void main ()
{
    int  x,y;
    printf("enter x:");
    scanf("%d",&x);
    y=fun(x);
    printf("x=%d,y=%d\n",x,y);
    wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int i;
  int iIN;
  long int iOUT;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<5;i++)
  {        
    fscanf(IN,"%d",&iIN);
    iOUT=fun(iIN);
    fprintf(OUT,"%ld\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：    int m;
    if(n<10)
      m=5;
    else 
      if(n==10) m=0;
    else m=-5;
return m;
或
   int m;
   if(n>=10)
      if(n>10)  
         m=-5;
      else m=0;
   else m=5;
return m;






第45题 （10.0分）        题号:45        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：规定输入的字符串中只包含字母和*号。请编写函数fun，其功能
      是：除了字符串前导的*号之外，将串中其它*号全部删除。
      在编写函数时，不得使用C语言提供的字符串函数。

例如：字符串中的内容为：****A*BC*DEF*G*******，删除后，字符串中的内容
      应当是：****ABCDEFG。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt ();

void  fun( char *a )
{
        /**********Program**********/


        /**********  End  **********/
}

main()
{  
        char  s[81];
        printf("Enter a string:\n");
        gets(s);
        fun( s );
        printf("The string after deleted:\n");
        puts(s);
        wwjt();
}
void wwjt ()
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i ; char s[81] ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++)
        {
                fscanf(in, "%s", s) ;
                fun(s) ;
                fprintf(out, "%s\n", s) ;    
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	int i=0;
	char *p=a;
	while(*p&&*p=='*')
	{
		a[i]=*p;
		i++;
		p++;
	}
	while(*p)
	{
		if(*p!='*')
		{
			a[i]=*p;i++;
		}
		 p++;
	}
	a[i]='\0';

第46题 （10.0分）        题号:46        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数void fun(char *tt，int pp[])，统计在tt所指的字符串中'a'到'z'26个
      小写字母各自出现的次数，并依次放在pp所指的数组中。

例如：当输入字符串abcdefgabcdeabc后，程序的输出结果应该是：
      3 3 3 2 2 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0

注意： 请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
       你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>

void wwjt (  );

void fun(char *tt, int pp[])
{
        /**********Program**********/


        /**********  End  **********/
}

main( )
{  
        char aa[1000] ;
        int  bb[26], k ;
        
        printf( "\nPlease enter  a char string:" ) ; 
        scanf("%s", aa) ;
        fun(aa, bb ) ;
        for ( k = 0 ; k < 26 ; k++ ) 
                printf ("%d ", bb[k]) ;
        printf( "\n" ) ;
        wwjt ( ) ;
}

void wwjt ( )
{/* 本函数用于打开文件，输入测试数据，调用fun函数，输出数据，关闭文件。*/
        FILE *in, *out ;
        char aa[1000] ;
        int bb[26], k, i ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%s", aa) ;
                fun(aa, bb) ;
                for ( k = 0 ; k < 26 ; k++ )
                        fprintf (out, "%d ", bb[k]) ;
                fprintf(out, "\n" ) ;
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	int i;
	for(i=0;i<26;i++)
		pp[i]=0;         /*初始化pp数组各元素为0*/
	for(;*tt!='\0';tt++)
		if(*tt>='a'&&*tt<='z')   
			pp[*tt-'a']++;  

第47题 （10.0分）        题号:47        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：规定输入的字符串中只包含字母和*号。请编写函数fun，其功能
      是：将字符串尾部的*号全部删除，前面和中间的*号不动。

例如：字符串中的内容为："****A*BC*DEF*G*******"，删除后，字符串中的内容
      应当是："****A*BC*DEF*G"。在编写函数时，不得使用C语言提供的字符串
      函数。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt ( );

void  fun( char *a )
{
        /**********Program**********/


        /**********  End  **********/
}

main()
{  
        char  s[81];
        printf("Enter a string:\n");
        gets(s);
        fun( s );
        printf("The string after deleted:\n");
        puts(s);

        wwjt( );
}
void wwjt ( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i ; char s[81] ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++)
        {
                fscanf(in, "%s", s) ;
                fun(s) ;
                fprintf(out, "%s\n", s) ;    
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	while(*a!='\0')
		a++;
		a--;
	while(*a=='*')
		a--;
	*(a+1)='\0';

第48题 （10.0分）        题号:48        难度:易        第5章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：用do-while语句求1～100的累计和。

------------------------------------------------*/
#include<stdio.h>
void wwjt();
 
long int  fun(int n)
{
 
  /**********Program**********/





  /**********  End  **********/
  
}

void main ()
{
    int i=100;
    printf("1~100的累加和为：%ld\n",fun(i));
    wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int i;
  int iIN;
  long int iOUT;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<5;i++)
  {        
    fscanf(IN,"%d",&iIN);
    iOUT=fun(iIN);
    fprintf(OUT,"%ld\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：  int i =1, sum =0; 
    do     
    {  sum = sum + i;	   
      i++;		   
   } while ( i <= n );
  return sum;






第49题 （10.0分）        题号:49        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：比较字符串的长度，(不得使用C语言提供的求字符串长
      度的函数)，函数返回较长的字符串。若两个字符长度相同，则返回第一个字符串。

例如：输入beijing<CR>shanghai<CR>(<CR>为回车键)，函数将返回shanghai。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt ( );

char  *fun ( char *s,  char *t)
{
        /**********Program**********/


        /**********  End  **********/
}

main( )
{ 
        char a[20],b[20];
        printf("Input 1th string:") ;
        gets( a);
        printf("Input 2th string:") ;
        gets( b);
        printf("%s\n",fun (a, b ));
        wwjt ();
}

void wwjt ( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i ;
        char a[20], b[20] ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%s %s", a, b) ;
                fprintf(out, "%s\n", fun(a, b)) ;
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	int i,j;
	for(i=0;s[i]!= '\0';i++);
	for(j=0;t[j]!= '\0';j++);
	if(i<=j)         
		return t;     
	else 
		return s;

第50题 （10.0分）        题号:50        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：函数fun的功能是：将s所指字符串中除下标为偶数同时ASCII码值也为偶数的字符
      外,其余的全部删除；字符串中剩余字符所形成的新串放在t所指的数组中。

例如：若s所指字符串中的内容为"ABCDEFG123456",其中字符A的ASCII码值为奇数,因此应
      当删除；字符B的ASCII码值为偶数,但在数组中的下标为奇数,因此也应当删除；字
      符2的ASCII码值为偶数,在数组中的下标也为偶数,因此不应当删除,其他依此类推。
      最后t所指的数组中的内容应是"246"。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>

void wwjt (  );

void fun(char *s, char t[])
{
      /**********Program**********/


      /**********  End  **********/
}

main()
{
        char   s[100], t[100];
        printf("\nPlease enter string S:"); 
        scanf("%s", s);
        fun(s, t);
        printf("\nThe result is: %s\n", t);
        wwjt();
}

void wwjt ( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        char s[100], t[100] ;
        FILE *in, *out ;
        int i ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%s", s) ;
                fun(s, t) ;
                fprintf(out, "%s\n", t) ;
        }
        fclose(in) ;
        fclose(out) ;
}

答案：	int i,j=0;
	for(i=0;s[i]!='\0';i++)
		if(i%2==0  &&  s[i]%2==0)
			t[j++]=s[i];
	t[j]='\0';

第51题 （10.0分）        题号:51        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：利用如样张所示的简单迭代方法求方程cos(x)－x＝0的
      一个实根。  
      迭代步骤如下：    
             (1)取x1初值为0.0；   
             (2)x0＝x1，将x1的值赋给x0；  
             (3)x1＝cos(x0)，求出一个新的x1；   
             (4)若x0－x1的绝对值小于0.000001，执行步聚(5)，否则执行步聚(2)； 
             (5)所求x1就是方程cos(x)－x＝0的一个实根，作为函数值返回。
    
      程序将输出结果Root＝0.739086。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <math.h>
#include <stdio.h>

void wwjt (  );

double fun()
{
        /**********Program**********/


        /**********  End  **********/
}

main()
{
   
        printf("Root =%f\n", fun());

        wwjt();
}

void wwjt (  )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *out ;

        out = fopen("out.dat","w") ;
        fprintf(out, "%f\n", fun()) ;
        fclose(out) ;
}


答案：	double x0,x1;
	x1=0.0;
	do
	{
		x0=x1;
		x1=cos(x0);
	}
	while(fabs(x0-x1)>=1e-6);
	return x1;

第52题 （10.0分）        题号:52        难度:较难        第6章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：输入2个学生3门课的成绩，计算学生成绩平均分，
      课程平均分和最高分. 
例如：输入2名学生3门课的成绩分别为92，87，68，56，
      92，84 则
      学生1平均分：82.33
      学生2平均分：77.33
      课程1平均分：74.00
      课程2平均分：89.50
      课程3平均分：76.00
      最高分为：92

------------------------------------------------*/
#include <stdio.h>
void wwjt();
 
/*定义全局变量*/
/*学生成绩平均分*/
float StuAgv[2];
/*课程平均分*/
float CouAgv[3];
/*所有学生的所有课程最高分*/
float Max=0;

/*说明：需要在下面函数中把题干要求中的结果赋值到上面定义一变量中*/
void fun(float score[2][3])
{
  
  /**********Program**********/





  /**********  End  **********/
  
}

void main()
{
        int i,j;
        float score[2][3];
    
        printf("输入学生的成绩:");
    for(i=0;i<2;i++)
      for(j=0;j<3;j++)
         scanf("%f",&score[i][j]);

    printf("\n输出学生的成绩:");
    for(i=0;i<2;i++)
        {  
           for(j=0;j<3;j++)
             printf("%.2f  ",score[i][j]);
       printf("\n"); 
        }
   

    fun (score);

    for(i=0;i<2;i++)
       printf("第%d个学生的平均成绩是:%0.2f\n",i+1,StuAgv[i]);

    for(j=0;j<3;j++)
       printf("第%d门课的平均成绩是:%0.2f\n",j+1,CouAgv[j]);
        
        printf("所有分数中的最高分为：%.2f\n",Max);

        wwjt();
}


void wwjt()
{
  FILE *IN,*OUT;
  float iIN[2][3];
  int i,j;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }

  for(i=0;i<2;i++)
    for(j=0;j<3;j++)
      fscanf(IN,"%f",&iIN[i][j]);
  fun(iIN);
  for(i=0;i<2;i++)
    fprintf(OUT,"%.2f\n",StuAgv[i]);
  for(j=0;j<3;j++)
    fprintf(OUT,"%.2f\n",CouAgv[j]);
  fprintf(OUT,"%.2f\n",Max);
        fclose(IN);
  fclose(OUT);
  return ;
}

答案：	int i,j;
	float sum;
    for(i=0;i<2;i++)            /*计算第i个学生平均分*/
	{
	  sum=0;
      for(j=0;j<3;j++)
        sum=sum+score[i][j];
      StuAgv[i]=sum/3;
	 }

     for(j=0;j<3;j++)            /*计算第j门课的平均分*/
	 {
	   sum=0;
       for(i=0;i<2;i++)
         sum=sum+ score [i][j];
       CouAgv[j]=sum/2;
	 }

      Max=score[0][0];
      for(i=0;i<2;i++)
        for(j=0;j<3;j++)
          if(Max<=score[i][j])
		  {
			Max=score[i][j];
   }
  return ;







第53题 （10.0分）        题号:53        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：规定输入的字符串中只包含字母和*号。请编写函数fun，其功能是：将字符串中的
      前导*号全部移到字符串的尾部。

例如：字符串中的内容为："*******A*BC*DEF*G****"，移动后，字符串中的内容应当是：
      "A*BC*DEF*G***********"。
       在编写函数时，不得使用C语言提供的字符串函数。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt ();

void  fun( char *a )
{
        /**********Program**********/


        /**********  End  **********/
}

main()
{  
        char  s[81];  int  n=0; 
        printf("Enter a string:\n");
        gets(s);
        fun( s );
        printf("The string after moveing:\n");
        puts(s);

        wwjt();
}
void wwjt ()
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i ; char s[81] ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%s", s) ;
                fun(s) ;
                fprintf(out, "%s\n", s) ;    
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	int i=0,n=0;
	char *p;
	p=a;
	while (*p=='*')    
	{
		n++;p++;
	}
	while(*p)          
	{
		a[i]=*p;i++;p++;
	}
	while(n!=0)
	{
		a[i]='*';i++;n--;
	}
	a[i]='\0';

第54题 （10.0分）        题号:54        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是计算：如"样张",s作为函数值返回。  
      在C语言中可调用log(n)函数求ln(n)。
      log函数的引用说明为：double log(double x)。

例如：若m的值为20，则fun函数值为6.506583。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <math.h>
#include <stdio.h>

void wwjt (  );

double   fun(  int  m )
{
        /**********Program**********/


        /**********  End  **********/
}

main()
{
   
        printf("%f\n", fun(20));

        wwjt( );
}

void wwjt (  )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, n ;
        double s ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%d", &n) ;
                s = fun(n) ;
                fprintf(out, "%f\n", s) ;
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	int i;
	double s=0.0;
	for(i=1;i<=m;i++)
		s=s+log(i);  
	return sqrt(s);

第55题 （10.0分）        题号:55        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：规定输入的字符串中只包含字母和*号。请编写函数fun，其功能是：只删除字符
      前导和尾部的*号，串中字母间的*号都不删除。形参n给出了字符串的长度，形参
      h给出了字符串中前导*号的个数，形参e给出了字符串中尾部*号的个数。在编写函
      数时，不得使用C语言提供的字符串函数。

例如：字符串中的内容为："****A*BC*DEF*G*******"，删除后，字符串中的内容应当
      是："A*BC*DEF*G"。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt ( );

void  fun( char *a, int n,int h,int e )
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{  
        char  s[81],*t,*f;  int m=0, tn=0, fn=0;
        printf("Enter a string:\n");
        gets(s);
        t=f=s;
        while(*t)
        {
                t++;
                m++;
        }
        t--;
        while(*t=='*')
        {
                t--;
                tn++;
        }
        while(*f=='*')
        {
                f++;
                fn++;
        }
        fun( s , m,fn,tn );
        printf("The string after deleted:\n");
        puts(s);

        wwjt( );
}
void wwjt ( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i ; char s[81], *t, *f ;
        int m=0, tn=0, fn=0;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%s", s) ;
                t=f=s;
                m=0; tn=0; fn=0;
                while(*t)
                {
                        t++;m++;
                }
                t--;
                while(*t=='*')
                {
                        t--;
                        tn++;
                }
                while(*f=='*')
                {
                        f++;
                        fn++;
                }
                fun(s, m, fn, tn);
                fprintf(out, "%s\n", s) ;    
        }
        fclose(in) ;
        fclose(out) ;
}





答案：	int i,j=0;
	for(i=h;i<n-e;i++)  
		a[j++]=a[i];
		a[j]='\0';

第56题 （10.0分）        题号:56        难度:易        第1章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：从字符串s中删除指定的字符c。

-------------------------------------------------*/

#include <stdio.h>
void wwjt();

fun(char s[],char c)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  static char str[]="turbo c and borland c++";
  char c='a';
  fun(str,c);
  printf("str=%s\n",str);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  char sin[80],cIN;
  int i;
  IN=fopen("13.IN","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("13.out","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<10;i++)
  {
    fscanf(IN,"%s",sin);
    cIN=getc(IN);cIN=getc(IN);
    fun(sin,cIN);
    fprintf(OUT,"%s\n",sin);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i,k=0;
   for(i=0;s[i]!='\0';i++)
    if(s[i]!=c) s[k++]=s[i];
    s[k]='\0';
----------------------

第57题 （10.0分）        题号:57        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：函数fun的功能是：将s所指字符串中下标为偶数的字符删除，剩余字符形成的新串
      放在t所指数组中。

例如：当s所指字符串中的内容为"ABCDEFGHIJK"时，在t所指数组中的内容应是："BDFHJ"。

注意：请勿改动函数main和其它函数中的任何内容。仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>

void wwjt (  );

void fun(char *s, char t[])
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{
        char s[100], t[100];
  
        printf("\nPlease enter string S:"); 
        scanf("%s", s);
        fun(s, t);
        printf("\nThe result is: %s\n", t);

        wwjt( );
}

void wwjt (  )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        char s[100], t[100] ;
        int i ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%s", s) ;
                fun(s, t) ;
                fprintf(out, "%s\n", t) ;
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	int i,j=0,k=strlen(s);    
	for(i=1; i<k; i=i+2)
		t[j++]=s[i];
		t[j]='\0';

第58题 （10.0分）        题号:58        难度:中        第1章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求出二维数组周边元素之和，作为函数值返回。二
      维数组的值在主函数中赋予。

-------------------------------------------------*/

#define M 4
#define N 5
#include <stdio.h>
void wwjt();
 
int fun(int a[M][N])
{

/**********Program**********/






/**********  End  **********/

}

main()
{
int a[M][N]={{1,3,5,7,9},{2,4,6,8,10},{2,3,4,5,6},{4,5,6,7,8}};
int y;
y=fun(a);
printf("s=%d\n",y);
wwjt();
}
void wwjt()
{
FILE *IN,*OUT;
int iIN[M][N],iOUT;
int i,j,k;
IN=fopen("14.IN","r");
if(IN==NULL)
{printf("Please Verify The Currernt Dir..it May Be Changed");
}
OUT=fopen("14.out","w");
if(OUT==NULL)
{printf("Please Verify The Current Dir.. it May Be Changed");
}
for(k=0;k<10;k++)
{  for(i=0;i<M;i++)
    for(j=0;j<N;j++)
        fscanf(IN,"%d",&iIN[i][j]);

iOUT=fun(iIN);
fprintf(OUT,"%d\n",iOUT);
}
fclose(IN);
fclose(OUT);
}

答案：----------------------
int s=0;
   int i,j;
   for(i=0;i<M;i++)
   s=s+a[i][0]+a[i][N-1];
   for(j=1;j<N-1;j++)
    s=s+a[0][j]+a[M-1][j];
    return s;
----------------------

第59题 （10.0分）        题号:59        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：将a、b中的两个两位正整数合并成一个新的整数放在c中。
      合并的方式是：将a中的十位和个位数依次放在变量c的百位和个位上，b中的十位和
      个位数依次放在变量c的十位和千位上。

例如：当a＝45，b＝12，调用该函数后c＝2415。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt ( );

void fun(int a, int b, long *c)
{
        /**********Program**********/

        
        /**********  End  **********/
}
void main()
{ 
        int   a,b; long   c; 
        printf("Input a, b:");
        scanf("%d%d", &a, &b);
        fun(a, b, &c);
        printf("The result is: %ld\n", c);

        wwjt( );
}
void wwjt ( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, a,b ; long c ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%d,%d", &a, &b) ;
                fun(a, b, &c) ;
                fprintf(out, "a=%d,b=%d,c=%ld\n", a, b, c) ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：        *c=a%10+(b/10)*10+(a/10)*100+(b%10)*1000;


第60题 （10.0分）        题号:60        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：假定输入的字符串中只包含字母和*号。请编写函数fun，其功能是：除了尾部
      的*号之外，将字符中的其它的*号全部删除。形参p已指向字符串中最后的一个
      字母。在编写函数时，不得使用C语言提供的字符串函数。

例如：字符串中的内容为****A*BC*DEF*G*******，删除后，字符串中的内容应当
      是ABCDEFG*******。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt (  );

void  fun( char *a, char *p )
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{ 
        char s[81],*t;
   
        printf("Enter a string:\n");
        gets(s);
        t=s;
        while(*t)
                t++;
        t--;
        while(*t=='*')
                t--;
        fun( s , t );
        printf("The string after deleted:\n");
        puts(s);

        wwjt( );
}
void wwjt( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i ; char s[81],*t ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%s", s) ;
                t=s;
                while(*t)
                        t++;
                t--;
                while(*t=='*')
                        t--;
                fun(s,t) ;
                fprintf(out, "%s\n", s) ;    
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	char *t=a;
	for(;t<=p;t++)
		if(*t!='*') 
			*(a++)=*t;
	for(;*t!='\0';t++)
		*(a++)=*t;
	*a='\0';

第61题 （10.0分）        题号:61        难度:难        第1章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求出菲波那契数列的前一项与后一项之比的极限的
      近似值。
例如：当误差为0.0001时，函数值为0.618056。

-------------------------------------------------*/

#include <stdio.h>
#include "math.h"
void wwjt();
     
float fun()
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  printf("y=%f\n",fun());
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  float fOUT;
  IN=fopen("19.IN","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("19.out","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  fOUT=fun();
  fprintf(OUT,"%f\n",fOUT);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
   float f1=1,f2=1,f3;
   float r1=2,r2;
   do
   {r2=r1;
   r1=f1/f2;
   f3=f1+f2;
   f1=f2;
   f2=f3;
   }while(fabs(r1-r2)>1e-4);
   return r1;
----------------------

第62题 （10.0分）        题号:62        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：将1到m之间(含m)能被7或11整除的所有整数放在数组a中，
      并通过n返回这些数的个数。

例如：若传给m的值为50，则程序输出：7　11　14　21　22　28　33　35　42　44　49

注意：请勿改动主函数main和其它函数的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

#define M 100

void wwjt (  );

void  fun ( int  m, int *a , int *n )
{
        /**********Program**********/


        /**********  End  **********/
}

main( )
{  
        int aa[M], n, k;
   
        fun ( 50, aa, &n );
        for ( k = 0; k < n; k++ )
                if((k+1)%20==0) 
                        printf("\n");
                else 
                        printf( "%4d", aa[k] );
        printf("\n") ;
        wwjt( );
}

void wwjt( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out;
        int i, n, j, k, aa[M], sum ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%d,", &j) ;
                fun(j, aa, &n) ;
                sum = 0 ;
                for(k = 0 ; k < n ; k++) 
                        sum+=aa[k] ;
                fprintf(out, "%d\n", sum) ;
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	int i,j=0;
	for(i=1;i<=m;i++)
		if(i%7==0||i%11==0) 
			a[j++]=i;
			*n=j; 


第63题 （10.0分）        题号:63        难度:中        第1章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求一个四位数的各位数字的立方和

------------------------------------------------*/

#include <stdio.h>
void wwjt();
     
int fun(int n)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  int k;
  k=fun(1234);
  printf("k=%d\n",k);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int iIN,iOUT,i;
  IN=fopen("22.IN","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("22.out","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<10;i++)
  {
    fscanf(IN,"%d",&iIN);
    iOUT=fun(iIN);
    fprintf(OUT,"%d\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int d,k,s=0;
   while (n>0)
    {d=n%10;
    s+=d*d*d;
     n/=10;
     }
     return s;
----------------------

第64题 （10.0分）        题号:64        难度:易        第1章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求1到100之间的偶数之积。

------------------------------------------------*/
    
#include <stdio.h>
 void wwjt();
    
double  fun(int m)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  printf("ji=%f\n",fun(100));
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int iIN,i;
  double dOUT;
  IN=fopen("23.IN","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("23.out","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<10;i++)
  {
    fscanf(IN,"%d",&iIN);
    dOUT=fun(iIN);
    fprintf(OUT,"%f\n",dOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
double   y=1;
    int i;
    for(i=1;i<=m;i++)
     if(i%2==0)y*=i;
     return y;
----------------------

第65题 （10.0分）        题号:65        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：规定输入的字符串中只包含字母和*号。编写函数fun，其功能是：将字符串中的
      前导*号全部删除，中间和尾部的*号不删除。

例如：字符串中的内容为："*******A*BC*DEF*G****"，删除后字符串中的内容应当是：
      "A*BC*DEF*G****"。编写函数时，不得使用C语言提供的字符串函数。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt (  );

void  fun( char *a )
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{  
        char  s[81];
   
        printf("Enter a string:\n");
        gets(s);
        fun( s );
        printf("The string after deleted:\n");
        puts(s);

        wwjt( );
}
void wwjt( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i ; char s[81] ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%s", s) ;
                fun(s) ;
                fprintf(out, "%s\n", s) ;    
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	char *p=a;
	while(*p=='*') 
		p++;
	for(;*p!='\0';p++,a++) 
		*a=*p; 
	*a='\0';

第66题 （10.0分）        题号:66        难度:易        第1章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：找出一批正整数中的最大的偶数。

------------------------------------------------*/

#include <stdio.h>
void wwjt();
     
int fun(int a[],int n)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  int a[]={1,2,9,24,35,18},k;
  k=fun(a,6);
  printf("max=%d\n",k);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int iIN[10],iOUT,i,j;
  IN=fopen("28.IN","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("28.out","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(j=0;j<10;j++)
  {     
    for(i=0;i<10;i++)
      fscanf(IN,"%d",&iIN[i]);
    iOUT=fun(iIN,10);
    fprintf(OUT,"%d\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i,amax=-1;
    for(i=0;i<n;i++)
     if(a[i]%2==0)
      if (a[i]>amax) amax=a[i];
     return amax;
----------------------

第67题 （10.0分）        题号:67        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：N名学生的成绩已在主函数中放入一个带有头节点的链表结构中，h指向链表的头
      节点。请编写函数fun，其功能是：找出学生的最高分，并由函数值返回。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>

#define   N   8

void wwjt ();

struct  slist
{  
        double   s;
        struct slist  *next;
};
typedef  struct slist  STREC;
double  fun( STREC *h  )
{
        /**********Program**********/


        /**********  End  **********/
}

STREC * creat( double *s)
{ 
        STREC  *h,*p,*q;   int  i=0;
        h=p=(STREC*)malloc(sizeof(STREC));
        p->s=0;
        while(i<N)
        { 
                q=(STREC*)malloc(sizeof(STREC));
                q->s=s[i]; i++; p->next=q; p=q;
        }
        p->next=0;
        return  h;
}
outlist( STREC *h)
{ 
        STREC  *p;
        p=h->next;   printf("head");
        do
        {
                printf("->%2.0f",p->s);p=p->next;
        }
        while(p!=0);
        printf("\n\n");
}

void main()
{  
        double  s[N]={85,76,69,85,91,72,64,87}, max;
        STREC  *h;
        h=creat( s );   outlist(h);
        max=fun( h );
        printf("max=%6.1f\n",max);
        wwjt();
}
void wwjt ()
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i,j ; double  s[N],max;
        STREC *h ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                for(j=0 ; j < N; j++) 
                        fscanf(in, "%lf,", &s[j]) ;
                h=creat( s );
                max=fun( h );
                fprintf(out, "%6.1lf\n", max) ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	double max=h->s;
	while(h!=NULL)         /*通过循环找到最高分数*/
	{
		if(max<h->s) 
			max=h->s;
		h=h->next;
	}
	return max;

第68题 （10.0分）        题号:68        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：将s所指字符串中除了下标为奇数同时ASCII值也为奇数
      的字符之外，其余的所有字符全部删除，串中剩余字符所形成的一个新串放在t所
      指的数组中。

例如：若s所指字符串的内容为："ABCDEFG12345"，其中字符A的ASCII码值为奇数，但所
      在元素的下标为偶数，因此需要删除；而字符1的ASCII码值为奇数，所在数组中的
      下标也为奇数，因此不应当删除，其它依此类推。
      最后t所指数组中的内容应为："135"。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>

void wwjt ( );

void fun(char *s, char t[])
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{
        char   s[100], t[100];
        printf("\nPlease enter string S:"); 
        scanf("%s", s);
        fun(s, t);
        printf("\nThe result is: %s\n", t);

        wwjt( );
}

void wwjt ( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        char s[100], t[100] ;
        int i ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%s", s) ;
                fun(s, t) ;
                fprintf(out, "%s\n", t) ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	int i,j=0,n;
	n=strlen(s);
	for(i=0;i<n;i++)
	if(i%2!=0&&s[i]%2!=0)
	{
		t[j]=s[i];
		j++;
	}
	t[j]='\0';

第69题 （10.0分）        题号:69        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：实现B＝A＋A'，即将矩阵A加上A的转置，存放在矩阵B中。
      计算结果在main函数中输出。

例如：输入下面的矩阵：其转置矩阵为：“样张1”。程序输出：“样张2”。
             
注意：请勿请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt (  );

void  fun ( int a[3][3], int b[3][3])
{
        /**********Program**********/


        /**********  End  **********/
}

void main( )   /* 主程序 */
{  
        int a[3][3] = {{1, 2, 3}, {4, 5, 6}, {7, 8, 9}}, t[3][3] ;
        int i, j ;
   
        fun(a, t) ;
        for (i = 0 ; i < 3 ; i++) 
        {
                for (j = 0 ; j < 3 ; j++)
                        printf("%7d", t[i][j]) ;
                printf("\n") ;
        }

        wwjt () ;
}

void wwjt ( )
{/* 本函数用于打开文件，输入测试数据，调用fun函数，输出数据，关闭文件。*/
        
        FILE *in, *out ;
        int i, j, k, a[3][3], t[3][3] ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(k = 0 ; k < 5 ; k++) 
        {
                for(i = 0 ; i < 3 ; i++)
                        fscanf(in, "%d %d %d", &a[i][0], &a[i][1], &a[i][2]) ;
                fun(a, t) ;
                for(i = 0 ; i < 3 ; i++) 
                {
                        for(j = 0 ; j < 3 ; j++) fprintf(out, "%7d", t[i][j]) ;
                        fprintf(out, "\n") ;
                }
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	int i,j;
	for(i=0;i<3;i++)
		for(j=0;j<3;j++)
			b[i][j]=a[i][j]+a[j][i];

第70题 （10.0分）        题号:70        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：删除一个字符串中指定下标的字符。其中，a指向原字
      符串，删除指定字符后的字符串存放在b所指的数组中，n中存指定的下标。

例如：输入一个字符串world，然后输入3，则调用该函数后的结果为word。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#define LEN 20

void wwjt (  );

void fun (char a[], char b[], int n)
{
        /**********Program**********/
 
   
        /**********  End  **********/
}

main( )
{  
        char str1[LEN], str2[LEN] ;
        int n ;
        printf("Enter the string:\n") ;
        gets(str1) ;
        printf("Enter the position of the string deleted:") ;
        scanf("%d", &n) ;
        fun(str1, str2, n) ;
        printf("The new string is: %s\n", str2) ;

        wwjt() ;
}

void wwjt ( )
{/* 本函数用于打开文件，输入测试数据，调用fun函数，输出数据，关闭文件。*/
        FILE *in, *out ;
        char str1[LEN], str2[LEN] ;
        int i, n ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%s %d", str1, &n) ;
                fun(str1, str2, n) ;
                fprintf(out, "%s\n", str2) ;
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	int i,k=0;
	for(i=0;a[i]!='\0';i++)
		if(i!=n)     
			b[k++]=a[i];
	b[k]='\0';  

第71题 （10.0分）        题号:71        难度:难        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求5行5列矩阵的主、副对角线上元素之和。注意，
      两条对角线相交的元素只加一次。
例如：主函数中给出的矩阵的两条对角线的和为45。

------------------------------------------------*/

#include <stdio.h>
#define M 5
void wwjt();
   
int fun(int a[M][M])
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  int a[M][M]={{1,3,5,7,9},{2,4,6,8,10},{2,3,4,5,6},{4,5,6,7,8},{1,3,4,5,6}};
  int y;
  y=fun(a);
  printf("s=%d\n",y);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int iIN[M][M],iOUT;
  int i,j;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
   {  for(i=0;i<M;i++)
  for(j=0;j<M;j++)
    fscanf(IN,"%d",&iIN[i][j]);
  iOUT=fun(iIN);
  fprintf(OUT,"%d\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int s=0;
   int i,j;
   for(i=0;i<M;i++)
   s=s+a[i][i]+a[i][M-1-i];
   s=s-a[(M-1)/2][(M-1)/2];
   return s;
----------------------

第72题 （10.0分）        题号:72        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun,函数的功能是：移动一维数组中的内容,若数组中有n个整数,要求
      把下标从0~p（含p,p小于 等于n-1）的数组元素平移到数组的最后。

例如：一维数组中的原始内容：1,2,3,4,5,6,7,8,9,10;p的值为3。移动后,一维数组中的
      内容应为： 5,6,7,8,9,10,1,2,3,4。

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号
      中填入所编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

#define    N    80

void wwjt ( );

void fun(int *w, int p, int n)
{
        /**********Program**********/


        /**********  End  **********/
}

main()
{  
        int  a[N]={1,2,3,4,5,6,7,8,9,10,11,12,13,14,15};
        int  i,p,n=15;
        printf("The original data:\n");
        for(i=0; i<n; i++)
                printf("%3d",a[i]);
        printf("\n\nEnter  p:  ");
        scanf("%d",&p);
        fun(a,p,n);
        printf("\nThe data after moving:\n");
        for(i=0; i<n; i++)printf("%3d",a[i]);
        printf("\n\n");

        wwjt();
}
void wwjt ()
{/* 请在此函数内打开文件，输入测试数据，调用 fun 函数，输出数据，关闭文件。 */
        FILE *in,*out ; 
        int a[N], i, j, p, n ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 5 ; i++) 
        {
                fscanf(in, "%d %d", &n, &p) ;
                for(j = 0 ; j < n ; j++) 
                        fscanf(in, "%d", &a[j]) ;
                fun(a, p, n) ;
                for(j = 0 ; j < n ; j++) 
                        fprintf(out, "%3d", a[j]) ; 
                        fprintf(out, "\n") ;
        }
        fclose(in) ; 
        fclose(out) ;
}



答案：	int i,j,t;
	for(i=p+1;i<n;i++)	
		for(j=i;j>i-p-1;j--)	
		{
			t=w[j];		
			w[j]=w[j-1];		
			w[j-1]=t;	
		}

第73题 （10.0分）        题号:73        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：根据以下公式计算s，并计算结果作为函数值返回，n通
      过形参传入。如“样张1”。例如：若n的值为11时，函数的值为1.833333

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt (  );

float fun(int  n)
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{  
        int n; float s;
        printf("\nPlease enter N:"); 
        scanf("%d", &n);
        s = fun(n);
        printf("the result is: %f\n", s);

        wwjt( );
}

void wwjt (  )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, n ;
        float s;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%d", &n) ;
                s = fun(n) ;
                fprintf(out, "%f\n", s) ;
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	int i,s1=0;
	float s=0.0;
	for(i=1;i<=n;i++)
	{
		s1=s1+i;        /*求每一项的分母*/
		s=s+1.0/s1;     /*求多项式的值*/
	}
	return s; 

第74题 （10.0分）        题号:74        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：将s所指字符串中ASCII值为奇数的字符删除，剩余字符形
      成的新串放在t所指数组中。

例如：若s所指字符串中的内容为："ABCDEFG12345"，其中字符A的ASCII码值为奇数,字符1
      的ASCII码值也为奇数,都应当删除，其它依此类推。最后t所指的数组中的内容应
      是："BDF24"。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>

void wwjt ( );

void  fun(char  *s, char  t[])
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{
        char   s[100], t[100];
        printf("\nPlease enter string S:"); 
        scanf("%s", s);
        fun(s, t);
        printf("\nThe result is: %s\n", t);

        wwjt( );
}

void wwjt ( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */

        FILE *in, *out ;
        char s[100], t[100] ;
        int i ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%s", s) ;
                fun(s, t) ;
                fprintf(out, "%s\n", t) ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	int i,j=0,n;
	n=strlen(s);
	for(i=0;i<n;i++)
		if(s[i]%2==0)
		{
			t[j]=s[i];
			j++;
		}
	t[j]='\0';

第75题 （10.0分）        题号:75        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：规定输入的字符串中只包含字母和*号。编写函数fun，其功能是：除了字符串前导
      和尾部的*号外，将串中其它的*号全部删除。形参h已指向字符串中第一个字母，
      形参p指向字符串的中最后一个字母。在编写函数时，不得使用C语言提供的字符
      串函数。

例如：若字符串中的内容为****A*BC*DEF*G*******，删除后，字符串中的内容应当是：
      ****ABCDEFG********。在编写函数时，不得使用C语言提供的字符串函数。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt (  );

void  fun( char *a, char *h,char *p )
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{  
        char  s[81],*t, *f;
   
        printf("Enter a string:\n");
        gets(s);
        t=f=s;
        while(*t)
                t++;
        t--;
        while(*t=='*')
                t--;
        while(*f=='*')
                f++;
        fun( s , f,t );
        printf("The string after deleted:\n");
        puts(s);

        wwjt();
}
void wwjt()
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i ; char s[81], *t, *f ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%s", s) ;
                t=f=s;
                while(*t)
                        t++;
                t--;
                while(*t=='*')
                        t--;
                while(*f=='*')
                        f++;
                fun(s, f, t);
                fprintf(out, "%s\n", s) ;    
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	int i=0; 
	char *q=a; 
	while(q<h) 
	{
		a[i]=*q; 
		q++;
		i++;
	} 
	while(q<p) 
	{
		if(*q!='*') 
		{
			a[i]=*q; 
			i++;
		} 
		q++;
	} 
	while(*q) 
	{
		a[i]=*q; 
		i++; 
		q++;
	} 
	a[i]='\0';

第76题 （10.0分）        题号:76        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：函数fun的功能是：将a、b的两个两位正整数合并成一个新的整数放在c中。
      合并的方式是：将a中的十位和个位数依次放在变量c的百位和个位上，b中
      的十位和个位数依次放在变量c的千位和十位上。

例如：当a＝45，b＝12，调用该函数后c＝1425。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt ( );

void fun(int a, int b, long *c)
{
        /**********Program**********/
        

        /**********  End  **********/
}
void main()   /* 主函数 */
{  
        int a,b; long c;
        printf("Input a, b:");
        scanf("%d%d", &a, &b);
        fun(a, b, &c);
        printf("The result is: %ld\n", c);

        wwjt( );
}
void wwjt ( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, a,b ; long c ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%d,%d", &a, &b) ;
                fun(a, b, &c) ;
                fprintf(out, "a=%d,b=%d,c=%ld\n", a, b, c) ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：        *c=a%10+(b%10)*10+(a/10)*100+(b/10)*1000;

第77题 （10.0分）        题号:77        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：将两个两位数的正整数a、b合并成一个整数放在c中。
      合并的方式是：将a数的十位和个位数依次放在c数的个位和百位上，b数的十位
      和个位数依次放在c数的千位和十位上。例如：当a＝45，b＝12时，调用该函数
      后，c＝1524。

注意：请勿动改主函数的main和其它函数中的任何内容，仅在函数fun的花括号填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt (  );

void fun(int a, int b, long *c)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{  
        int a,b; long c;
        printf("Input a, b:");
        scanf("%d %d", &a, &b);
        fun(a, b, &c);
        printf("The result is: %ld\n", c);

        wwjt( );
}
void wwjt (  )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, a,b ; long c ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%d,%d", &a, &b) ;
                fun(a, b, &c) ;
                fprintf(out, "a=%d,b=%d,c=%ld\n", a, b, c) ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：
	*c=a/10+(b%10)*10+(a%10)*100+(b/10)*1000;

第78题 （10.0分）        题号:78        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：规定输入的字符串中只包含字母和*号。请编写函数fun，其功能是：使字符串的
      前导*号不得多于n个，若多于n个，则删除多余的*号；若少于或等n个，则不做处
      理，字符串中间和尾部的*号不删除。

例如：字符串中的内容为：*******A*BC*DEF*G****，若n的值为4，删除后，字符串中的
      内容应当是：****A*BC*DEF*G****；若n的值为8，则字符串中的内容仍
      为：*******A*BC*DEF*G****。n的值在主函数中输入。在编写函数时，
      不得使用C语言提供的字符串函数。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h> 

void  wwjt ( );

void  fun( char *a, int  n )
{
        /**********Program**********/

        
        /**********  End  **********/
}

void main()
{  
        char  s[81];  int  n;
        printf("Enter a string:\n");
        gets(s);
        printf("Enter n :  ");
        scanf("%d",&n);
        fun( s,n );
        printf("The string after deleted:\n");
        puts(s);

        wwjt( );
}
void wwjt ( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, n ; char s[81] ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++)
        {
                fscanf(in, "%s", s) ;
                fscanf(in, "%d", &n) ;
                fun(s,n) ;
                fprintf(out, "%s\n", s) ;    
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	int i=0;
	int k=0;
	char *p,*t;
	p=t=a;
	while(*t=='*')
	{
		k++;
		t++;
	}
	if(k>n)
	{
		while(*p)
		{
			a[i]=*(p+k-n);
			i++;
			p++;
		}
		a[i]='\0';
	}

第79题 （10.0分）        题号:79        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：将两个两位数的正整数a、b合并成一个整数放在c中。
      合并的方式是：将a数的十位和个位数依次在c数的个位和百位上，b数的十位和
      个位数依次放在c数的十位和千位上。

例如：当a＝45，b＝12时，调用该函数后c＝2514。

注意：请勿动改主函数的main和其它函数中的任何内容，仅在函数fun的花括号填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt (  );

void fun(int a, int b, long *c)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{  
        int a,b; long c;
        printf("Input a, b:");
        scanf("%d %d", &a, &b);
        fun(a, b, &c);
        printf("The result is: %ld\n", c);

        wwjt();
}
void wwjt (  )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, a,b ; long c ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%d,%d", &a, &b) ;
                fun(a, b, &c) ;
                fprintf(out, "a=%d,b=%d,c=%ld\n", a, b, c) ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	*c=a/10+(b/10)*10+(a%10)*100+(b%10)*1000;

第80题 （10.0分）        题号:80        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，其功能是：将一个数字字符串转换为一个整数(不得调用C语言提供
      的将字符串转换为整数的函数)。

例如：若输入字符串"－1234"，则函数把它转换为整数值－1234。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>

void wwjt ( );

long  fun ( char *p)
{
        /**********Program**********/


        /**********  End  **********/
}

main()   /* 主函数 */
{ 
        char s[6];
        long n;
        printf("Enter a string:\n") ;
        gets(s);
        n = fun(s);
        printf("%ld\n",n);
        wwjt (  );
}

void wwjt( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i ;
        char s[20] ;
        long n ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%s", s) ;
                n = fun(s);
                fprintf(out, "%ld\n", n) ;
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	long n=0;
	int flag=1;
	if(*p=='-')         /*负数时置flag为－1*/
	{
		p++;flag= -1;
	}
	else if(*p=='+')       /*正数时置flag为1*/
		p++;
	while(*p!='\0')     
	{
		n=n*10+*p-'0';    /*将字符串转成相应的整数*/
		p++;
	}
	return n*flag;

第81题 （10.0分）        题号:81        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：求Fibonacci数列中大于t的最小的数，结果由函数返回。
      Fibonacci数列F(n)的定义为：F(0)＝0，F(1)＝1，F(n)＝F(n－1)＋F(n－2)

例如：当t＝1000时，函数值为1597。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <math.h>
#include <stdio.h>

void wwjt (  );

int  fun( int  t)
{
        /**********Program**********/


        /**********  End  **********/
}

void main()   /* 主函数 */
{ 
        int  n;
        n=1000;
        printf("n = %d, f = %d\n",n, fun(n));
        wwjt( );
}

void wwjt (  )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, n, s ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%d", &n) ;
                s = fun(n) ;
                fprintf(out, "%d\n", s) ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	int f0 = 0, f1 = 1, f ;
	do 
	{
		f = f0 + f1 ;
		f0 = f1 ;
		f1 = f ;
	} 
	while(f < t) ;
	return f ;

第82题 （10.0分）        题号:82        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：将ss所指字符串中所有下标为奇数位上的字母转换为大写
     (若该位置上不是字母，则不转换)。例如：若输入"abc4EFg"，则应输出"aBc4EFg"。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>

void wwjt (  );

void  fun  ( char *ss )
{
        /**********Program**********/


        /**********  End  **********/
}

void main( )
{ 
        char tt[81] ;
        printf( "\nPlease enter an string within 80 characters:\n" );
        gets( tt );
        printf( "\n\nAfter changing, the string\n  \"%s\"", tt );
        fun( tt );
        printf( "\nbecomes\n  \"%s\"\n",  tt  );
        wwjt ( );
}

void wwjt ( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        char tt[81] ;
        int i ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++)
        {
                fscanf(in, "%s", tt) ;
                fun( tt ) ;
                fprintf(out, "%s\n", tt) ;
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	int i;
	for(i=0;ss[i]!='\0';i++)              
		if(i%2==1&&ss[i]>='a'&&ss[i]<='z')   
			ss[i]=ss[i]-32;

第83题 （10.0分）        题号:83        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun,其功能是：将a、b两个两位正整数合并成一个新的整数放在c中。
      合并的方式是：将a中的十位和个位数依次放在变量c的千位和十位上,b中的十
      位和个位数依次放在变量c的个位和百位上。

例如：当a=45,b=12,调用该函数后c=4251。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt ( );

void fun(int a, int b, long *c)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{  
        int  a,b; long  c;
        printf("Input a, b:");
        scanf("%d%d", &a, &b);
        fun(a, b, &c);
        printf("The result is: %ld\n", c);

        wwjt( );
}
void wwjt ( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, a,b ; long c ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%d,%d", &a, &b) ;
                fun(a, b, &c) ;
                fprintf(out, "a=%d,b=%d,c=%ld\n", a, b, c) ;
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	*c=b/10+(a%10)*10+(b%10)*100+(a/10)*1000;

第84题 （10.0分）        题号:84        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：规定输入的字符串中只包含字母和*号。请编写函数fun,其功能是：使字符串中尾部
      的*号不多于n个,若多于n个,则删除多余的*号；若少于或等于n个,则不做任何操作,
      字符串中间和前面的*号不删除。

例如：字符串中的内容为"****A*BC*DEF*G*******",若n的值为4,删除后,字符串中的内容
      应为"****A*BC*DEF*G****"； 
      若n的值为7,则字符串中的内容仍为"****A*BC*DEF*G*******"。
      n的值在主函数中输入。编写函数时,不得使用C语言提供的字符串函数。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt (  );

void  fun( char *a,int  n )
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{  
        char  s[81];  int  n;
        printf("Enter a string:\n");
        gets(s);
        printf("Enter n :  ");scanf("%d",&n);
        fun( s,n );
        printf("The string after deleted:\n");
        puts(s);

        wwjt( );
}
void wwjt( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, n ; char s[81] ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%s", s) ;
                fscanf(in, "%d", &n) ;
                fun(s,n) ;
                fprintf(out, "%s\n", s) ;    
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	int i=0,k=0;
	char *p, *t;
	p=t=a;
	while(*t)
		t++;
	t--;
	while(*t=='*')
	{
		k++;
		t--;
	}
	if(k>n)
	{
		while(*p&&p<t+n+1)
		{
			a[i]=*p;
			i++;
			p++;
		}
		a[i]='\0';
	}

第85题 （10.0分）        题号:85        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：将两个两位数的正整数a、b合并成一个整数放在c中。
      合并的方式是：将a数的十位和个位数依次放在c数的十位和千位上，b数的十位
      和个位数依次放在c数的百位和个位上。

例如：当a＝45，b＝12时，调用该函数后，c ＝5142。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt ( );

void fun(int a, int b, long *c)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{  
        int a,b; long c; 
        printf("Input a, b:"); 
        scanf("%d,%d", &a, &b);
        fun(a, b, &c);
        printf("The result is: %d\n", c);
        wwjt( );
}
void wwjt (  )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。*/
        FILE *in, *out ;
        int i, a,b ; long c ;
        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%d,%d", &a, &b) ;
                fun(a, b, &c) ;
                fprintf(out, "a=%d,b=%d,c=%ld\n", a, b, c) ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	*c=b%10+(a/10)*10+(b/10)*100+(a%10)*1000;

第86题 （10.0分）        题号:86        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：函数fun的功能是：将两个两位数的正整数 a、b合并成一个整数放在c中。
      合并的方式是：将a数的十位和个位数依次放在c数的千位和十位上,b数的
      十位和个位数依次放在c数的百位和个位上。

例如：当a=45,b=12时,调用该函数后c=4152。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt ( );

void fun(int a, int b, long *c)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{  
        int a,b; long c;
        printf("Input a, b:");  
        scanf("%d %d", &a, &b);
        fun(a, b, &c);
        printf("The result is: %d\n", c);
        wwjt( );
}
void wwjt (  )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, a,b ; long c ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%d,%d", &a, &b) ;
                fun(a, b, &c) ;
                fprintf(out, "a=%d,b=%d,c=%ld\n", a, b, c) ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	*c=b%10+(a%10)*10+(b/10)*100+(a/10)*1000;

第87题 （10.0分）        题号:87        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编一个函数void fun(int  tt[M][N], int  pp[N]), tt指向一个M行N列的
      二维数组，求出二维数组每列中最大元素，并依次放入pp所指的一维数组中。
      二维数组中的数已在主函数中给出。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include    <conio.h>
#include    <stdio.h>
#include    <stdlib.h>

#define  M  3
#define  N  4

void wwjt( );

void fun(int  tt[M][N],int  pp[N])
{
        /**********Program**********/


        /**********  End  **********/
}


void main( )
{
        int t[M][N]={{68, 32, 54, 12},{14, 24, 88, 58},{42, 22, 44, 56}};
        int  p [ N ],  i,  j,  k;
        printf ( "The original data is : \n" );
        for( i=0; i<M; i++ )
        {
                for( j=0; j<N; j++ )
                        printf ( "%6d", t[i][j] );
                printf("\n");
        }
        fun ( t, p );
        printf( "\nThe result  is:\n" );
        for ( k = 0; k < N; k++ )
                printf ( " %4d ", p[ k ] );
        printf("\n");
        wwjt( );
}

void wwjt( )
{/* 请在此函数内打开文件，输入测试数据，调用 fun 函数，
    输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, j, k, m, t[M][N], p[N] ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(m = 0 ; m < 10 ; m++) 
        {
                for( i=0; i<M; i++ )
                {
                        for( j=0; j<N; j++ )
                                fscanf (in, "%6d", &t[i][j] );
                }
                fun ( t, p ) ;
                for ( k = 0; k < N; k++ ) 
                        fprintf (out, " %4d ", p[ k ] ) ;
                        fprintf(in, "\n") ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	int i,j,max;
	for(j=0;j<N;j++)
	{
		max=tt[0][j];/*假设各列中的第一个元素最大*/
		for(i=0;i<M;i++)
			if(tt[i][j]>max)/*如果各列中的元素比最大值大，则将这个更大的元素看作当前该列中最大元素*/
				max=tt[i][j];
			pp[j]=max;/*将各列的最大值依次放入pp数组中*/
	}

第88题 （10.0分）        题号:88        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，对长度为7个字符的字符串，除首、尾字符外，将其余5个字符按
      ASCII码降序排列。

例如：原来的字符串为"CEAedca"，排序后输出为"CedcEAa"。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <ctype.h>
#include <string.h>

void wwjt( );

void fun(char *s,int num)
{  
        /**********Program**********/


        /**********  End  **********/
}

void main( )
{
        char s[10];
        printf("输入7个字符的字符串:");
        gets(s);
        fun(s,7);
        printf("\n%s",s);

        wwjt( );
}
void wwjt( )
{
/* 请在此函数内打开文件，输入测试数据，调用 fun 函数，
   输出数据，关闭文件。 */  
        FILE *in, *out ;
        char s[10] ;
        int i = 0 ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        while(i < 10) 
        {
                fgets(s,10,in) ;
                s[7] = 0 ;
                fun(s,7);
                fprintf(out, "%s\n", s) ;
                i++ ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	char ch ;
	int i, j ;
	for(i = 1 ; i < 6 ; i++)
		for(j = i + 1 ; j < 6 ; j++)
		{
			if(*(s + i) < *(s + j)) 
			{
				ch = *(s + j) ;
				*(s + j) = *(s +i) ;
				*(s + i) = ch ; 
			} 
		}

第89题 （10.0分）        题号:89        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，其功能是：计算并输出下列多项式的值，   
      S＝(1－1/2)＋(1/3－1/4)＋…＋(1/(2n－1)－1/2n)
例如：若主函数从键盘给n输入8后，则输出为S＝0.662872。

注意：要求n的值大于1但不大于100。
      请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt( );

double fun(int n)
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{ 
        int  n;    
        double  s;
        printf("\nInput n:  ");  
        scanf("%d",&n);
        s=fun(n);
        printf("\ns=%f\n",s);

        wwjt( );
}
void wwjt( )
{/* 请在此函数内打开文件，输入测试数据，调用 fun 函数，输出数据，关闭文件。 */
        FILE *in, *out ; 
        int n, i ; 
        double s ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%d", &n) ;
                s = fun(n) ;
                fprintf(out, "%lf\n", s) ;
        }
        fclose(in) ; 
        fclose(out) ;
}



答案：	int i;
	double s=0.0;
	for(i=1;i<=n;i++)
		s=s+(1.0/(2*i-1)-1.0/(2*i)); 
/*计算S=（1-12）+（13-14）+（1/(2n-1)-12n）*/
	return s;

第90题 （10.0分）        题号:90        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，其功能是：计算并输出下列多项式的值。如“样张”。

例如：在主函数中从键盘为n输入50后，输出为S＝1.718282。

注意：要求n的值在大于1但不大于100之间。
      请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt( );

double fun(int  n)
{
        /**********Program**********/


        /**********  End  **********/
}


void main()
{ 
        int  n; double  s;
        printf("\nInput n:  ");  
        scanf("%d",&n);
        s=fun(n);
        printf("\n\ns=%f\n\n",s);

        wwjt( );
}
void wwjt( )
{/* 请在此函数内打开文件，输入测试数据，调用 fun 函数，输出数据，关闭文件。 */
        FILE *IN, *OUT ; 
        int n, i ; 
        double s ;

        IN=fopen("in.dat","r");
        if(IN==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        OUT=fopen("out.dat","w");
        if(OUT==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++)
        {
                fscanf(IN, "%d", &n) ;
                s = fun(n) ;
                fprintf(OUT, "%lf\n", s) ;
        }
        fclose(IN) ; 
        fclose(OUT) ;
}


答案：	double sum=0,tmp=1;
	int i;
	for(i=1;i<=n;i++)
	{
		tmp=tmp*i;
		sum+=1.0/tmp;
	}
	return sum;

第91题 （10.0分）        题号:91        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：函数fun的功能是：将s所指字符串中下标为偶数同时ASCII值为奇数的字符删除，
      s所指串中剩余的字符形成的新串放在t所指的数组中。

例如：若s所指字符串中的内容为"ABCDEFG12345"，其中字符C的ASCII码值为奇数，在数
      组中的下标为偶数，因此必须删除；而字符1的ASCII码值为奇数，在数组中的下
      标为奇数，因此不应当删除，其他依此类推。最后t所指的数组中的内容应
      是"BDF12345"。

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>

void wwjt(  );

void fun(char  *s, char  t[])
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{
        char s[100], t[100];
        printf("\nPlease enter string S:"); 
        scanf("%s", s);
        fun(s, t);
        printf("\nThe result is: %s\n", t);
        wwjt( );
}

void wwjt(  )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        char s[100], t[100] ;
        int i ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++)
        {
                fscanf(in, "%s", s) ;
                fun(s, t) ;
                fprintf(out, "%s\n", t) ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	int i, j = 0 ;
	for(i = 0 ; i < strlen(s) ; i++)
		if(!((i % 2) ==0 && (s[i] % 2))) 
			t[j++] = s[i] ;
		t[j] = 0 ;

第92题 （10.0分）        题号:92        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：函数fun的功能是：将a、b中的两个正整数合并形成一个新的整数放在c中。
      合并的方式是：将a中的十位和个位数依次放在变量c的十位和千位上，b中
      的十位和个位数依次放在变量c的个位和百位上。

例如：当a＝45，b＝12。调用该函数后，c＝5241。

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt (  );

void fun(int  a, int  b, long  *c)
{
        /**********Program**********/

        
        /**********  End  **********/
}
void main()
{ 
        int  a,b; long  c;
        printf("Input a, b:");
        scanf("%d%d", &a, &b);
        fun(a, b, &c);
        printf("The result is: %ld\n", c);

        wwjt( );
}
void wwjt (  )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, a,b ; long c ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++)
        {
                fscanf(in, "%d,%d", &a, &b) ;
                fun(a, b, &c) ;
                fprintf(out, "a=%d,b=%d,c=%ld\n", a, b, c) ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	*c=(a%10)*1000+(b%10)*100+(a/10)*10+(b/10);

第93题 （10.0分）        题号:93        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：根据以下公式求P的值，结果由函数值带回。
      m与n为两个正整数且要求m>n。如“样张”。

例如：m＝12，n＝8时，运行结果为495.000000。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt (  );

long jc(int m)
{
        long s=1;
        int i ;
        for(i=1;i<=m;i++) s=s*i ;
        return s;
}
float  fun(int m, int n)
{
        /**********Program**********/

 
        /**********  End  **********/
}

void main()   /* 主函数 */
{
        printf("P=%f\n", fun (12,8));

        wwjt();
}

void wwjt (  )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, m, n ;
        float s;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fscanf(in, "%d,%d", &m, &n) ;
                s = fun(m, n) ;
                fprintf(out, "%f\n", s) ;
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	float p;
	p=1.0*jc(m)/jc(n)/jc(m-n) ;
	return p;

第94题 （10.0分）        题号:94        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，它的功能是：求小于形参n同时能被3与7整除的所有自然数之和的
      平方根，并作为函数值返回。

例如：若n为1000时，程序输出应为：s＝153.909064。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <math.h>
#include <stdio.h>

void wwjt (  );

double  fun( int  n)
{
        /**********Program**********/


        /**********  End  **********/
}

void main()   /* 主函数 */
{
        printf("s =%f\n", fun ( 1000) );

        wwjt();
}
void wwjt (  )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, n ;
        double s;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++)
        {
                fscanf(in, "%d", &n) ;
                s = fun(n) ;
                fprintf(out, "%f\n", s) ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	double sum=0.0;
	int i;
	for(i=21; i<=n; i++)
		if((i % 3==0) && (i % 7==0))
			sum+=i;
	return sqrt(sum) ;

第95题 （10.0分）        题号:95        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，其功能是：统计s所指字符串中的数字字符个数，并作为函数值
      返回。

例如：s所指字符串中的内容是：2def35adh25  3kjsdf 7/kj8655x,函数fun返回值为：11

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include  <stdio.h>

void wwjt( );

int fun(char  *s)
{        
        /**********Program**********/


        /**********  End  **********/
}

void main()
{  
        char *s="2def35adh25  3kjsdf 7/kj8655x";
        printf("%s\n",s);
        printf("%d\n",fun(s));

        wwjt( );
}

void wwjt( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i;
        char s[256];

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fgets(s, 255, in);
                fprintf(out, "%d\n", fun(s));
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	int n=0;
	char *p;
	for(p=s;*p!='\0';p++)
		if((*p>='0')&&(*p<='9'))
			n++;
	return n;

第96题 （10.0分）        题号:96        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，函数的功能是查找x在s所指数组中下标的位置，并作为函数值返回，
      若x不存在，则返回－1。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include  <stdio.h>
#include  <stdlib.h>

#define   N   15

void wwjt();

int  fun( int *s, int x)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{  
        int a[N]={ 29,13,5,22,10,9,3,18,22,25,14,15,2,7,27},i,x,index;
        printf("a数组中的数据 :\n");
        for(i=0; i<N; i++) printf("%4d",a[i]); 
        printf("\n");
        printf("给x输入待查找的数 :  ");  
        scanf("%d",&x);
        index=fun( a, x );
        printf("index=%d\n",index);
        wwjt();
}

void wwjt()
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, j, a[10], x, index;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                for(j = 0 ; j < 10 ; j++) 
                {
                        fscanf(in, "%d ", &a[j]);
                }
                fscanf(in, "%d", &x);
                index = fun(a, x);
                fprintf(out, "%d\n", index);
        }
        fclose(in);
        fclose(out);
}



答案：	int i;
	for(i=0;i<N;i++)
		if(x==s[i]) 
			return i;
	return -1;

第97题 （10.0分）        题号:97        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，其功能是将形参s所指字符串放入形参a所指的字符数组中，使a
      中存放同样的字符串。说明：不得使用系统提供的字符串函数。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun指定的部位填入
      你所编写的若干语句。

-------------------------------------------------------*/
#include  <stdio.h>

#define    N    20

void wwjt( );

void  fun( char  *a , char  *s)
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{  
        char  s1[N],  *s2="abcdefghijk";
        fun( s1,s2);
        printf("%s\n", s1);
        printf("%s\n", s2);

        wwjt();
}

void wwjt()
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i;
        char s1[256], s2[256];

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++) 
        {
                fgets(s2, 255, in);
                fun(s1,s2);
                fprintf(out, "%s", s1);
        }
        fclose(in) ;
        fclose(out) ;
}


答案：	while(*s!='\0')
	{	
		*a=*s;
		a++;
		s++;
	}
	*a='\0';

第98题 （10.0分）        题号:98        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编函数fun，其功能是将一个数字字符串转换成与其面值相同的长整型整数。
      可调用strlen函数求字符串的长度。例如：在键盘输入字符串2345210，函数返
      回长整型数2345210。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun指定的部位填入 
      所编写的若干语句。 

-------------------------------------------------------*/
#include   <stdio.h>
#include   <string.h>

void wwjt( );

long  fun( char  *s )
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{  
        char  s[10];  
        long  r;
        printf("请输入一个长度不超过9个字符的数字字符串 :  ");  
        gets(s);
        r = fun( s );
        printf(" r = %ld\n" , r );

        wwjt( );
}

void wwjt( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i;  long r;
        char s[10], *p;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++)
        {
                fgets(s, 10, in);
                p = strchr(s, '\n');
                if (p) *p = 0;
                r = fun(s);
                fprintf(out, "%ld\n", r);
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	int i,sum=0,len;
	len=strlen(s);
	for(i=0;i<len;i++)
	{
		sum=sum*10+*s-48;
		s++;
      
	}
	return sum;

第99题 （10.0分）        题号:99        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，其功能是：将一组得分中，去掉一个最高分和一个最低分，然后
      求平均值，并通过函数返回。函数形参a指向存放得分的数组，形参n中存放得分个
      数（n>2）。例如：若输入9.9  8.5  7.6  8.5  9.3  9.5  8.9  7.8  8.6  8.4十
      个得分，则输出结果为：8.687500。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      所编写的若干语句。

-------------------------------------------------------*/
#include  <stdio.h>

void wwjt( );

double fun(double  a[ ] , int  n)
{
        /**********Program**********/


        /**********  End  **********/

}

main()
{  
        double  b[10],  r;  
        int  i;
        printf("输入10个分数放入b数组中 :  ");
        for (i=0; i<10; i++) 
                scanf("%lf",&b[i]);
        printf("输入的10个分数是 :  ");
        for (i=0; i<10; i++)  
                printf("%4.1lf ",b[i]);   
        printf("\n");
        r = fun(b, 10);
        printf("去掉最高分和最低分后的平均分 :  %f\n", r );

        wwjt( );
}

void wwjt( )
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int i, j ;
        double b[10], r ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i = 0 ; i < 10 ; i++)
        {
                for(j = 0 ; j < 10 ; j++) 
                {
                        fscanf(in, "%lf ", &b[j]) ;
                }
                r = fun(b, 10) ;
                fprintf(out, "%f\n", r) ;
        }
        fclose(in) ;
        fclose(out) ;
}



答案：	double sum=0,max,min;
	int i;
	max=min=a[0];
	for(i=0;i<n;i++)
	{
		sum=sum+a[i];
		if(max<a[i])
			max=a[i];
		if(min>a[i])
			min=a[i];
	}
	sum=sum-max-min;
	return(sum/(n-2));

第100题 （10.0分）        题号:100        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，其功能是：找出2×M整型二维数组中最大元素的值，并将此值  
      返回调用函数。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#define M 4

void wwjt ( );

int fun (int a[][M])
{
        /**********Program**********/


        /**********  End  **********/
}

main( )
{  
        int arr[2][M]={5,8,3,45,76,-4,12,43} ;
        printf("max =%d\n", fun(arr)) ;
        wwjt( ) ;
}

void wwjt ()
{/* 本函数用于打开文件，输入数据，调用函数，输出数据，关闭文件。 */
        FILE *in, *out ;
        int arr[2][M], i, j, s, a;

        in=fopen("in.dat","r") ;
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed") ;
        }
        out=fopen("out.dat","w") ;
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed") ;
        }
        for(a=0;a<10;a++)
        {
                for(i=0;i<2;i++)
                        for(j=0;j<M;j++)
                                fscanf(in,"%d",&arr[i][j]) ;
                s=fun(arr) ;
                fprintf(out, "max=%d\n", s) ;
        }
        fclose(in);
        fclose(out) ;
}



答案：	int i,j,max=a[0][0];
	for(i=0;i<2;i++)
		for(j=0;j<M;j++)
			if(max<a[i][j]) 
				max=a[i][j];
	return max;


第101题 （10.0分）        题号:101        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：学生的记录由学号和成绩组成，N名学生的数据已放入主函数中的结构体数组s中，
      请编写函数fun，其功能是：把分数最高的学生数据放在b所指的数组中。

注意：分数最高的学生可能不止一个，函数返回分数最高的学生的人数。
      请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

#define   N   16

void wwjt ( );

typedef  struct
{  
        char  num[10];
        int   s;
} STREC;

int  fun( STREC  *a, STREC *b )
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{  
        STREC  s[N]={{"GA05",85},{"GA03",76},{"GA02",69},{"GA04",85},
                {"GA01",91},{"GA07",72},{"GA08",64},{"GA06",87},
                {"GA015",85},{"GA013",91},{"GA012",64},{"GA014",91},
                {"GA011",77},{"GA017",64},{"GA018",64},{"GA016",72}};
        STREC  h[N];
        int  i, n;
        n=fun( s, h );
        printf("The %d highest score :\n", n);
        for(i=0; i<n; i++)
                printf("%s  %4d\n", h[i].num, h[i].s);
        printf("\n");
        wwjt ( );
}
void wwjt( )
{
        FILE *in , *out ;
        int  i, n, a;
        STREC  s[N];
        STREC  h[N];
        in=fopen("in.dat", "r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat", "w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(a = 0; a < 10; a ++)
        {
                for(i = 0; i<16; i ++)
                {
                        fscanf(in, "%s %d", &s[i].num, &s[i].s);
                }
                n=fun( s, h );
                fprintf(out, "%d\n", n);
                for(i = 0; i < n; i ++)
                        fprintf(out, "%d\n", h[i].s);
                        printf("\n");
        }
        fclose(in);
        fclose(out);
}

答案：	int i, j = 0, max = a[0].s;
		for(i = 0; i < N; i ++)
			if(max < a[i].s)
				max = a[i].s;
	for(i = 0; i < N; i ++)
		if(max == a[i].s)
			b[j ++] = a[i];
	return j;

第102题 （10.0分）        题号:102        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：学生的记录由学号成绩组成，N名学生的数据已放入主函数中的结构体数组s中，
      请编写函数fun，其功能是：函数返回该学号的学生数据，指定的学号在主函数中
      输入。若没找到指定学号，在结构体变量中给学号置空串，给成绩置-1，作为函
      数值返回。(用于字符串比较的函数是strcmp)。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>

#define   N   16

void wwjt();

typedef  struct
{  
        char  num[10];
        int   s;
} STREC;
STREC  fun( STREC  *a, char *b )
{
        /**********Program**********/

 
        /**********  End  **********/
}

void main()
{  
        STREC  s[N]={{"GA005",85},{"GA003",76},{"GA002",69},{"GA004",85},
                {"GA001",91},{"GA007",72},{"GA008",64},{"GA006",87},
                {"GA015",85},{"GA013",91},{"GA012",64},{"GA014",91},
                {"GA011",77},{"GA017",64},{"GA018",64},{"GA016",72}};
        STREC  h;
        char  m[10];
        int  i;
        printf("The original data:\n");
        for(i=0; i<N; i++)
        {  
                if(i%4==0) printf("\n");
                printf("%s %3d  ",s[i].num,s[i].s);
        }
        printf("\n\nEnter the number:  ");
        gets(m);
        h=fun( s,m );
        printf("The data :  ");
        printf("\n%s  %4d\n",h.num,h.s);
        printf("\n");
        wwjt();

}
void wwjt()
{
        FILE *in, *out ;
        STREC  s[N]={{"GA005",85},{"GA003",76},{"GA002",69},{"GA004",85},
                {"GA001",91},{"GA007",72},{"GA008",64},{"GA006",87},
                {"GA015",85},{"GA013",91},{"GA012",64},{"GA014",91},
                {"GA011",77},{"GA017",64},{"GA018",64},{"GA016",72}};
        STREC  h;
        char  m[10];
        int  i;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }

        for(i=0;i<10;i++)
        {
                fscanf(in,"%s",&m);
                h=fun(s,m);
                fprintf(out,"%s  %4d\n",h.num,h.s);
        }
        fclose(out);
        fclose(out);
}




答案：	int i;
	STREC str={"\0",-1};  
	for(i=0;i<N;i++)
		if(strcmp(a[i].num,b)==0) 
		str=a[i];
	return str;

第103题 （10.0分）        题号:103        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：学生记录由学号和成绩组成，N名学生的数据已放入主函数中的结构体数组中，请
      编写函数fun，其功能是：把分数最低的学生数据放入b所指的数组中，注意：分数
      最低的学生可能不止一个，函数返回分数最低的学生人数。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

#define   N   16

void wwjt ();

typedef  struct
{  
        char  num[10];
        int   s;
} STREC;
int  fun( STREC  *a, STREC *b )
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{  
        STREC  s[N]={{"GA05",85},{"GA03",76},{"GA02",69},{"GA04",85},
                {"GA01",91},{"GA07",72},{"GA08",64},{"GA06",87},
                {"GA015",85},{"GA013",91},{"GA012",64},{"GA014",91},
                {"GA011",91},{"GA017",64},{"GA018",64},{"GA016",72}};
        STREC  h[N];
        int  i,n;
        n=fun( s,h );
        printf("The %d lowest score :\n",n);
        for(i=0;i<n; i++)
                printf("%s  %4d\n",h[i].num,h[i].s);
        printf("\n");
        wwjt ( );

}
void wwjt ( )
{
        FILE *in,*out ;
        int  i,n,a;
        STREC  s[N];
        STREC  h[N];
        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(a=0;a<10;a++)
        {
                for(i=0;i<16;i++)
                {
                        fscanf(in,"%s %d",&s[i].num,&s[i].s);
                }
                n=fun( s,h );
                fprintf(out, "%d\n",n);
                for(i=0;i<n; i++)
                        fprintf(out, "%4d\n",h[i].s);
        }
        fclose(in);
        fclose(out);
}


答案：	int i,j=0,min=a[0].s;
	for(i=0;i<N;i++)
		if(min>a[i].s) 
			min=a[i].s;    /*找出最小值*/
	for(i=0;i<N;i++)
		if(min==a[i].s) 
			b[j++]=a[i];  /*找出成绩与min相等的学生的记录，存入结构体b中*/
	return j; 

第104题 （10.0分）        题号:104        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：学生的记录由学号和成绩组成，N名学生的数据已放入主函数中的结构体数组s中，
      请编写函数fun，其功能是：按分数降序排列学生的记录，高分在前，低分在后。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

#define   N   16

void wwjt ( );

typedef  struct
{  
        char  num[10];
        int   s;
} STREC;
void  fun( STREC  a[] )
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{  
        STREC  s[N]={{"GA005",85},{"GA003",76},{"GA002",69},{"GA004",85},
                {"GA001",91},{"GA007",72},{"GA008",64},{"GA006",87},
                {"GA015",85},{"GA013",91},{"GA012",64},{"GA014",91},
                {"GA011",66},{"GA017",64},{"GA018",64},{"GA016",72}};
        int i;
        fun( s );
        printf("The data after sorted :\n");
        for(i=0;i<N; i++)
        {  
                if( (i)%4==0 )printf("\n");
                printf("%s  %4d  ",s[i].num,s[i].s);
        }
        printf("\n");
        wwjt( );
        

}
void wwjt( )
{
        FILE *in, *out ;
        STREC  s[N];
        int  i,j;
        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }

        for(j=0;j<N; j++)
        {
                fscanf(in,"%s %d",&s[j].num,&s[j].s);
        }
        fun(s);
        for(i=0;i<N; i++)
        {  
                if( (i)%4==0 && i)
                        fprintf(out, "\n");
                        fprintf(out, "%4d  ",s[i].s);
        }

        fprintf(out,"\n");
        fclose(out) ;
}

答案：	int i,j;
	STREC t;
	for(i=1;i<N;i++)
		for(j=0;j<N-1;j++)
			if(a[j].s<a[j+1].s)
			{
				t=a[j];
				a[j]=a[j+1];
				a[j+1]=t;
			}


第105题 （10.0分）        题号:105        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：学生的记录由学号和成绩组成。N名学生的数据已放入主函数中的结构体数组s中，
      请编写函数fun，其功能是：把高于等于平均分的学生数据放在b所指的数组中，
      高于等于平均分的学生人数通过形参n传回，平均分通过函数值返回。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

#define   N   12

void wwjt ( );

typedef  struct
{  
        char  num[10];
        int  s;
} STREC;
double  fun( STREC  *a, STREC *b, int *n )
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{ 
        STREC  s[N]={{"GA05",85},{"GA03",76},{"GA02",69},{"GA04",85},
                {"GA01",91},{"GA07",72},{"GA08",64},{"GA06",87},
                {"GA09",60},{"GA11",79},{"GA12",73},{"GA10",90}};
        STREC  h[N];
        int i, n;  
        double  ave;
        ave=fun( s,h,&n );
        printf("The %d student data which is higher than %7.3f:\n",n,ave);
        for(i=0;i<n; i++)
                printf("%s  %d\n",h[i].num,h[i].s);
        printf("\n");
        wwjt ( );
        
}

void wwjt( )
{
        FILE *in, *out ;
        STREC  h[N];
        int  i,j, n; 
        double  ave;
        STREC  s[N];

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }

        for(j=0;j<10;j++)
        {
                for(i=0; i<N; i++)
                {
                        fscanf(in,"%s %d", &s[i].num, &s[i].s);
                }

                ave=fun( s,h,&n );
                fprintf(out, "%d\n%7.3f\n", n, ave);
        }
        fclose(in);
        fclose(out);
}

答案：	int i;
	double av=0.0;
	*n=0;
	for(i=0;i<N;i++)
		av=av+a[i].s;
	av=av/N;                                                                                  
	for(i=0;i<N;i++) 
		if(av<=a[i].s) 
                { 
			b[*n]=a[i];
			*n=*n+1;
                }     
	return av;

第106题 （10.0分）        题号:106        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，其功能是：找出一维整型数组元素中最大的值及其所在的下标，并
      通过形参传回。数组元素中的值已在主函数中赋予。主函数中x是数组名，n是x中的
      数据个数，max存放最大值，index存放最大值所在元素的下标。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include<stdlib.h>
#include<stdio.h>
#include<time.h>

void wwjt();

void fun(int a[],int n, int *max, int *d)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{ 
 
        int i, x[20], max,  index, n=10;
        srand((unsigned)time(NULL));
        for(i=0;i<n;i++)
        {
                x[i]=rand()%50; 
                printf("%4d",x[i]);    /*输出一个随机数组*/
        }
        printf("\n");
        fun(x,n,&max,&index);
        printf("Max=%5d,Index=%4d\n",max,index);

        wwjt ();
}
void wwjt()
{
        FILE *in,*out;
        int i,j ,max,  index, n=10;
        int y[20];

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(j=0;j<10;j++)
        {
                for(i=0;i<20;i++)
                {
                        fscanf(in,"%d",&y[i]);
                }

   
                fun(y,6,&max,&index);
                fprintf(out,"Max=%5d,Index=%4d\n",max,index);
        }
        fclose(in);
        fclose(out);
}

答案：	int i;
	*max=a[0];
	*d=0;
	for(i=0;i<n;i++)          /*将最大的元素放入指针max所指的单元，最大元素的下标放入指针d所指的单元*/
		if(*max<a[i])
		{
			*max=a[i];
			*d=i;
		}

第107题 （10.0分）        题号:107        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun,该函数的功能是：将M行N列的二维数组中的数据,按列的顺序依次
      放到一维数组中。一维数 组中数据的个数存放在形参n所指的存储单元中。

例如：若二维数组中的数据为            33 33 33 33                       
                                      44 44 44 44                        
                                      55 55 55 55

      则一维数组中的内容应是：33 44 55 33 44 55 33 44 55 33 44 55

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      所编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt();

void fun (int (*s)[10], int *b, int *n,int mm, int nn)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{
        int w[10][10]={{33,33,33,33},{44,44,44,44},{55,55,55,55}}, i, j;
        int a[100]={0},n=0 ,s;

        printf("The matrix:\n");
        for (i=0; i<3; i++)
        {
                for (j=0;j<4;j++)  
                printf("%3d",w[i][j]);
                printf("\n");
        }
        fun(w,a,&n,3,4);
        printf("The A array:\n");
        for(s=0; s<n; s++)  
        {     
                
                printf("%3d ",a[s]);
        }
        wwjt ();
}
void wwjt ()
{
        FILE *in, *out;
        int w[10][10], i, j,s;
        int a[100]={0}, n=0 ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<3;i++)
                for(j=0; j<6; j++)
                        fscanf(in,"%d",&w[i][j]);
        fun(w,a,&n,3,6);

        for(s=0; s<n; s++)  
        {     
                
                fprintf(out,"%d ",a[s]);
        }
        fclose(in);
        fclose(out);
}

答案：	int i,j;
	for(j=0;j<nn;j++)                              /*将二位数组中的数据按列的顺序依次放入一位数组中*/
		for(i=0;i<mm;i++)
		{
			b[*n]=*(*(s+i)+j);
			*n=*n+1;                                                           /*通过指针返回元素个数*/

		}

第108题 （10.0分）        题号:108        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun,该函数的功能是：将放在字符串数组中的M个字符串(每串的长度不
      超过N),按顺序合并组成一个新的字符串。

例如：若字符串数组中的M个字符串为{"AAAA","BBBBBBB","CC"}则合并后的字符串内容应
      该是"AAAABBBBBBBCC"

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      所编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <conio.h>

#define M 3
#define N 20

void wwjt();

void fun(char a[M][N],char *b)
{

        /**********Program**********/

                                                               
        /**********  End  **********/
}
void main()
{ 
  
        char w[M][N]={"AAAA", "BBBBBBB", "CC"},i;
        char a[100]={"##############################"};
        printf("The string:\n ");
        for(i=0;i<M;i++) 
                puts(w[i]);
        printf("\n ");
        fun(w,a);
        printf("The A string:\n ");
        printf("%s ",a);
        printf("\n\n ");
        wwjt ();

}
void wwjt()
{
        FILE *in, *out;
        int i,j;
        char w[M][N];
        char a[100]={"##############################"};

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0; i<4; i++)
                for(j=0;j<4;j++)
                        fscanf(in,"%s",&w[i][j]);
        fun(w,a);
        fprintf(out,"%s",a);
        fclose(in);
        fclose(out);
}


答案：	int i,j,k=0;
	for(i=0;i<M;i++)                              
		for(j=0;a[i][j]!='\0';j++)
			b[k++]=a[i][j];
	b[k]='\0';  

第109题 （10.0分）        题号:109        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun,该函数的功能是：将M行N列的二维数组中的字符数据,按列的顺序依
      次放到一个字符串中。

例如：若二维数组中的数据为                
                           W W W W                    
                           S S S S                     
                           H H H H

      则字符串中的内容应是：  WSHWSHWSHWSH。

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      所编写的若干语句。

-------------------------------------------------------*/
#include<stdio.h>

#define  M  3
#define  N  4

void wwjt();

void fun(char (*s)[N],char *b)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{ 

        char a[100];
        char w[M][N]={{ 'W', 'W', 'W', 'W'},{'S', 'S', 'S', 'S'},
                     {'H', 'H', 'H', 'H'}};
        int i,j;
        printf("The matrix:\n");
        for(i=0;i<M;i++)
        { 
                for(j=0;j<N;j++) 
                        printf("%3c",w[i][j]);
                printf("\n");
        }
        fun(w,a);
        printf("The A string:\n");
        puts(a);
        printf("\n\n");
        wwjt ();


}
void wwjt( )
{
        FILE *in, *out;
        char a[100];
        char w[M][N]={{ 'W', 'W', 'W', 'W'},{'S', 'S', 'S', 'S'},
                      {'H', 'H', 'H', 'H'}};
        int i,j;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
    
        for(i=0;i<4;i++)
                for(j=0;j<4;j++) 
                        fscanf(in,"%c",&w[i][j]);
        fun(w,a);
        fprintf(out,"%s",a);
        fclose(in);
        fclose(out);
}

答案：	int i,j,k=0;
	for(i=0;i<N;i++)         /*按列的顺序依次放到一个字符串中*/
		for(j=0;j<M;j++)
			b[k++]=s[j][i];
	b[k]='\0';

第110题 （10.0分）        题号:110        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun,该函数的功能是：删除一维数组中所有相同的数,使之只剩一个。
      数组中的数已按由小到大的顺序排列,函数返回删除后数组中数据的个数。

例如：若一维数组中的数据是：2 2 2 3 4 4 5 6 6 6 6 7 7 8 9 9 10 10 10删除后,数
      组中的内容应该是： 2 3 4 5 6 7 8 9 10。

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      所编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

#define N 80

void wwjt( );

int fun(int a[], int n)
{

        /**********Program**********/

                                                                     
        /**********  End  **********/
}
void main()
{ 
        
        int a[N]={ 2,2,2,3,4,4,5,6,6,6,6,7,7,8,9,9,10,10,10,10}, i, n=20;
        printf("The original data :\n");
        for(i=0; i<n; i++)  
                printf("%3d",a[i]);
        n=fun(a,n);
        printf("\n\nThe data after deleted :\n");
        for(i=0; i<n; i++)  
                printf("%3d",a[i]);  
        printf("\n\n");        
        wwjt();
}
void wwjt()
{
        FILE *in,*out;
        int a[N],i,n=20;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<20;i++)
        {
                fscanf(in,"%d",&a[i]);
        }

        n=fun(a,n);
        for(i=0; i<n; i++)  
                fprintf(out,"%3d",a[i]);
        fclose(in);
        fclose(out);
}

答案：	int i,j=1;
	for(i=1;i<n;i++)
		if(a[j-1]!=a[i])                                            
			a[j++]=a[i];
	return j; 

第111题 （10.0分）        题号:111        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：学生的记录由学号和成绩组成，N名学生的数据已在主函数中放入结构体数组s中，
      请编写函数fun ，其功能是：把低于平均分的学生数据放入b所指的数组中，低于
      平均分的学生人数通过形参n传回，平均分通过函数值返回。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt();

#define   N   8

typedef  struct
{  
        char  num[10];
        int   s;
} STREC;
double  fun( STREC  *a, STREC *b, int *n )
{
        /**********Program**********/


        /**********  End  **********/
}

main()
{  
        STREC  s[N]={{"GA05",85},{"GA03",76},{"GA02",69},{"GA04",85},
                {"GA01",91},{"GA07",72},{"GA08",64},{"GA06",87}};
        STREC  h[N];
        int  i,n;  
        double  ave;
        ave=fun( s,h,&n );
        printf("The %d student data which is lower than %7.3f:\n",n,ave);
        for(i=0;i<n; i++)
                printf("%s  %d\n",h[i].num,h[i].s);
        printf("\n");
        wwjt();

}

void wwjt()
{
        FILE *in,*out;
        STREC  s[N], h[N];
        int  i,j,n;  
        double  ave;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(j=0;j<10;j++)
        {
                for(i=0;i<8;i++)
                {
                        fscanf(in,"%s %d",&s[i].num,&s[i].s);
                }
                ave=fun( s,h,&n );
                fprintf(out, "%d\n%7.3f\n", n, ave);
        }
        fclose(in);
        fclose(out);
}


答案：	int i,j=0;
	double av=0.0;
	for(i=0;i<N;i++)
		av=av+a[i].s;
	av=av/N;
	for(i=0;i<N;i++)
		if(a[i].s<av) 
			b[j++]=a[i];
	*n=j;
	return av;

第112题 （10.0分）        题号:112        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：学生的记录由学号和成绩组成,N名学生的数据已放入主函数中的结构体数组s中。
      请编写函数fun,其功能是：把指定分数范围内的学生数据放在b所指的数组中,分
      数范围内的学生人数由函数值返回。

例如：输入的分数是60、69,则应当把分数在60~69的学生数据输出,包含60分和69分的学
      生数据。主函数中把60放在low中,把69放在heigh中。

注意：请勿改动主函数main和其它函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

#define   N   16

void wwjt();

typedef  struct
{  
        char  num[10];
        int   s;
} STREC;
int  fun( STREC  *a,STREC *b,int l, int h )
{
        /**********Program**********/


        /**********  End  **********/
}

main()
{  
        STREC  s[N]={{"GA005",85},{"GA003",76},{"GA002",69},{"GA004",85},
                {"GA001",96},{"GA007",72},{"GA008",64},{"GA006",87},
                {"GA015",85},{"GA013",94},{"GA012",64},{"GA014",91},
                {"GA011",90},{"GA017",64},{"GA018",64},{"GA016",72}};
        STREC  h[N];
        int  i,n,low,heigh,t;
        printf("Enter 2 integer number low & heigh :  ");
        scanf("%d%d", &low,&heigh);
        if ( heigh< low )
        {
                t=heigh;
                heigh=low;
                low=t; 
        }
        n=fun( s,h,low,heigh );
        printf("The student's data between %d--%d :\n",low,heigh);
        for(i=0;i<n; i++)
                printf("%s  %4d\n",h[i].num,h[i].s);
        printf("\n");
        wwjt();
}
void wwjt()
{
        FILE *in, *out ;
        STREC  s[N],h[N];
        int i,j,n;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(j=0;j<10;j++)
        {
                for(i=0;i<16;i++)
                {
                        fscanf(in,"%s %d",&s[i].num,&s[i].s);
                }
                n=fun( s,h,80,98 );
                fprintf(out,"%d\n",n);
        }
        fclose(in);
        fclose(out);
}



答案：	int i,j=0;
	for(i=0;i<N;i++)
		if(a[i].s>=l&&a[i].s<=h)
			b[j++]=a[i];
	return j; 

第113题 （10.0分）        题号:113        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun,该函数的功能是：将s所指字符串中ASCII码值为偶数的字符删除,串
      中剩余字符形成一个新串放在t所指的数组中。

例如：若s所指字符串中的内容为"ABCDEFG12345",其中字符B的ASCII码值为偶数,
      字符2的ASCII码值为偶数,都应当删除,其他依此类推。最后t所指的数组中
      的内容应是"ACEG135"。

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      所编写的若干语句。

-------------------------------------------------------*/
#include<stdio.h>
#include<string.h>
#include<conio.h>
#include<stdlib.h>

void wwjt();

void fun(char  *s, char t[])
{
        /**********Program**********/

            
        /**********  End  **********/
}
void main()
{

        char s[100],t[100];
        system("CLS");
        printf("\nPlease enter string S: ");  
        scanf("%s",s);
        fun(s,t);
        printf("\nThe result is :%s\n",t);
        wwjt();
}
void wwjt()
{
        FILE *in,*out;
        char s[100],t[100];        
        int i;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        
        for(i=0;i<10;i++)
        {
                fscanf(in,"%s",&s);
                fun(s,t);
                fprintf(out,"%s\n",t);
        }
        fclose(in);
        fclose(out);
}

答案：	int i=0;
	for(;*s!='\0';s++)     
		if(*s%2==1)     
			t[i++]=*s;
	t[i]='\0';

第114题 （10.0分）        题号:114        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：已知学生的记录由学号和学习成绩构成，N名学生的数据已存入a结构体数组中。
      请编写函数fun，该函数的功能是：找出成绩最高的学生记录，通过形参返回主
      函数(规定只有一个最高分)。已给出函数的首部，请完成该函数。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include<stdio.h>
#include<string.h>
#include<conio.h>
#include<stdlib.h> 

#define N 10

void wwjt();

typedef struct ss    /*定义结构体*/
{        
        char num[10]; 
        int s;
} STU;
void fun(STU a[], STU *s)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{ 
        
        STU a[N]={{ "A01",81},{ "A02",89},{ "A03",66},{ "A04",87},{ "A05",77},
                { "A06",90},{ "A07",79},{ "A08",61},{ "A09",80},{ "A10",71}},m;
        int i;
        system("CLS");
        printf("*****The original data*****");
        for(i=0;i<N;i++) 
                printf("No=%s Mark=%d\n", a[i].num,a[i].s);
        fun(a,&m);
        printf("*****THE RESULT*****\n");
        printf("The top :%s, %d\n",m.num,m.s);
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        STU a[N],m;
        int i;
        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        
        for(i=0; i<10;i++)
        {
                fscanf(in,"%s %d",&a[i].num,&a[i].s);
        }
        fun(a,&m);
        fprintf(out,"%s,%d",m.num,m.s);
        fclose(in);
        fclose(out);

}

答案：	int i;
	*s=a[0];        
	for(i=0;i<N;i++)    /*找出成绩最高的学生记录*/
		if(s->s<a[i].s)
			*s=a[i];


第115题 （10.0分）        题号:115        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：程序定义了N×N的二维数组，并在主函数中自动赋值。请编写函
      数fun(int a[][N]，int n)，该函数的功能是：使数组左下半三
      角元素中的值乘以n。

例如：若n的值为3，a数组中的值为：     1    9    7

                                      2    3    8

                                      4    5    6      
       则返回主程序后a数组中的值应为：     
                                      3    9    7

                                      6    9    8
                                      
                                      12   15   18                      
注意：请勿改动函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include     <stdio.h>
#include     <conio.h>
#include     <stdlib.h>

#define    N  5

void wwjt ( );

void fun(int a[ ][N], int n)
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{ 
        int  a[N][N],n, i,j;
        printf("***** The array *****\n");
        for(i=0; i<N; i++)
        {  
                for(j=0; j<N; j++)
                {  
                        a[i][j]=rand()%10; 
                        printf("%4d", a[i][j]);
                }
                printf("\n");
        }
        n=rand()%10;
        printf("n=%4d\n",n);
        fun(a, n);
        printf("*****THE  RESULT*****\n");
        for(i=0; i<N; i++)
        {  
                for (j=0; j<N; j++) 
                        printf("%4d",a[i][j]);
                printf("\n");
        }
        wwjt();

}
void wwjt()
{
        FILE *in, *out;
        int  a[N][N],i,j;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }

        for(i=0;i<5;i++)
        {
                for(j=0; j<5;j++)
                        fscanf(in,"%d",&a[i][j]);
        }
        fun(a,4);
        for(i=0;i<N;i++)
        {
                for(j=0;j<N;j++)
                        fprintf(out,"%4d",a[i][j]);
                fprintf(out,"\n");
        }
        fclose(in);
        fclose(out);
}

答案：	int i,j;
		for(i=0;i<N;i++)
			for(j=0;j<=i;j++)
				a[i][j]=a[i][j]*n;

第116题 （10.0分）        题号:116        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：下列程序定义了N×N的二维数组，并在主函数中自动赋值。
       请编写函数fun(int a[][N])，该函数的功能是：将数组
       左下半三角元素中的值全部置成0。

例如：a数组中的值为：1  9  7               
                     2  3  8                
                     4  5  6
      则返回主程序后a数组中的值应为：
                                0  9  7                             
                                0  0  8                          
                                0  0  0
注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <conio.h>
#include <stdio.h>
#include <stdlib.h>

#define N 5

void wwjt();

void fun (int a[][N])
{
        /**********Program**********/

                                                
        /**********  End  **********/
}
void main()
{ 
        int a[N][N],i,j;
        system("CLS");
        printf("*****The array*****\n");
        for(i=0;i<N;i++)              /*产生一个随机的5*5矩阵*/
        { 
                for(j=0;j<N;j++)
                {
                        a[i][j]=rand()%10; 
                        printf("%4d", a[i][j]);
                }
                printf("\n");
        }
        fun(a);
        printf("THE RESULT\n");
        for(i=0;i<N;i++)
        { 
                for(j=0;j<N;j++) 
                        printf("%4d",a[i][j]);
                printf("\n");
        }
        wwjt();
}
void wwjt()
{
        FILE *in,*out;
        int a[N][N],i,j;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<N;i++)
        { 
                for(j=0;j<N;j++) 
                        fscanf(in,"%d",&a[i][j]);
        }
        fun(a);
        for(i=0;i<N;i++)
        { 
                for(j=0;j<N;j++) 
                        fprintf(out,"%4d",a[i][j]);
                fprintf(out,"\n");
        }
        fclose(in);
        fclose(out);
}

答案：	int i,j;
	for(i=0;i<N;i++)
		for(j=0;j<=i;j++)
			a[i][j]=0; 

第117题 （10.0分）        题号:117        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，w是一个大于10的无符号整数，若w是n(n≥2)位的整数，则函数求
      出w的后n－1位的数作为函数值返回。

例如：w值为5923，则函数返回923；若w值为923，则函数返回23。

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include<conio.h>
#include<stdio.h>
#include<stdlib.h>

void wwjt();

unsigned fun(unsigned w)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{ 
  
        unsigned x;
        printf("Enter a unsigned integer number: ");
        scanf ("%u",&x);
        printf("The original data is:%u\n",x);
        if(x<10) 
                printf("Data error! ");
        else 
                printf ("The result :%u\n", fun(x));

        wwjt();

}
void wwjt()
{
        FILE *in, *out;
        unsigned s;        
        int i;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0; i<10; i++)
        {
                fscanf (in,"%u",&s);
                fprintf(out,"%u\n",fun(s));
        }
        fclose(in);
        fclose(out);

}

答案：	int n=1,j,s=1;
	unsigned t;
	t=w;
	/*首先确定w的位数，用变量n保存*/
	while(t>=10)
	{
		/*每次循环使s的位数减1，同时n加1*/
		t=t/10;
		n++;
	}
	/*求10的n-1次方*/	
	for(j=1;j<n;j++)
		s=s*10;
	/*用w对10的n-1次方求余即可得到所求*/
	return w%s;

第118题 （10.0分）        题号:118        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编一个函数fun(char *s)，该函数的功能是：把字符串中的内容逆置。

例如：字符串中原有的字符串为"abcdefg"，则调用该函数后，串中的内容为"gfedcba"。

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      所编写的若干语句。

-------------------------------------------------------*/
#include <string.h>
#include <conio.h>
#include <stdio.h>

#define N 81

void wwjt();

void fun(char*s)
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{
        char a[N];
        printf("Enter a string:");
        gets(a);
        printf("The  original string is:");
        puts(a);
        fun(a);
        printf("\n");
        printf("The string after modified:");
        puts(a);
        wwjt();
         
}
void wwjt()
{
        FILE *in,*out;
        char a[N];
        int i;
        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }

        for(i=0; i<N; i++)
        {
                fscanf(in,"%s",&a[i]);
        }
        fun(a);
        fprintf(out,"%s\n",a);
        fclose(in);
        fclose(out);

}


答案：	char ch;
	int i,m,n;
	i=0;
	m=n=strlen(s)-1;
	while(i<(n+1)/2)
	{
		/*使用中间变量叫唤*/
		ch=s[i];
		s[i]=s[m];
		s[m]=ch;
		i++;
		m--;
	}

第119题 （10.0分）        题号:119        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数fun，其功能是：从字符串中删除指定的字符。同字母的大、小写按不
      同字符处理。

例如：若程序执行时输入字符串为"turbo c and borland c＋＋"从键盘上输入字符n，
      则输出为"turbo c ad borlad c＋＋"
      如果输入的字符在字符串中不存在，则字符串照原样输出。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <string.h>
#include <stdio.h>

void wwjt();

void fun( char s[],int c)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{
        static char str[]="turbo c and borland c++";
        char ch;
        printf("原始字符串:%s\n ",str);
        printf("输入一个字符:\n");
        scanf("%c",&ch);
        fun(str,ch);
        printf("str[]=%s\n",str);

        wwjt();
}
void wwjt( )
{
        FILE *in, *out;
        static char str[]="turbo c and borland c++";
        char s;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }

        fscanf(in,"%c",&s);
        fun(str,s);
        fprintf(out,"%s\n",str);
        fclose(in);
        fclose(out);
}




答案：	int i=0;
	char *p;
	p=s;
	while(*p)                                                                         /*判断是否为结束符*/
	{
		if(*p!=c)     /*判断字符串中字符是否与指定字符相同*/
		{
			s[i]=*p;      /*不同将重新组合字符串，*/ 
			i++;
		}
		p++;                                                                    /*相同则处理下一个字符。*/
	} 
	s[i]='\0';

第120题 （10.0分）        题号:120        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写一个函数，该函数可以统计一个长度为2的字符串在另一个字符串中出现的次数。

例如：假定输入的字符串为"asd asasdfg asd as zx67 asd mklo"，子字符串为"as"，则
      应当输出6。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <conio.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

void wwjt();

int fun(char *str, char *substr)
{
        /**********Program**********/

                                                       
        /**********  End  **********/
}
void main()
{ 
        char str[81],substr[3];
        int n;
        system("CLS");
        printf("输入主字符串: ");
        gets(str);
        printf("输入子字符串: ");
        gets(substr);
        puts(str);
        puts(substr);
        n=fun(str,substr);
        printf("n=%d\n ",n);
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        char str[81];
        int n,i;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<81;i++)
        {
                fscanf(in,"%s",&str[i]);
        }
        n=fun(str,"ad");
        fprintf(out,"%d",n);
        fclose(in);
        fclose(out);
}

答案：	int i,j=0;
	for(i=0;str[i+1]!='\0';i++)   /*如果一个长度为2的子字符串在主字符串中出现一次，则j＋1，如此循环*/
		if(str[i]==substr[0]&&str[i+1]==substr[1])
			j++;
	return j;   

第121题 （10.0分）        题号:121        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写一个函数fun，它的功能是：计算并输出给定整数n的所有因子
      (不包括1与自身)之和。规定n的值不大于1000。

例如：若主函数从键盘给n输入的值为856，则输出为sum＝763。

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      所编写的若干语句。

-------------------------------------------------------*/
#include  <stdio.h>

void wwjt();

int fun(int n)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{ 
        int  n,sum; 
        printf("Input  n:"); 
        scanf("%d", &n);
        sum=fun(n);
        printf("sum=%d\n", sum);
        wwjt();

}
void wwjt()
{
        FILE *in, *out;
        int i, n, sum; 

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        
        for(i=0;i<10;i++)
        {
                fscanf(in,"%d",&n);
                sum=fun(n);
                fprintf(out,"%d\n",sum);
        }
        fclose(in);
        fclose(out);
}


答案：	int s=0,i;
	for(i=2;i<=n-1;i++)                                                                  /*将n减1累加*/
		if(n%i==0)
			s+=i;
	return s;

第122题 （10.0分）        题号:122        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，其功能是计算并输出如下多项式的值。 
      Sn＝1＋1/1！＋1/2！＋1/3！＋1/4！＋…＋1/n!

例如：若主函数从键盘给n输入15，则输出为S＝2.718282。

注意：n的值要求大于1但不大于100。
      请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt();

double fun(int n)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{
        int n; 
        double s;
        printf("\nInput n: "); 
        scanf("%d",&n);
        s=fun(n);
        printf("s=%f\n",s);
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int i,n; 
        double s;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<10;i++)
        {
                fscanf(in,"%d",&n);
                s=fun(n);
                fprintf(out,"%f\n",s);
        }
        fclose(in);
        fclose(out);
}



答案：	double t,sn=1.0;
	int i,j;
	for(i=1;i<=n;i++)
	{
		t=1.0;
		for(j=1;j<=i;j++)
			t*=j;
			sn+=1.0/t;
	}
	return sn;


第123题 （10.0分）        题号:123        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，其功能是：计算并输出当x<0.97时，如下多项式的值，直到
      |Sn－Sn－1|<0.000001为止。   
 
例如：若主函数从键盘给x输入0.21后，则输出为S＝1.100000。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include  <math.h>
#include  <stdio.h>

void wwjt();

double fun(double x)
{ 
        /**********Program**********/


        /**********  End  **********/
}
void main()
{ 
        double x,s;
        printf("Input x: ");
        scanf("%lf",&x);
        s=fun(x);
        printf("s=%f\n ",s);
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int i;
        double x,s;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0; i<10; i++)
        {
                fscanf(in,"%lf",&x);
                s=fun(x);
                fprintf(out,"%f\n",s);
        }
        fclose(in);
        fclose(out);
}



答案：	double s1=1.0,p=1.0,sum=0.0,s0,t=1.0;
	int n=1;
	do
	{
		s0=s1;
		sum+=s0;
		t*=n;
		p*=(0.5-n+1)*x;
		s1=p/t;
		n++;
	}
	while(fabs(s1-s0)>=1e-6);
	return sum;


第124题 （10.0分）        题号:124        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，其功能是：计算并输出给定10个数的方差。

例如：给定的10个数为95.0、89.0、76.0、65.0、88.0、72.0、85.0、81.0、90.0、56.0，
      则输出为S＝11.730729。

注意：请勿改动主main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include<math.h>
#include<stdio.h>

void wwjt();

double fun(double x[10])
{
        /**********Program**********/
 
 
        /**********  End  **********/

}
void main()
{ 
        
        double s,x[10]={95.0,89.0,76.0,65.0,88.0,72.0,85.0,81.0,90.0,56.0};
        int i;
        printf("\nThe original data is:\n");
        for(i=0;i<10;i++) 
                printf("%6.1f ",x[i]);
        printf("\n\n ");
        s=fun(x);
        printf("s=%f\n\n ",s);
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        double s, x[10];
        int i;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0; i<10; i++)
        {
                fscanf(in,"%lf",&x[i]);
        }
        s=fun(x);
        fprintf(out,"%f",s);
        fclose(in);
        fclose(out);
}

答案：	double x1=0.0,s=0.0;
	int i;
	for(i=0;i<10;i++)
		x1=x1+x[i];
	x1=x1/10;                                                                           
	for(i=0;i<10;i++)
		s=s+(x[i]-x1)*(x[i]-x1);
	return sqrt(s/10); 

第125题 （10.0分）        题号:125        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，其功能是：计算并输出给定数组(长度为9)中每相邻两个元素的
      平均值的平方根之和。

例如：若给定数组中的9个元素依次为12.0、34.0、4.0、23.0、34.0、45.0、18.0、3.0、
      11.0，则输出应为S＝35.951014。

注意：请勿改主动函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include  <stdio.h>
#include  <math.h>

void wwjt();

double fun(double x[9])
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{
        double s,a[9]={12.0,34.0,4.0,23.0,34.0,45.0,18.0,3.0,11.0};
        int i;
        printf("\nThe original data is : ");
        for(i=0;i<9;i++)
                printf("%6.1f",a[i]);
        printf("\n\n"); 
        s=fun(a);
        printf("s=%f\n\n",s);
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        double s,a[9];
        int i;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0; i<9; i++)
        {
                fscanf(in,"%lf",&a[i]);
        }
        s=fun(a);
        fprintf(out,"%f",s);
        fclose(in);
        fclose(out);
}


答案：	double sum=0.0;
	int i,j=1;
	for(i=0;i<9;i++)
	if(j<=8)
	{
		sum+=sqrt((x[i]+x[i+1])/2.0);j++;              
	}
	return sum;

第126题 （10.0分）        题号:126        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，该函数的功能是：计算并输出n(包括n)以内所有能被5或9整除的
      自然数的倒数之和。

例如：若主函数中从键盘给n输入20后，则输出为S＝ 0.583333。

注意：n的值要求不大于100。。
      请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt();

double fun(int n)
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{
        int n;
        double s;
        printf("\nInput n:");
        scanf("%d",&n);
        s=fun(n);
        printf("\n\ns=%f\n",s);
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int i, n;
        double s;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<10;i++)
        {
                fscanf(in,"%d",&n);
                s=fun(n);
                fprintf(out,"%lf\n",s);
        }
        fclose(in);
        fclose(out);

}

答案：	int i;
	double sum=0.0;
	for(i=1;i<=n;i++)                    
		if(i%5==0||i%9==0)
			sum+=1.0/i;
	return sum;

第127题 （10.0分）        题号:127        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，该函数的功能是：计算并输出n(包括n)以内所有能被5或9整除的
      自然数的倒数之和。

例如：若主函数中从键盘给n输入20后，则输出为S＝ 0.583333。

注意：n的值要求不大于100。
      请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include  <stdio.h>
#include  <math.h>

void wwjt();

double fun(int n)  
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{
        int n;
        double sum;
        printf("Input  N=");
        scanf("%d",&n);
        sum=fun(n);
        printf("\n\nsum=%f\n\n",sum);
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int i, n;
        double sum;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<10;i++)
        {
                fscanf(in,"%d",&n);
                sum=fun(n);
                fprintf(out,"%lf\n",sum);
        }
        fclose(in);
        fclose(out);
}

答案：	int m,k,i;
	double s=0.0;
	for(m=3;m<=n;m++)
	{
		k=sqrt(m);
		for(i=2;i<=k;i++)
			if(m%i==0)
				break;
			if(i>=k+1)
				s+=sqrt(m);
	}
	return s;

第128题 （10.0分）        题号:128        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，该函数的功能是：计算并输出如“样张”的值。

例如：若主函数从键盘给n输入20后，则输出为S＝534.188884。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include<math.h>
#include<stdio.h>

void wwjt();

double fun(int n)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{
        int n; 
        double s;
        printf("\n\nInput n: ");
        scanf("%d",&n);
        s=fun(n);
        printf("\n\ns=%f\n\n",s);
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int i,n; 
        double s;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0; i<10; i++)
        {
                fscanf(in,"%d",&n);
                s=fun(n);
                fprintf(out,"%lf\n",s);
        }
        fclose(in);
        fclose(out);

}

答案：	int i;
	double s=0.0,s1=0.0;
	for(i=1;i<=n;i++)
	{
		s1=s1+pow(i,0.5);   /*求每一项*/
		s=s+s1;             /*按公式求出s*/
	}
	return s;

第129题 （10.0分）        题号:129        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：已知学生的记录由学号和学习成绩构成，N名学生的数据已存入a结构体数组中。
      请编写函数fun，该函数的功能是：找出成绩最低的学生记录，通过形参返回
      主函数(规定只有一个最低分)。已给出函数的首部，请完成该函数。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include<stdio.h>
#include<string.h>
#include<conio.h>
#include<stdlib.h>

#define N 10

void wwjt();

typedef struct ss
{ 
        char num[10]; 
        int s;
} STU;
fun(STU a[], STU *s)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{ 
        STU a[N]={{ "A01",81},{ "A02",89},{ "A03",66},{ "A04",87},{ "A05",77},
        { "A06",90},{ "A07",79},{ "A08",61},{ "A09",80},{ "A10",71}},m;
        int i;
        system("CLS");
        printf("*****The original data*****\n");
        for(i=0;i<N;i++) 
                printf("No=%s Mark=%d\n", a[i].num,a[i].s);
        fun(a,&m);
        printf("*****THE RESULT*****\n");
        printf("The lowest :%s, %d\n",m.num,m.s);
        wwjt();
}
void wwjt()
{
        FILE *in,*out;
        STU a[N],m;
        int i;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<N;i++)
        {
                fscanf(in,"%s %d",&a[i].num,&a[i].s);
        }
        fun(a,&m);
        fprintf(out,"%s, %d",m.num,m.s);
        fclose(in);
        fclose(out);
}

答案：	int i;
	*s=a[0];                                                                          
	for(i=0;i<N;i++)                               
		if(s->s>a[i].s)
			*s=a[i];

第130题 （10.0分）        题号:130        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：下列程序定义了N×N的二维数组，并在主函数中自动赋值。
      请编写函数fun(int a[ ][N]，int m)，该函数的功能是使
      数组右上半三角元素中的值乘以m。

例如：若m的值为2，a数组中的值为：1  9  7
                                 2  3  8 
                                 4  5  6  
      则返回主程序后a数组中的值应为： 
                                 2  18  14
                                 2   6  16
                                 4   5  12
                                            
注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <conio.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#define  N  5

void wwjt();

void fun(int a[][N], int m)
{
        /**********Program**********/
  
                                          
        /**********  End  **********/
}
void main()
{ 
        int a[N][N],m, i, j;
        printf("*****The array*****\n");
        for(i=0;i<N;i++)
        { 
                for(j=0;j<N;j++)
                {
                        a[i][j]=rand()%20;
                 printf("%4d", a[i][j]);
                }
                printf("\n");
        }
        m=rand()%4;
        printf("m=%4d\n",m);
        fun(a,m);
        printf("THE RESULT\n"); 
        for(i=0;i<N;i++)
        { 
                for(j=0;j<N;j++) 
                        printf("%4d",a[i][j]);
                printf("\n");
        }
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int a[N][N], i, j;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<N;i++)
        {
                for(j=0;j<N;j++)
                        fscanf(in,"%d",&a[i][j]);
        }
        fun(a,5);
        for(i=0;i<N;i++)
        {         
                for(j=0;j<N;j++)
                        fprintf(out,"%4d",a[i][j]);
                fprintf(out,"\n");
        }
        fclose(in);
        fclose(out);
}

答案：	int i,j;
	for(j=0;j<N;j++)
		for(i=0;i<=j;i++)
			a[i][j]=a[i][j]*m;  

第131题 （10.0分）        题号:131        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：下列程序定义了N×N的二维数组，并在主函数中赋值。请编写函数fun，函数的
      功能是：求出数组周边元素的平均值并作为函数值返回给主函数中的s。

例如：若a 数组中的值为： 0　1　2　7　9                     
                         1　9　7　4　5               
                         2　3　8　3　1              
                         4　5　6　8　2               
                         5　9　1　4　1
      则返回主程序后s的值应为3.375。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      所编写的若干语句。

-------------------------------------------------------*/
#include<stdio.h>
#include<conio.h>
#include<stdlib.h>

#define  N  5

void wwjt();

double fun (int w[][N])
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{
        int a[N][N]={0,1,2,7,9,1,9,7,4,5,2,3,8,3,1,4,5,6,8,2,5,9,1,4,1};
        int i, j;
        double s;
        system("CLS");
        printf("*****The array*****\n ");
        for (i=0; i<N; i++)
        { 
                for (j=0;j<N;j++)
                {
                        printf("%4d ",a[i][j]);
                }
                printf("\n ");
        }
        s=fun(a);
        printf("*****THE RESULT*****\n ");
        printf("The sum is : %lf\n ",s);
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int a[N][N];
        int i, j;
        double s;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for (i=0; i<N; i++)
        { 
                for (j=0;j<N;j++)
                {
                        fscanf(in,"%d",&a[i][j]);
                }
        
        }
        s=fun(a);
        fprintf (out,"%lf\n",s);
        fclose(in);
        fclose(out);
}

答案：	int i,j,k=0;
	double av=0.0;
	for(i=0;i<N;i++)    
		for(j=0;j<N;j++)
			if(i==0||i==N-1||j==0||j==N-1)             
			{
				av=av+w[i][j];                                                              
				k++;
			}
	return av/k; 

第132题 （10.0分）        题号:132        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，该函数的功能是：求出二维数组周边元素之和，作为函数值返回。
      二维数组中的值在主函数中赋予。

例如：若二维数组中的值为：                   
                          1　3　5　7　9                        
                          2　9　9　9　4                 
                          6　9　9　9　8                 
                          1　3　5　7　0
      则函数值为61。

注意：请勿改主动函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include<conio.h>
#include<stdio.h>
#include<stdlib.h>

#define  M  4
#define  N  5

void wwjt();

int fun( int a [M][N])
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{
        
        int aa[M][N]={{1,3,5,7,9},{2,9,9,9,4},{6,9,9,9,8},{1,3,5,7,0}};
        int i, j, y;
        system("CLS");
        printf ("The original data is :\n ");
        for(i=0; i<M;i++)
        {
                for (j=0; j<N;j++) 
                        printf("%6d ",aa[i][j]);
                printf("\n ");
        }
        y=fun(aa);
        printf("\nThe sun: %d\n ",y);
        printf("\n ");
        wwjt();

}
void wwjt()
{
        FILE *in, *out;
        int aa[M][N],i, j, y;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0; i<M;i++)
        {
                for (j=0; j<N;j++) 
                        fscanf(in,"%d",&aa[i][j]);
        }
        y=fun(aa);
        fprintf(out,"%d",y);
        fclose(in);
        fclose(out);
}

答案：	int i,j,sum=0;
	for(i=0;i<M;i++)
		for(j=0;j<N;j++)
			if(i==0||i==M-1||j==0||j==N-1)  
                sum=sum+a[i][j];              
	return sum;

第133题 （10.0分）        题号:133        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编一个函数 float fun(double h)，该函数的功能是：使变量h中的值保留两位
      小数，并对第三位进行四舍五入(规定h中的值为正数)。

例如：若h 值为1234.567，则函数返回1234.570000；若h值为 1234.564，则函数返
      回1234.560000。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <conio.h>
#include <stdlib.h>

void wwjt();

float fun (float h )
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{

        float a;
        system("CLS");
        printf("Enter a: ");
        scanf ("%f",&a);
        printf("The original data is :  ");
        printf("%f\n\n", a);
        printf("The  result : %f\n", fun(a));
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        float a;
        int i;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<10;i++)
        {
                fscanf(in,"%f",&a);
                fprintf(out,"%f\n",fun(a));
        }
        fclose(in);
        fclose(out);

}


答案：	long t;
	t=(h*1000+5)/10;      /*单精度数h乘以1000后再加5，相当于对h中的第三位小数进行四舍五入
                        除以10后将其赋给一个长整型数时就把第三位小数后的数全部截去*/
	return (float)t/100;  /*除以100，保留2位小数*/

第134题 （10.0分）        题号:134        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写程序，实现矩阵(3行、3列)的转置(即行列互换)。

例如：若输入下面的矩阵：
                         100　200　300                 
                         400　500　600           
                         700　800　900
      则程序输出：           
                         100　400　700     
                         200　500　800       
                         300　600　900

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <conio.h>
#include <stdlib.h>

void wwjt();

void fun (int array[3][3])
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{
        int i,j;
        int array [3][3]={{100,200,300},{400,500,600},{700,800,900}};
        system("CLS");
        for (i=0;i<3;i++)
        {
                for (j=0;j<3;j++)
                        printf("%7d ",array[i][j]);
                 printf("\n");
        }
        fun(array);
        printf("Converted array:\n ");
        for (i=0;i<3;i++)
        { 
                for (j=0;j<3;j++)
                        printf("%7d ",array[i][j]);
                printf("\n ");
        }   
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int array [3][3],i,j;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for (i=0;i<3;i++)
        {
                for (j=0;j<3;j++)
                        fscanf(in,"%d",&array[i][j]);
        }
        fun(array);
        for (i=0;i<3;i++)
        {
                for (j=0;j<3;j++)
                        fprintf(out,"%7d ",array[i][j]);
                fprintf(out,"\n");
        }
        fclose(in);
        fclose(out);
}

答案：	int i,j,t;
	for(i=0;i<3;i++)                                               /*将右上三角和左下三角对换，实现行列互换*/
		for(j=i+1;j<3;j++)
		{
			t=array[i][j];
			array[i][j]=array[j][i];
			array[j][i]=t;
		}

第135题 （10.0分）        题号:135        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写函数int fun(int lim, int aa[MAX])，其功能是求出小于或等于lim的所有
      素数并放在aa数组中，并返回所求出的素数的个数。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include<conio.h>
#include<stdio.h>
#include<stdlib.h>

#define MAX 100

void wwjt();

int fun(int lim, int aa[MAX])
{
        /**********Program**********/

                                                                    
        /**********  End  **********/
}
void main()
{
        int limit,i,sum;
        int aa[MAX];
        system("CLS");
        printf("输入一个整数:");
        scanf("%d",&limit);
        sum=fun(limit,aa);        
        for(i=0;i<sum;i++)
        {
                if(i%10==0&&i!=0)    /*每行输出10个数*/
                        printf("\n ");
                printf("%5d ",aa[i]);
        }
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int limit,i,sum;
        int aa[MAX];        
        
        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        fscanf(in,"%d",&limit);
        sum=fun(limit,aa);        
        for(i=0;i<sum;i++)
        {
                if(i%10==0&&i!=0)    
                fprintf(out,"\n");
                fprintf(out,"%5d ",aa[i]);
        }
        fclose(in);
        fclose(out);
}



答案：	int i,j,k=0;
	for(i=2;i<=lim;i++)                                                 
	{ 
		for(j=2;j<i;j++)
			if(i%j==0) 
				break;
		if(j>=i) 
			aa[k++]=i;                                                          
	}
	return k;    

第136题 （10.0分）        题号:136        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，该函数的功能是：将M行N列的二维数组中的数据，按行的顺序
      依次放到一维数组中，一维数组中数据的个数存放在形参n所指的存储单元中。


例如：若二维数组中的数据为：
                            33　33　33　33                
                            44　44　44　44                  
                            55　55　55　55

      则一维数组中的内容应该是：33　33　33　33　44　44　44　44　55　55　55　55。

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt();

void fun (int (*s)[10], int *b, int *n, int mm, int nn)
{
        /**********Program**********/

                                                                          
        /**********  End  **********/
}
void main()
{

        int w[10][10]={{33,33,33,33},{44,44,44,44},{55,55,55,55}}, i, j;
        int a[100]={0},n=0 ;
        printf("The matrix:\n");
        for (i=0; i<3; i++)
        {
                for (j=0;j<4;j++)  
        printf("%3d",w[i][j]);
                printf("\n");
    }
        fun(w,a,&n,3,4);
        printf("The A array:\n");
        for(i=0; i<n; i++)  
                printf("%3d",a[i]); 
        printf("\n\n");
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int w[10][10], i, j;
        int a[100]={0},n=0 ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for (i=0; i<3; i++)
        {
                for (j=0;j<5;j++)  
                        fscanf(in,"%3d",&w[i][j]);
                
    }
        fun(w,a,&n,3,5);
        for(i=0; i<n; i++)  
                fprintf(out,"%3d",a[i]); 
        fclose(in);
        fclose(out);
}

答案：	int i,j,k=0;
	for(i=0;i<mm;i++)                                
		for(j=0;j<nn;j++)
			b[k++]=s[i][j];
	*n=k;   

第137题 （10.0分）        题号:137        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写一个函数fun，它的功能是：将ss所指字符串中所有下标为奇数位置的字母
      转换为大写(若该位置上不是字母，则不转换)。

例如：若输入"abc4Efg"，则应输出"aBc4EFg"。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include<conio.h>
#include<stdio.h>
#include<string.h>
#include<stdlib.h>

void wwjt();

void fun(char *ss)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{

        char tt[81];
        system("CLS");
        printf("\nPlease enter an string within 80 characters:\n");
        gets(tt);
        printf("\n\nAfter changing, the string\n  %s",tt);
        fun(tt);
        printf("\nbecomes\n %s\n",tt);
        wwjt();

}
void wwjt()
{
        FILE *in, *out;
        char tt[81];
        int i;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0; i<81; i++)
        {
                fscanf(in,"%s",&tt[i]);
        }
        fun(tt);
        fprintf (out,"%s",tt);
        fclose(in);
        fclose(out);
}

答案：	int i;
	for(i=0;ss[i]!='\0';i++)                    /*将ss所指字符串中所有下标为奇数位置的字母转换为大写*/
		if(i%2==1&&ss[i]>='a'&&ss[i]<='z')   
			ss[i]=ss[i]-32;

第138题 （10.0分）        题号:138        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：m个人的成绩存放在score数组中，请编写函数fun，它的功能是：将低于平均分
      的人数作为函数值返回，将低于平均分的分数放在below所指的数组中。

例如：当score数组中的数据为10、20、30、40、50、60、70、80、90时，函数返回的
      人数应该是4，below中的数据应为10、20、30、40。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <conio.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

void wwjt();

int fun(int score[],int m, int below[])
{
        /**********Program**********/

                                                                       
        /**********  End  **********/
}
void main()
{
        
        int i, n, below[9];
        int score[9]={10,20,30,40,50,60,70,80,90};
        system("CLS");
        n=fun(score, 9, below);
        printf("\nBelow the average score are: ");
        for(i=0;i<n;i++)  
                printf("% d",below[i]);
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int i, n, below[9], score[9];

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0; i<9; i++)
        {
                fscanf(in,"%d",&score[i]);
        }
        n=fun(score, 9, below);
        for(i=0;i<n;i++)  
                fprintf(out,"% d",below[i]);
        fclose(in);
        fclose(out);
}

答案：	int i,j=0;
	float av=0.0;
	for(i=0;i<m;i++)
		av=av+score[i]/m;                                                                 
	for(i=0;i<m;i++)
		if(score[i]<av)                                   
			below[j++]=score[i];
	return j;  

第139题 （10.0分）        题号:139        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数void  fun (int x, int pp[], int *n)，它的功能是：求出能整除x且
      不是偶数的各整数，并按从小到大的顺序放在pp所指的数组中，这些除数的个数通
      过形参n返回。

例如：若x中的值为30，则有4个数符合要求，它们是1、3、5、15。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <conio.h>
#include <stdio.h>
#include <stdlib.h>

void wwjt();

void fun (int x, int pp[], int *n)
{
        /**********Program**********/


        /**********  End  **********/
}

void main ()
{ 
        int  x,aa[1000], n, i ;
        system("CLS");
        printf("\nPlease enter an integer number : \n ") ;
        scanf ("%d", &x) ;
        fun (x, aa, &n) ;
        for (i=0 ; i<n ; i++)
                printf ("%d ", aa [i]);
        printf ("\n ") ;
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int  x,aa[1000], n, i ;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        fscanf(in,"%d",&x);
        fun (x, aa, &n) ;
        for (i=0 ; i<n ; i++)
                fprintf (out,"%d ", aa [i]);
        fclose(in);
        fclose(out);
}


答案：	int i,j=0;
	for(i=1;i<=x;i=i+2)
		if(x%i==0)
			pp[j++]=i;
		*n=j;

第140题 （10.0分）        题号:140        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写一个函数，其功能是：从传入的num个字符中找出最长的一个字符串，并通过
      形参指针max传回该串地址(用****作为结束输入的标识)。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include<conio.h>
#include<stdio.h>
#include<string.h>
#include<stdlib.h>

void wwjt();

char *fun(char (*a)[81], int num, char *max)
{
        /**********Program**********/
 
            
        /**********  End  **********/
}

void main()
{
        char ss[10][81],*ps=NULL;
        int  i=0,n;
        system("CLS");
        printf("输入若干个字符串：");
        gets(ss[i]);
        puts(ss[i]);
        while(!strcmp(ss[i], "****")==0)  /*用4个星号作为结束输入的标志*/
        {
                i++;
                gets(ss[i]);
                puts(ss[i]);
        }
        n=i;
        ps=fun(ss,n,ps);
        printf("\nmax=%s\n",ps);
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        char s[3][81],*p=NULL;
        int i;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }

        for(i=0;i<3;i++)
        {
                fscanf(in,"%s",&s[i]);
        }
        p=fun(s,3,p);
        fprintf(out,"%s",p);
        fclose(in);
        fclose(out);
}

答案：	int i=0;
	max=a[0];
	for(i=0;i<num;i++)         
		if(strlen(max)<strlen(a[i])) 
			max=a[i];
	return max;  

第141题 （10.0分）        题号:141        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写一个函数void fun(int m, int k, int xx[])，该函数的功能是：将大于整
      数m且紧靠m的k个素数存入所指的数组中。

例如：若输入17,5，则应输出19、23、29、31、37。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <conio.h>
#include <stdio.h>
#include <stdlib.h>

void wwjt();

void fun(int m,int k,int xx[])
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{
        
        int m,n,zz[1000];
        system("CLS");
        printf("\nPlease enter two integers: ");
        scanf("%d%d",&m,&n);
        fun(m, n, zz);
        for(m=0;m<n;m++)
        printf("%d ",zz[m]);
        printf("\n ");
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int m,n,zz[1000];

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        fscanf(in,"%d%d",&m,&n);
        fun(m, n, zz);
        for(m=0;m<n;m++)
                fprintf(out,"%d ",zz[m]);
                fprintf(out,"\n ");
        fclose(in);
        fclose(out);
}

答案：	int i,j,n;
	for(i=m+1,n=0;n<k;i++)    
	{	
		for(j=2;j<i;j++)     
			if(i%j==0) 
				break;
			if(j>=i)           
				xx[n++]=i;
	}

第142题 （10.0分）        题号:142        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写一个函数int fun(int *s，int t，int *k)，用来求出数组的最大元素在
      数组中的下标并存放在k所指向的存储单元中。

例如：输入如下整数：876 675 896 101 301 401 980 431 451 777则输出结果为6,980。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <conio.h>
#include <stdio.h>
#include <stdlib.h>

void wwjt();

int fun(int *s,int t,int *k)
{
        /**********Program**********/

                                                                   
        /**********  End  **********/
}
void main()
{
  
        int a[10]={ 876,675,896,101,301,401,980,431,451,777},k;
        system("CLS");
        fun(a, 10, &k);
        printf("%d, %d\n ", k, a[k]);
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int a[10],k,i;        

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<10;i++)
        {
                fscanf(in,"%d",&a[i]);
        }
        fun(a, 10, &k);
        fprintf(out,"%d, %d\n ", k, a[k]);
        fclose(in);
        fclose(out);
}

答案：	int i;
	*k=0;                                                                          
	for(i=0;i<t;i++)
		if(s[*k]<s[i])
			*k=i;                           
	return s[*k];  

第143题 （10.0分）        题号:143        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，其功能是：计算并输出下列多项式的值。 
      S＝1/(1×2)＋1/(2×3)＋…＋1/(n×(n＋1))

例如：当n＝10时，函数值为0.909091。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include<conio.h>
#include<stdio.h>
#include<stdlib.h>

void wwjt();

double fun(int n)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{ 
        system("CLS");
        printf("%f\n",fun(10));
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int i,n;
        double s;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0; i<10; i++)
        {
                fscanf(in,"%d",&n);
                s=fun(n);
                fprintf(out,"%f\n",s);
        }
        fclose(in);
        fclose(out);
}

答案：	int i;
	double s=0.0;
	for(i=1;i<=n;i++)
		s=s+1.0/(i*(i+1));    /*求级数的和*/
	return s;

第144题 （10.0分）        题号:144        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，它的功能是计算下列级数和，和值由函数值返回。
      如“样张”所示。

例如：当n＝10，x＝0.3时，函数值为1.349859。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include<conio.h>
#include<stdio.h>
#include<math.h>
#include<stdlib.h>

void wwjt();

double fun(double x, int n)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{ 
        system("CLS");
        printf("%f ",fun(0.3,10));
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int i,n;
        double x, s;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0; i<6; i++)
        {
                fscanf(in,"%lf",&x);
                fscanf(in,"%d",&n);
                s=fun(x,n);
                fprintf(out,"%f\n",s);
        }
        fclose(in);
        fclose(out);
}

答案：	int i;
	double s=1.0,s1=1.0;
	for(i=1;i<=n;i++)
	{
		s1=s1*i;                                                                              
		s=s+pow(x,i)/s1;                                                                    
	}
	return s;

第145题 （10.0分）        题号:145        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，其功能是：移动字符串中的内容，移动的规则是把第1～m个字符，
      平移到字符串的最后，把第m＋1到最后的字符移到字符串的前部。

例如：字符串中原有的内容为"ABCDEFGHIJK"，m的值为3，移动后，字符串中的内容应该
      是"DEFGHIJKABC"。

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>

#define   N    80

void wwjt();

void fun (char  *w,int  m)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{

        char  a[N]= "ABCDEFGHIJK";
        int  m;
        printf("The origina string :\n");
        puts(a);
        printf("\n\nEnter  m: ");
        scanf("%d",&m);
        fun(a,m);
        printf("\nThe string after moving :\n");
        puts(a);
        printf("\n\n");
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        char  b[N]= "ABCDEFGHIJK";
        int  i, n;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0; i<5; i++)
        {
                fscanf(in,"%d",&n);
                fun(b,n);
                fprintf(out,"%s\n",b);
        }
        fclose(in);
        fclose(out);
}

答案：	int i,j;
	char t;
	for(i=1;i<=m;i++)                                                                
	{
		t=w[0];
		for(j=1;w[j]!='\0';j++)                     
			w[j-1]=w[j];
		w[j-1]=t;                                                          
	}

第146题 （10.0分）        题号:146        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，该函数的功能是：统计各年龄段的人数。N个年龄通过调用随机
      函数获得，并放入主函数的age数组中。

      要求函数把0～9岁年龄段的人数放在d[0]中，把10～19岁年龄段的人数放在d[1]中，
      把20～29岁年龄段的人数放在d[2]中，依此类推，把100岁(含100岁)以上年龄的人
      数都放在d[10]中。结果在主函数中输出。

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
# define N  50
# define M  11

void wwjt();

void fun(int *a,  int *b)
{
        /**********Program**********/

                            
        /**********  End  **********/
}
double  rnd()
{
        static t=29,c=217,m=1024,r=0;
        r=(r*t+c)%m;  
        return((double)r/m);
}
void main()
{ 

        int age[N], i,d[M];
        for(i=0; i<N; i++)  
                age[i]=(int)(115*rnd());     /*产生一个随机的年龄数组*/
        printf("The original data :\n");
        for(i=0; i<N; i++)  
                printf((i+1)%10==0? "%4d\n":"%4d",age[i]);   /*每行输出10个数*/
        printf("\n\n");
        fun(age,d);
        for(i=0; i<10; i++)  
                printf("%4d---%4d  :%4d\n", i*10, i*10+9,d[i]);
        printf("Over 100  :  %4d\n",d[10]);
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        int b[N],i,d[M],c[N]={0};

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0; i<N; i++)
        {
                fscanf(in,"%d",&b[i]);
                c[i]=b[i];
        }

        fun(c,d);
        for(i=0; i<10; i++)  
                fprintf(out,"%4d---%4d  :%4d\n", i*10, i*10+9,d[i]);
        fprintf(out,"Over 100  :  %4d",d[10]);
        fclose(in);
        fclose(out);
}


答案：	int i,j;
	for(j=0;j<M;j++)
		b[j]=0;	                                                                        
	for(i=0;i<N;i++)
		if(a[i]>=100) 
			b[10]++;                                                  
		else 
			b[a[i]/10]++;   

第147题 （10.0分）        题号:147        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，该函数的功能是：统计各年龄段的人数。N个年龄通过调用随机
      函数获得，并放入主函数的age数组中。

      要求函数把0～9岁年龄段的人数放在d[0]中，把10～19岁年龄段的人数放在d[1]中，
      把20～29岁年龄段的人数放在d[2]中，依此类推，把100岁(含100岁)以上年龄的人
      数都放在d[10]中。结果在主函数中输出。

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>

#define N 80

void wwjt();

int fun(char *str)
{
        /**********Program**********/


        /**********  End  **********/
}

void main()
{
        char s[N];
        printf("Enter a string : ");
        gets(s);
        printf("\n\n");
        puts(s);
        if(fun(s))
                printf("YES\n");
        else
                printf("NO\n"); 
        wwjt();

}
void wwjt()
{
        FILE *in, *out;
        char c[N][N];
        int i;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<5;i++ )
        {
                fscanf(in,"%s",&c[i]);        
                if(fun(c[i]))
                        fprintf(out,"YES\n");
                else
                        fprintf(out,"NO\n");
        }
        fclose(in);
        fclose(out);
}

答案：	int i,n=0,fg=1;
	char *p=str;
	while (*p)                                                  
	{
		n++;
		p++;
	}
	for(i=0;i<n/2;i++)                                                                 
		if(str[i]==str[n-1-i]) ;		                                         
		else                                                                         
		{
			fg=0;
			break;
		}
	return fg;

第148题 （10.0分）        题号:148        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写一个函数，用来删除字符串中的所有空格。

例如：输入asd af aa z67，则输出为asdafaaz67。

注意：请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。

-------------------------------------------------------*/
#include <stdio.h>
#include <ctype.h>
#include <conio.h>
#include <stdlib.h>
#include <string.h>

void wwjt();

void fun (char *str)
{
        /**********Program**********/

                                                                        
        /**********  End  **********/
}
void main()
{
        char str[81];
        char Msg[]="Input a string:";
        printf(Msg);
        gets(str);
        puts(str);
        fun(str); 
        printf("*** str: %s\n",str); 
        wwjt();
}
void wwjt()
{
        FILE *in, *out;

        char s[81];
        int i;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<3;i++)
        {
                fgets(s,81,in);
                fun(s);
                fprintf(out,"%s",s);
        }

        fclose(in);
        fclose(out);
}

答案：	int i=0;
	char *p=str;
	while(*p)
	{
		if(*p!=' ')                                                                         
		{
			str[i]=*p;
			i++;
		}
		p++;
	}
	str[i]='\0';   

第149题 （10.0分）        题号:149        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，该函数的功能是：统计一行字符串中单词的个数，作为函数值返回。
      字符串在主函数中输入，规定所有单词由小写字母组成，单词之间有若干个空格隔
      开，一行的开始没有空格。

注意：请勿改动main函数和其他函数中的任何内容，仅在函数fun的花括号中填入
      所编写的若干语句。

-------------------------------------------------------*/
#include <string.h>
#include <stdio.h>

#define N 80

void wwjt();

int fun(char *s)
{
        /**********Program**********/


        /**********  End  **********/
}
void main()
{ 
        char line[N]; 
        int num=0;
        printf("Enter a string:\n "); 
        gets(line);
        num=fun(line);
        printf("The number of word is:%d\n\n ",num);
        wwjt();
}
void wwjt()
{
        FILE *in, *out;
        char line[N]; 
        int i,num=0;

        in=fopen("in.dat","r");
        if(in==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        out=fopen("out.dat","w");
        if(out==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(i=0;i<3;i++)
        {
                fgets(line,80,in);
                num=fun(line);
                fprintf(out,"%d\n",num);
        }
        fclose(in);
        fclose(out);
}

答案：	int i,j=0;
	for(i=0;s[i]!='\0';i++)
		if(s[i]!=' '&&(s[i+1]==' '||s[i+1]=='\0'))   
			j++;
	return j;  
        

第150题 （10.0分）        题号:150        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：计算并输出给定整数n的所有因子之和（不包括1与
      自身）。
注意：n的值不大于1000。
例如：n的值为855时，应输出704。

------------------------------------------------*/

#include <stdio.h>
void wwjt();
   
int fun(int n)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  printf("s=%d\n",fun(855));
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int iIN,iOUT,i;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<5;i++)
  {
    fscanf(IN,"%d",&iIN);
    iOUT=fun(iIN);
    fprintf(OUT,"%d\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int s=0,i;
   for(i=2;i<n;i++)
    if(n%i==0)s=s+i;
     return s;
----------------------

第151题 （10.0分）        题号:151        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：计算n门课程的平均值，计算结果作为函数值返回。
例如：若有5门课程的成绩是：92，76，69，58，88，
      则函数的值为76.600000。

------------------------------------------------*/
  
#include <stdio.h>
void wwjt();
   
float fun(int a[],int n)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  int a[]={92,76,69,58,88};
  printf("y=%f\n",fun(a,5));
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int iIN[10],i,j;
  float fOUT;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(j=0;j<5;j++)
  {    
    for(i=0;i<5;i++)
      fscanf(IN,"%d",&iIN[i]);
    fOUT=fun(iIN,5);
    fprintf(OUT,"%f\n",fOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i;
    float y=0;
    for(i=0;i<n;i++)
     y+=a[i];
     y=y/n;
     return y;
----------------------

第152题 （10.0分）        题号:152        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：调用函数fun判断一个三位数是否"水仙花数"。
      在main函数中从键盘输入一个三位数，并输
      出判断结果。请编写fun函数。
说明：所谓"水仙花数"是指一3位数，其各位数字立方和
      等于该数本身。
例如：153是一个水仙花数，因为153=1+125+27。

------------------------------------------------*/

#include <stdio.h>
void wwjt();
   
int fun(int n)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
  
}

main()
{
  int n,flag;
  scanf("%d",&n);
  flag=fun(n);
  if(flag)
    printf("%d 是水仙花数\n",n);
  else
    printf("%d 不是水仙花数\n",n);
  wwjt();
}
void wwjt()
{
  FILE *IN,*OUT;
  int iIN,i;
  int iOUT;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<10;i++)
  {    
    fscanf(IN,"%d",&iIN);
    iOUT=fun(iIN);
    fprintf(OUT,"%d\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int bw,sw,gw;
bw=n/100;sw=(n-bw*100)/10;gw=n%10;
 if(n==bw*bw*bw+sw*sw*sw+gw*gw*gw) return 1;
 else return 0;
----------------------

第153题 （10.0分）        题号:153        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：从键盘为一维整型数组输入10个整数，调用fun函数
      找出其中最小的数，并在main函数中输出。

------------------------------------------------*/

#include <stdio.h>
 void wwjt();
  
int fun(int x[],int n)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
  
}

main()
{
  int a[10],i,min;
  for(i=0;i<10;i++)
    scanf("%d",&a[i]);
  for(i=0;i<10;i++)
    printf("%3d",a[i]);
  printf("\n");
  min=fun(a,10);
  printf("%d\n",min);
  wwjt();
}
void wwjt()
{
  FILE *IN,*OUT;
  int iIN[10],i;
  int iOUT,iCOUNT;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. It May Be Changed");
  }
  for(i=0;i<5;i++)
  {  
    for(iCOUNT=0;iCOUNT<10;iCOUNT++)
      fscanf(IN,"%d",&iIN[iCOUNT]);
    iOUT=fun(iIN,10);
    fprintf(OUT,"%d\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
 int min,i;
min=x[0];
for(i=1;i<n;i++)
{if(x[i]<min) min=x[i];}
return min;
----------------------

第154题 （10.0分）        题号:154        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：将主函数中输入的字符串反序存放。
例如：输入字符串“abcdefg”，则应输出“gfedcba”。

------------------------------------------------*/
  
#include <stdio.h>
#include <conio.h>
#include <string.h>
#define N 81
void wwjt();
 
void fun(char *str,int n)
{                
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  char s [N];
  int l;
  printf("input a string:");gets(s);
  l=strlen(s);
  fun(s,l);
  printf("The new string is :");puts(s);
  wwjt();
}
void wwjt()
{
  FILE *IN,*OUT;
  char sin[20],*sOUT;
  int iLENGTH;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  fscanf(IN,"%s",sin);
  iLENGTH=strlen(sin);
  sOUT=sin;
  fun(sin,iLENGTH);
  fprintf(OUT,"%s\n",sOUT);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
 int i,j;
 char c;
for(i=0,j=n-1;i<j;i++,j--)                /*或者for(i=0,j=n-1;i<n/2;i++,j--)*/
{c=*(str+i);
*(str+i)=*(str+j);
*(str+j)=c;}
----------------------

第155题 （10.0分）        题号:155        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：统计出若干个学生的平均成绩，最高分以及得最高
      分的人数。
例如：输入10名学生的成绩分别为92，87，68，56，92，
      84，67，75，92，66，则输出平均成绩为77.9，
      最高分为92，得最高分的人数为3人。

------------------------------------------------*/

#include <stdio.h>
void wwjt();
   
float Max=0;
int J=0;

float fun(float array[],int n)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main(  )
{
  float  a[10],ave;
  int i=0;
  for(i=0;i<10;i++)
    scanf("%f",&a[i]);
  ave=fun(a,10);
  printf("ave=%f\n",ave);
  printf("max=%f\n",Max);
  printf("Total:%d\n",J);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  float iIN[10],iOUT;
  int iCOUNT;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(iCOUNT=0;iCOUNT<10;iCOUNT++)
    fscanf(IN,"%f",&iIN[iCOUNT]);
  iOUT=fun(iIN,10);
  fprintf(OUT,"%f %f\n",iOUT,Max);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i;float sum=0,ave;
 Max=array[0];
for(i=0;i<n;i++)
{  if(Max<array [i]) Max=array [i];
        sum=sum+array [i];  }
      ave=sum/n;
     for(i=0;i<n;i++)
 if(array [i]==Max) J++;
return(ave);
----------------------

第156题 （10.0分）        题号:156        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求出N×M整型数组的最大元素及其所在的行坐标及
      列坐标（如果最大元素不唯一，选择位置在最前面
      的一个）。
例如：输入的数组为:
                   1   2   3
                   4   15  6
                   12  18  9
                   10  11  2

      求出的最大数为18,行坐标为2，列坐标为1。

------------------------------------------------*/

#define N 4
#define M 3
#include <stdio.h>
void wwjt();
     
int Row,Col;

int fun(int array[N][M])
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  int a[N][M],i,j,max;
  printf("input a array:");
  for(i=0;i<N;i++)
    for(j=0;j<M;j++)
      scanf("%d",&a[i][j]);
    for(i=0;i<N;i++)
    {
      for(j=0;j<M;j++)
        printf("%d",a[i][j]);
      printf("\n");
    }
    max=fun(a);
    printf("max=%d,row=%d,col=%d",max,Row,Col);
    wwjt();
}


void wwjt()
{
  FILE *IN,*OUT;
  int iIN[N][M],iOUT,i,j;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<N;i++)
    for(j=0;j<M;j++)
      fscanf(IN,"%d",&iIN[i][j]);
    iOUT=fun(iIN);
    fprintf(OUT,"%d %d %d\n",iOUT,Row,Col);
    fclose(IN);
    fclose(OUT);
}

答案：----------------------
int max,i,j;
max=array [0][0];
Row=0;
Col=0;
for(i=0;i<N;i++)
  {for(j=0;j<M;j++)
   if(max<array [i][j])
    {max=array [i][j];
     Row=i;
Col=j;}
}
return(max);
----------------------

第157题 （10.0分）        题号:157        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：输入一个字符串，过滤此串，只保留串中的字母字
      符，并统计新生成串中包含的字母个数。
例如：输入的字符串为ab234$df4，新生成的串为abdf 。

------------------------------------------------*/

#include <stdio.h>
#include <conio.h>
#define N 80
void wwjt();
   
fun(char *ptr)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  char str[N];
  int s;
  printf("input a string:");gets(str);
  printf("The origINal string is :"); puts(str);
  s=fun(str);
  printf("The new string is :");puts(str);
  printf("There are %d char IN the new string.",s);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  char sin[N];
  int iOUT;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  fscanf(IN,"%s",sin);
  iOUT=fun(sin);
  fprintf(OUT,"%d %s\n",iOUT,sin);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
 int i,j;
for(i=0,j=0;*(ptr+i)!='\0';i++)
if(*(ptr+i)<='z'&& *(ptr+i)>='a'||*(ptr+i)<='Z' && *(ptr+i)>='A')
{*(ptr+j)=*(ptr+i);
j++;}
*(ptr+j)='\0';
return(j);
----------------------

第158题 （10.0分）        题号:158        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：判断m是否为素数。

------------------------------------------------*/

#include "stdio.h"
void wwjt();
  
int fun(int m)
{
  
  /**********Program**********/


  
  /**********  End  **********/
  
}

main()
{
  int m,k=0;
  for(m=100;m<200;m++)
    if(fun(m))
    {
      printf("%4d",m);
      k++;
      if(k%5==0)
        printf("\n");
    }
    printf("k=%d\n",k);
    wwjt();
}


void wwjt()
{
  FILE *IN,*OUT;
  int iIN,iOUT,i;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..It May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. It May Be Changed");
  }
  for(i=0;i<10;i++)    
  {    
    fscanf(IN,"%d",&iIN);
    iOUT=fun(iIN);
    fprintf(OUT,"%d\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
} 

答案：---------------------- 
int i,k=1;
    if(m<=1) k=0;
    for(i=2;i<m;i++)
     if(m%i==0) k=0;
    return k;
----------------------

第159题 （10.0分）        题号:159        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：在键盘上输入一个3行3列矩阵的各个元素的值（值
      为整数），然后输出主对角线元素的积,并在fun()
      函数中输出。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
  
main()
{ 
  int i,j,s,a[3][3];;
  for(i=0;i<3;i++)
  {
    for(j=0;j<3;j++)
      scanf("%d",&a[i][j]);
  }
  s=fun(a);
  printf("Sum=%d\n",s);
  wwjt();
}


int fun(int a[3][3])
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

void wwjt()
{
  FILE *IN,*OUT;
  int m;
  int n;
  int i[3][3];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(m=0;m<3;m++)
  {
    for(n=0;n<3;n++)
      fscanf(IN,"%d",&i[m][n]);
  }
  o=fun(i);
  {   
    fprintf(OUT,"%d\n",o);
    getch();
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int sum;
int i,j;
sum=1;

for(i=0;i<3;i++)
 sum=sum*a[i][i];
 return sum;
----------------------

第160题 （10.0分）        题号:160        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数fun其功能是：根据整型形参m，计算如下
      公式的值：y=1/2!+1/4!+…+1/m!（m是偶数）

------------------------------------------------*/

#include <stdio.h>
void wwjt();

double fun(int m)   
{
  /**********Program**********/
  
  
  
  
  
  /**********  End  **********/
}

main()   
{
  int n;   

  printf("Enter n: ");   
  scanf("%d", &n);   
  printf("\nThe result is %1f\n", fun(n));
  wwjt();  
}   

void wwjt()
{
  FILE *IN,*OUT;
  int t;
  double o;
  int c;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(c=1;c<=5;c++)
  {  
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%f\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：double y=0.0;
int i,j;
double s=1;
for (i=2;i<=m;i+=2)
{
for(j=i-1;j<=i;j++)
s=s*j;
y=y+1.0/s;
}
return y;

第161题 （10.0分）        题号:161        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：判断一个整数w的各位数字平方之和能否被5整除，
      可以被5整除则返回1，否则返回0。

------------------------------------------------*/

#include <stdio.h>
#include"conio.h"
void  wwjt(); 
  
int fun(int w)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()   
{
  int m;
  printf("Enter m: ");
  scanf("%d", &m);
  printf("\nThe result is %d\n", fun(m));
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int c ;
  int t;
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  } for(c=1;c<=5;c++)
  { 
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%d\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int k,s=0;
 do
 {s=s+(w%10)*(w%10);
  w=w/10;
  }while(w!=0);
 if(s%5==0)k=1;
 else k=0;
 return(k);
----------------------

第162题 （10.0分）        题号:162        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求1到w之间的奇数之和。（w是大于等于100小于等
      于1000的整数）

------------------------------------------------*/

#include <stdio.h>
#include"conio.h"
void  wwjt(); 
  
long fun(int w)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()   
{
  int m;
  printf("Enter m: ");
  scanf("%d", &m);
  printf("\nThe result is %ld\n", fun(m));
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int c ;
  int t;
  long o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  } 
  for(c=1;c<=5;c++)
  { 
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%ld\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
long   y=0;
    int i;
    for(i=1;i<=w;i++)
     if(i%2==1)y+=i;
     return y;
----------------------

第163题 （10.0分）        题号:163        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：能计算从1开始到n的自然数中偶数的平方的和，n由
      键盘输入，并在main()函数中输出。（n是偶数）

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
  
int fun(int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()   
{
  int m;
  printf("Enter m: ");
  scanf("%d", &m);
  printf("\nThe result is %d\n", fun(m));
  wwjt();
}   

void wwjt()
{
  FILE *IN,*OUT;
  int t;
  int o;
  int c;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(c=1;c<=5;c++)
  { 
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%d\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int sum,i;
sum =0;
for(i=2;i<=n;i=i+2)
{
sum=sum+i*i;}
return(sum);
----------------------

第164题 （10.0分）        题号:164        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：在键盘上输入一个3行3列矩阵的各个元素的值（值
      为整数），然后输出主对角线元素的平方和,并在
      fun()函数中输出。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
  
main()
{ 
  int i,j,s,a[3][3];;
  for(i=0;i<3;i++)
  {
    for(j=0;j<3;j++)
      scanf("%d",&a[i][j]);
  }
  s=fun(a);
  printf("Sum=%d\n",s);
  wwjt();
}

int fun(int a[3][3])
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

void wwjt()
{
  FILE *IN,*OUT;
  int m;
  int n;
  int i[3][3];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(m=0;m<3;m++)
  {
    for(n=0;n<3;n++)
      fscanf(IN,"%d",&i[m][n]);
  }
  o=fun(i);
  {   
    fprintf(OUT,"%d\n",o);
    getch();
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int sum;
int i;
sum=0;

for(i=0;i<3;i++)
 sum=sum+a[i][i]*a[i][i];
 return sum;
----------------------

第165题 （10.0分）        题号:165        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求一个大于10的n位整数的后n-1位的数，并作为函
      数值返回。

------------------------------------------------*/

#include <stdio.h>
#include"conio.h"
void  wwjt(); 
  
int fun(int w)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()   
{
  int m;
  printf("Enter m: ");
  scanf("%d", &m);
  printf("\nThe result is %d\n", fun(m));
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int c ;
  int t;
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  } 
  for(c=1;c<=5;c++)
  { 
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%d\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int n=0;int i=1;
while(w>10)
{n=n+i*(w%10);
w/=10;
i*=10;}
return n;
----------------------

第166题 （10.0分）        题号:166        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：能计算从1开始到n的自然数的和，n由键盘输入，
      并在main()函数中输出。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
  
int fun(int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()   
{
  int m;
  printf("Enter m: ");
  scanf("%d", &m);
  printf("\nThe result is %d\n", fun(m));
  wwjt();
}   

void wwjt()
{
  FILE *IN,*OUT;
  int t;
  int o;
  int c;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(c=1;c<=5;c++)
  { 
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%d\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int sum,i;
sum =0;
for(i=1;i<=n;i++)
{sum=sum+i;}
return(sum);
----------------------

第167题 （10.0分）        题号:167        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求k！（k〈13），所求阶乘的值作为函数值返回。
     （要求使用递归）

------------------------------------------------*/

#include <stdio.h>
#include"conio.h"
void  wwjt(); 
  
long fun(int k)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()   
{
  int m;
  printf("Enter m: ");
  scanf("%d", &m);
  printf("\nThe result is %ld\n", fun(m));
  wwjt();
}   

void wwjt()
{
  
  FILE *IN,*OUT;
  int s ;
  int t;
  long o;
  
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  } 
  for(s=1;s<=5;s++)
  {
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%ld\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
if (k>0)
return(k*fun(k-1));
else if(k==0)
return 1L;
----------------------

第168题 （10.0分）        题号:168        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：对某一正数的值保留2位小数，并对第三位进行四舍
      五入。

------------------------------------------------*/

#include <stdio.h>
#include"conio.h"
void  wwjt(); 
  
double fun(float h)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()   
{
  float  m;
  printf("Enter m: ");
  scanf("%f", &m);
  printf("\nThe result is %8.2f\n", fun(m));
  wwjt();
}   

void wwjt()
{
  FILE *IN,*OUT;
  int s ;
  float t;
  double o;
  
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  } 
  for(s=1;s<=5;s++)
  { 
    fscanf(IN,"%f",&t);
    o=fun(t);
    fprintf(OUT,"%8.2f\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i;
i=(int)(h*1000)%10;
if(i>=5)
return(int)(h*100+1)/100.0;
else
return(int)(h*100)/100.0;
----------------------

第169题 （10.0分）        题号:169        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：计算出k以内最大的10个能被13或17整除的自然数之
      和。（k〈3000）。

------------------------------------------------*/

#include <stdio.h>
#include"conio.h"
void  wwjt(); 
  
int fun(int k)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()   
{
  int  m;
  printf("Enter m: ");
  scanf("%d", &m);
  printf("\nThe result is %d\n", fun(m));
  wwjt();
}   

void wwjt()
{
  FILE *IN,*OUT;
  int s ;
  int t;
  int o;
  
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  } 
  for(s=1;s<=5;s++)
  { 
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%d\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int a=0,b=0;
while((k>=2)&&(b<10))
{if((k%13==0)||(k%17==0))
  {a=a+k;b++;}
  k--;
     }
     return a;
----------------------

第170题 （10.0分）        题号:170        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：找出一个大于给定整数且紧随这个整数的素数，并
      作为函数值返回。

------------------------------------------------*/

#include <stdio.h>
#include"conio.h"
void  wwjt(); 
  
int fun(int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()   
{
  int  m;
  printf("Enter m: ");
  scanf("%d", &m);
  printf("\nThe result is %d\n", fun(m));
  wwjt();
}   

void wwjt()
{
  FILE *IN,*OUT;
  int s ;
  int t;
  int o;
  
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  } 
  for(s=1;s<=5;s++)
  {
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%d\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i,k;
for(i=n+1;;i++){
for(k=2;k<i;k++)
if(i%k==0)
break;
if(k==i)
return(i);
    }
----------------------

第171题 （10.0分）        题号:171        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：根据整型参数n，计算如图公式的值。

------------------------------------------------*/

#include <stdio.h>
#include"conio.h"
void  wwjt(); 
    
double fun(int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()   
{
  int  m;
  printf("Enter m: ");
  scanf("%d", &m);
  printf("\nThe result is %f\n", fun(m));
  wwjt();
}   

void wwjt()
{
  FILE *IN,*OUT;
  int s ;
  int t;
  double o;
  
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  } 
  for(s=1;s<=5;s++)
  { 
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%f\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
double a=1;int i;
for(i=1;i<n;i++)
a=1.0/(1+a);
return a;
----------------------

第172题 （10.0分）        题号:172        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：计算并输出给定整数的所有因子之积（包括自身）。
      规定这个整数的值不大于50。

------------------------------------------------*/

#include <stdio.h>
#include"conio.h"
void  wwjt(); 
  
long int fun(int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()   
{
  int  m;
  printf("Enter m: ");
  scanf("%d", &m);
  printf("\nThe result is %ld\n", fun(m));
  wwjt();
}   

void wwjt()
{
  FILE *IN,*OUT;
  int s ;
  int t;
  long int o;
  
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  } 
  for(s=1;s<=5;s++)
  { 
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%ld\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
 long  s=1,i;

   for(i=2;i<=n;i++)
    if(n%i==0)s=s*i;

     return s;
----------------------

第173题 （10.0分）        题号:173        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求给定正整数n以内的素数之积。（n<28）

------------------------------------------------*/

#include <stdio.h>
#include"conio.h"
void  wwjt(); 
  
long fun(int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()   
{
  int  m;
  printf("Enter m: ");
  scanf("%d", &m);
  printf("\nThe result is %ld\n", fun(m));
  wwjt();
}   

void wwjt()
{
  FILE *IN,*OUT;
  int c ;
  int t;
  long o;
  
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  } 
  for(c=1;c<=5;c++)
  { 
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%ld\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
long i,k;
long s=1;
   for(i=2;i<=n;i++)
     {for(k=2;k<i;k++)
      if(i%k==0)break;
      if(k==i)s=s*i;
     }
return s;
----------------------

第174题 （10.0分）        题号:174        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求一个n位自然数的各位数字的积。（n 是小于10的
      自然数）

------------------------------------------------*/

#include <stdio.h>
#include"conio.h"
void  wwjt(); 
  
long fun(long n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()   
{
  long  m;
  printf("Enter m: ");
  scanf("%ld", &m);
  printf("\nThe result is %ld\n", fun(m));
  wwjt();
}   

void wwjt()
{
  
  FILE *IN,*OUT;
  int c ;
  long t;
  long o;
  
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  } 
  for(c=1;c<=5;c++)
  {
    fscanf(IN,"%ld",&t);
    o=fun(t);
    fprintf(OUT,"%ld\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
long d,s=1;
   while (n>0)
    {d=n%10;
    s*=d;
     n/=10;
     }
     return s;
----------------------

第175题 （10.0分）        题号:175        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：从字符串中删除指定的字符。同一字母的大、小写
      按不同字符处理。
例如：若程序执行时输入字符串为：turbocandborlandc++
      从键盘上输入字符：n，则输出后变为：turbocadbo
      rladc++，如果输入的字符在字符串中不存在，则字
      符串照原样输出。 

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
  
int fun(char s[],int c)
{
  /**********Program**********/  
  
  
  
  
  
  /**********  End  **********/    
  
}     
main()     
{     
  static char str[]="turbocandborlandc++";
  char ch;     
  printf("原始字符串:%s\n", str);     
  printf("输入一个字符:");     
  scanf("%c",&ch);     
  fun(str,ch);     
  printf("str[]=%s\n",str);
  wwjt();     
} 

void wwjt()
{
  FILE *IN,*OUT;
  char i[200];
  char o[200];
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  fscanf(IN,"%s",i);
  fun(i,'n');
  fprintf(OUT,"%s",i);
  fclose(IN);
  fclose(OUT);
}

答案：---------------------- 
char *q=s;     
for(; *q; q++)     
if(*q != c) *(s++)=*q;     
*s=0;
----------------------

第176题 （10.0分）        题号:176        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：将两个两位数的正整数a、b合并形成一个整数放在
      c中。合并的方式是：将a数的十位和个位数依次放
      在c数的百位和个位上， b数的十位和个位数依次放
      在c数的十位和千位上。     
例如：当a＝45，b=12。调用该函数后，c=2415。  

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
  
void fun(int a, int b, long *c)     
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()     
{
  int a,b; long c;     
  printf("input a, b:");     
  scanf("%d%d", &a, &b);     
  fun(a, b, &c);     
  printf("The result is: %ld\n", c);
  wwjt();     
}    
 
void wwjt ( )     
{  
  FILE *rf, *wf ;     
  int i, a,b ; long c ;     
  rf = fopen("in.dat", "r") ;     
  wf = fopen("out.dat","w") ;     
  for(i = 0 ; i < 10 ; i++) 
  {     
    fscanf(rf, "%d,%d", &a, &b) ;     
    fun(a, b, &c) ;     
    fprintf(wf, "a=%d,b=%d,c=%ld\n", a, b, c) ;     
  }     
  fclose(rf) ;     
  fclose(wf) ;     
}

答案：----------------------
*c=a/10*100+a%10+b/10*10+b%10*1000;
----------------------

第177题 （10.0分）        题号:177        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写程序，实现矩阵（3行3列）的转置（即行列互换）   
例如：输入下面的矩阵： 
       100 200 300     
       400 500 600     
       700 800 900 
      程序输出：   
      100 400 700     
      200 500 800
      300 600 900     

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
          
int fun(int array[3][3])     
{
  /**********Program**********/   
  
  
  
  
  
  /**********  End  **********/
}     
main()     
{     
  int i,j;     
  int array[3][3]={{100,200,300},     
  {400,500,600},     
  {700,800,900}};     
  for (i=0; i < 3; i++)     
  {
    for (j=0; j < 3; j++)     
      printf("%7d",array[i][j]);     
    printf("\n");     
  }     
  fun(array);     
  printf("Converted array:\n");     
  for (i=0; i < 3; i++)     
  { 
    for (j=0; j < 3; j++)     
      printf("%7d",array[i][j]);     
    printf("\n");
  }
  wwjt();     
} 
    
void wwjt()     
{     
  int i,j, array[3][3];     
  FILE *rf, *wf ;     
  rf = fopen("in.dat", "r") ;
  wf = fopen("out.dat", "w") ;
  for (i=0; i < 3; i++)     
    for (j=0; j < 3; j++)     
      fscanf(rf, "%d", &array[i][j]);     
    fun(array);     
    for (i=0; i < 3; i++)     
    { 
      for (j=0; j < 3; j++)     
        fprintf(wf, "%7d", array[i][j]);     
      fprintf(wf, "\n");     
    }     
    fclose(rf) ;     
    fclose(wf) ;     
}

答案：----------------------
int i,j,t;     
for(i=0; i < 3; i++)     
for(j=0; j < i; j++)     
{ t=array[i][j];     
array[i][j]=array[j][i];     
array[j][i]=t; }     
----------------------

第178题 （10.0分）        题号:178        难度:难        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：判断整数x是否是同构数。若是同构数，函数返回1；
      否则返回0。x的值由主函数从键盘读入，要求不大
      于100。
说明：所谓“同构数”是指这样的数，这个数出现在它的
      平方数的右边。
例如：输入整数5，5的平方数是25，5是25中右侧的数，所
      以5是同构数。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
  
int fun(int x)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}
main()
{
  int x,y;
  printf("\nPlease enter a integer numbers:");
  scanf("%d",&x);
  if(x>100)
  {
    printf("data error!\n");
    exit(0);
  }
  y=fun(x);
  if(y) 
    printf("%d YES\n",x);
  else 
    printf("%d NO\n",x);
  wwjt();
  
}
void wwjt()
{
  FILE *IN,*OUT;
  int n,t;
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(t = 0 ; t < 5 ; t++)
  {
    fscanf(IN, "%d", &n) ;
    o=fun(n);
    fprintf(OUT, "%d\n",o ) ;
  }     
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
  int k;
  k=x*x;
  if((k%10==x)||(k%100==x))
   return 1;
  else
   return 0;
----------------------

第179题 （10.0分）        题号:179        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写一个函数，该函数可以统计一个长度为2的字符
      串在另一个字符串中出现的次数。
例如：假定输入的字符串为：asdasasdfgasdaszx67asdmklo，
      字符串为：as,则应输出6。

------------------------------------------------*/

#include<stdio.h>
#include<string.h>
#include<conio.h>
void  wwjt(); 
  
int fun(char *str,char *substr)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  char str[81],substr[3];
  int n;
  printf("输入主字符串： ");
  gets(str);
  printf("输入子字符串： ");
  gets(substr);
  puts(str);
  puts(substr);
  n=fun(str,substr);
  printf("n=%d\n",n);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  char i[200];
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  fscanf(IN,"%s",i);
  n=fun(i,"as");
  fprintf(OUT,"%d",n);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
 int i,n=0;
 for(i=0;i<=strlen(str)-2;i++)
    if((str[i]==substr[0])&&(str[i+1]==substr[1]))
     n++;
 return n;
----------------------

第180题 （10.0分）        题号:180        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：删除所有值为y的元素。数组元素中的值和y的值由
      主函数通过键盘输入。

------------------------------------------------*/

#include <stdio.h>
#include<conio.h>
#include<stdio.h>
#define M 20
void  wwjt(); 
  
void fun(int bb[],int *n,int y)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}
main()
{
  int aa[M],n,y,k;
  printf("\nPlease enter n:");scanf("%d",&n);
  printf("\nEnter %d positive number:\n",n);
  for(k=0;k<n;k++) scanf("%d",&aa[k]);
  printf("The original data is:\n");
  for(k=0;k<n;k++) printf("%5d",aa[k]);
  printf("\nEnter a number to deletede:");scanf("%d",&y);
  fun(aa,&n,y);
  printf("The data after deleted %d:\n",y);
  for(k=0;k<n;k++) printf("%4d",aa[k]);
  printf("\n");
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[10];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<10;n++)
  {   
    fscanf(IN,"%d",&i[n]);
  }
  fun(i,&n,3);
  for(o=0;o<n;o++)
  {   
    fprintf(OUT,"%d\n",i[o]);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
 int i,j;
 for(i=0;i<*n;)
   {
    if(bb[i]==y)
       {for(j=i;j<*n;j++)
           bb[j]=bb[j+1];
         *n=*n-1;
          }
          else
           i++;
          }
----------------------

第181题 （10.0分）        题号:181        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：在键盘上输入一个3行3列矩阵的各个元素的值（值
      为整数），然后输出矩阵第一行与第三行元素之和，
      并在fun()函数中输出。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

void fun(int a[3][3])
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  int i,j,s,a[3][3];
  for(i=0;i<3;i++)
  {
    for(j=0;j<3;j++)
      scanf("%d",&a[i][j]);
  }
  s=fun(a);
  printf("Sum=%d\n",s);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int m;
  int n;
  int i[3][3];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(m=0;m<3;m++)
  {
    for(n=0;n<3;n++)
      fscanf(IN,"%d",&i[m][n]);
  }
  o=fun(i);
  {   
    fprintf(OUT,"%d\n",o);
    getch();
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int sum;
int i,j;
sum=0;

for(i=0;i<3;i+=2)
for(j=0;j<3;j++)
 sum=sum+a[i][j];
 return sum;
----------------------

第182题 （10.0分）        题号:182        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：将两个两位数的正整数a、b合并形成一个整数放在c
      中。合并的方式是： 将a数的十位和个位数依次放
      在c数的个位和百位上, b数的十位和个位数依次放
      在c数的十位和千位上。     
例如： 当a=45，b=12， 调用该函数后， c=2514。
     
------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
 
void fun(int a, int b, long *c)     
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()     
{ 
  int a,b; long c;     
  printf("input a, b:");     
  scanf("%d%d", &a, &b);     
  fun(a, b, &c);     
  printf("The result is: %ld\n", c);
  wwjt();     
}  

void wwjt( )     
{  
  FILE *rf, *wf ;     
  int i, a,b ; long c ;     
  rf = fopen("in.dat", "r") ;     
  wf = fopen("out.dat","w") ;     
  for(i = 0 ; i < 10 ; i++) 
  {     
    fscanf(rf, "%d,%d", &a, &b) ;     
    fun(a, b, &c) ;     
    fprintf(wf, "a=%d,b=%d,c=%ld\n", a, b, c) ;     
  }     
  fclose(rf) ;     
  fclose(wf) ;     
}

答案：----------------------
*c=a/10+a%10*100+b/10*10+b%10*1000;  
----------------------

第183题 （10.0分）        题号:183        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：将两个两位数的正整数a、b合并形成一个整数放在c
      中。合并的方式是：将a数的十位和个位数依次放在
      c数的千位和十位上， b数的十位和个位数依次放在
      c数的个位和百位上。     
例如：当a＝45，b=12。调用该函数后，c=4251。  
 
------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
  
void fun(int a, int b, long *c)     
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}
     
main()     
{ 
  int a,b;
  long c;     
  printf("input a, b:");     
  scanf("%d%d", &a, &b);     
  fun(a, b, &c);     
  printf("The result is: %ld\n", c);
  wwjt();     
}    

void wwjt ( )     
{  
  FILE *rf, *wf ;     
  int i, a,b ; 
  long c ;     
  rf = fopen("in.dat", "r") ;     
  wf = fopen("out.dat","w") ;     
  for(i = 0 ; i < 10 ; i++) 
  {     
    fscanf(rf, "%d,%d", &a, &b) ;     
    fun(a, b, &c) ;     
    fprintf(wf, "a=%d,b=%d,c=%ld\n", a, b, c) ;     
  }     
  fclose(rf) ;     
  fclose(wf) ;     
}

答案：----------------------
*c=a/10*1000+a%10*10+b/10+b%10*100;
----------------------  

第184题 （10.0分）        题号:184        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：将从键盘上输入的每个单词的第一个字母转换为
      大写字母，输入时各单词必须用空格隔开，用’.’
      结束输入。 

------------------------------------------------*/

#include <stdio.h>
#include "string.h"
void  wwjt(); 

int fun(char *c,int status)     
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/     
}     
main()     
{     
  int flag=1;     
  char ch;     
  printf("请输入一字符串，用点号结束输入!\n") ;     
  do     
  {     
    ch=getchar();     
    flag=fun(&ch, flag);     
    putchar(ch);     
  }while(ch!='.');
  printf("\n");
  wwjt();     
}     
void wwjt( )     
{     
  char s1[81], ch;     
  unsigned int i, flag = 1;     
  FILE *rf, *wf ;     
  rf = fopen("in.dat", "r") ;
  wf = fopen("out.dat", "w") ;
  fgets(s1, 80, rf) ;     
  for(i = 0 ; i < strlen(s1); i++) 
  {     
    ch = s1[i] ;     
    flag = fun(&ch, flag) ;     
    s1[i] = ch ;     
  }     
  fprintf( wf,"%s", s1 );     
  fclose(rf) ;     
  fclose(wf) ;     
}

答案：----------------------
if (*c== ' ') return 1;
else
{     
if(status && *c <= 'z' && *c >= 'a')
*c += 'A' - 'a';
return 0;
}
----------------------

第185题 （10.0分）        题号:185        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：把20个随机数存入一个数组，然后输出该数组中的
      最小值。其中确定最小值的下标的操作在fun函数中
      实现，请给出该函数的定义。
     
------------------------------------------------*/

#include <stdio.h>
#define VSIZE 20     
void  wwjt(); 
  
int vector[VSIZE] ;     

int fun(int list[],int size)     
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/     
  
} 

main()     
{     
  int i;     
  for (i=0;i<VSIZE;i++)
  {
    vector[i]=rand();     
    printf("Vector[%d]=%6d\n",i,vector[i]);     
  }     
  i=fun(vector,VSIZE);     
  printf("\nMininum: Vector[%d]=%6d\n",i,vector[i]);
  
  wwjt();
}     

void wwjt()     
{     
  int i,t;
  FILE *fp ;     
  fp = fopen("out.dat", "w") ;
  for (i=0;i<VSIZE;i++)
  {
    fprintf(fp,"Vector[%d]=%6d\n",i,vector[i]);
  }     
  t=fun(vector,VSIZE);
  fprintf(fp,"\nMininum: Vector[%d]=%6d\n",t,vector[t]);
  fclose(fp) ;     
}

答案：----------------------
int i,min=0;     
for(i=1; i <size; i++)
if(list[min]>list[i])     
min=i;     
return min;
----------------------

第186题 （10.0分）        题号:186        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：从低位开始取出长整型变量s中偶数位上的数，依次
      构成一个新数放在t中。     
例如：当s中的数为：7654321时，t中的数为：642。
     
------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
  
long fun (long s,long t)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  return t;
}  

main()     
{
  long s, t=0,m;
  printf("\nPlease enter s:"); scanf("%ld", &s);     
  m=fun(s,t);
  printf("The result is: %ld\n", m);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  long i,t=0,m;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<5;n++)
  {   
    fscanf(IN,"%ld",&i);
    m=fun(i,t);
    fprintf(OUT,"%ld\n",m);
    
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
long sl=10;
s /= 10;          
t = s % 10;
while(s > 0)     
{ s = s/100;     
t = s%10*sl + t;
sl = sl * 10;
}
----------------------

第187题 （10.0分）        题号:187        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：从低位开始取出长整型变量s奇数位上的数，依次
      构成一个新数放在t中。     
例如：当s中的数为：7654321时，t中的数为：7531。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

long fun (long s,long t)
{  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  return t;
}  

main()     
{
  long s, t=0,m;
  printf("\nPlease enter s:"); scanf("%ld", &s);     
  m=fun(s,t);
  printf("The result is: %ld\n", m);

  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  long i,t=0,m;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<5;n++)
  {   
    fscanf(IN,"%ld",&i);
    m=fun(i,t);
    fprintf(OUT,"%ld\n",m);
    
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
long sl=10;          
t = s % 10;
while(s > 0)     
{ s = s/100;     
t = s%10*sl + t;
sl = sl * 10;
}
----------------------

第188题 （10.0分）        题号:188        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：请编一个函数void fun(int tt[M][N],int pp[N])，
      tt指向一个M行N列的二维数组，求出二维数组每列
      中最小元素，并依次放入pp所指一维数组中。二维
      数组中的数已在主函数中赋予。

------------------------------------------------*/

#include<conio.h>
#include<stdio.h>
#define M 3
#define N 4
void  wwjt(); 
  
void fun(int tt[M][N],int pp[N])
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  int t[M][N]={{22,45,56,30},
  {19,33,45,38},
  {20,22,66,40}};
  int p[N],i,j,k;
  printf("The original data is:\n");
  for(i=0;i<M;i++)
  {
    for(j=0;j<N;j++)
      printf("%6d",t[i][j]);
    printf("\n");
  }
  fun(t,p);
  printf("\nThe result is:\n");
  for(k=0;k<N;k++) printf("%4d",p[k]);
  printf("\n");
  wwjt();
}
void wwjt()     
{     
  
  int i,j, array[3][4],p[4];
  FILE *rf, *wf ;     
  rf = fopen("in.dat", "r") ;
  wf = fopen("out.dat", "w") ;
  for (i=0; i < 3; i++)     
    for (j=0; j < 4; j++)
      fscanf(rf, "%d", &array[i][j]);     
    fun(array,p);
    for (j=0; j < 4; j++)
      
    {
      fprintf(wf, "%7d", p[j]);
      fprintf(wf, "\n");     
    }     
    fclose(rf) ;     
    fclose(wf) ;     
}

答案：----------------------
 int i,j;
 for(j=0;j<N;j++)
    {
     pp[j]=tt[0][j];
     for(i=1;i<M;i++)
     if(tt[i][j]<pp[j])
       pp[j]=tt[i][j];

       }
----------------------

第189题 （10.0分）        题号:189        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：请编一个函数void fun(int tt[M][N],int pp[N])，
      tt指向一个M行N列的二维数组，求出二维数组每列
      中最大元素，并依次放入pp所指一维数组中。二维
      数组中的数已在主函数中赋予。

------------------------------------------------*/

#include<conio.h>
#include<stdio.h>
#define M 3
#define N 4
void  wwjt(); 
  
void fun(int tt[M][N],int pp[N])
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  int t[M][N]={{22,45,56,30},
  {19,33,45,38},
  {20,22,66,40}};
  int p[N],i,j,k;
  printf("The original data is:\n");
  for(i=0;i<M;i++)
  {
    for(j=0;j<N;j++)
      printf("%6d",t[i][j]);
    printf("\n");
  }
  fun(t,p);
  printf("\nThe result is:\n");
  for(k=0;k<N;k++) printf("%4d",p[k]);
  printf("\n");
  wwjt();
}
void wwjt()     
{     
  int i,j, array[3][4],p[4];
  FILE *rf, *wf ;     
  rf = fopen("in.dat", "r") ;
  wf = fopen("out.dat", "w") ;
  for (i=0; i < 3; i++)     
    for (j=0; j < 4; j++)
      fscanf(rf, "%d", &array[i][j]);     
    fun(array,p);
    for (j=0; j < 4; j++)
    {
      fprintf(wf, "%7d", p[j]);
      fprintf(wf, "\n");     
    }     
    fclose(rf) ;     
    fclose(wf) ;     
}

答案：----------------------
 int i,j;
 for(j=0;j<N;j++)
    {
     pp[j]=tt[0][j];
     for(i=1;i<M;i++)
     if(tt[i][j]>pp[j])
       pp[j]=tt[i][j];

       }
----------------------

第190题 （10.0分）        题号:190        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：根据整型形参m，计算如下公式的值：y=1/2＋1/4＋
      1/6＋...＋1/2m 。
例如：若m=9，则应输出：1.414484

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
  
double fun(int m)   
{
  /**********Program**********/
  
  
  
  
  
  /**********  End  **********/
}

main()   
{
  int n;   
  printf("Enter n: ");   
  scanf("%d", &n);   
  printf("\nThe result is %1f\n", fun(n));
  wwjt();  
}   

void wwjt()
{
  FILE *IN,*OUT;
  int i ;
  int t;
  double o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(i=0;i<5;i++)
  {   
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%f\n",o);
    
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
     double y=0;
     int i;
     for(i=1; i<=m; i++)
     {y+=1.0/(2*i);  }
     return(y);
----------------------

第191题 （10.0分）        题号:191        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：对长度为7个字符的字符串，除首、尾字符外，将其
      余5个字符按降序排列。
例如：原来的字符串为CEAedca,排序后输出为CedcEAa。

------------------------------------------------*/

#include<stdio.h>
#include<ctype.h>
#include<conio.h>
void  wwjt(); 
  
void fun(char *s,int num)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  char s[10];
  printf("输入7个字符的字符串:");
  gets(s);
  fun(s,7);
  printf("\n%s",s);
  wwjt();
}

void wwjt()     
{     
  
  int i;
  char a[100];
  FILE *rf, *wf ;     
  rf = fopen("in.dat", "r") ;
  wf = fopen("out.dat", "w") ;
  for(i=0;i<3;i++)
  {
    fscanf(rf, "%s", &a);
    fun(a,7);
    fprintf(wf, "%s", a);
    fprintf(wf, "\n");
  }
  
  fclose(rf);
  fclose(wf);
}

答案：----------------------
 int i,j;
 char t;
 for(i=1;i<num-1;i++)
    for(j=i+1;j<num-1;j++)
       if(s[i]<s[j])
         { t=s[i];s[i]=s[j];s[j]=t;}
----------------------

第192题 （10.0分）        题号:192        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求小于lim的所有素数并放在aa数组中，该函数返回
      所求出素数的个数。

------------------------------------------------*/

#include<stdio.h>
#include<conio.h>
#define MAX 100
void  wwjt(); 

int fun(int lim,int aa[MAX])
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}
main()
{
  int limit,i,sum;
  int aa[MAX];
  printf("Please input ainteger:");
  scanf("%d",&limit);
  sum=fun(limit,aa);
  for(i=0;i<sum;i++){
    if(i%10==0&&i!=0) printf("\n");
    printf("%5d",aa[i]);
    
  }
  wwjt();
}
void wwjt()     
{     
  int i,j,array[100],sum,lim;
  FILE *rf, *wf ;     
  rf = fopen("in.dat", "r") ;
  wf = fopen("out.dat", "w") ;
  for (j=0; j <= 5; j++)
  {
    fscanf(rf, "%d", &lim);
    sum=fun(lim,array);
    for(i=0;i<sum;i++)
      fprintf(wf, "%7d", array[i]);
    fprintf(wf, "\n");     
  }     
  fclose(rf);
  fclose(wf);
}

答案：----------------------
 int n=0;
 int i,j;
 for(i=2;i<=lim;i++)
    {for(j=2;j<i;j++)
      if(i%j==0) break;
      if(j==i) aa[n++]=i;
     }
     return n;
----------------------

第193题 （10.0分）        题号:193        难度:中        第2章
 /*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：对长度为8个字符的字符串，将8个字符按降序排列。
例如：原来的字符串为CEAedcab,排序后输出为edcbaECA。

------------------------------------------------*/

#include<stdio.h>
#include<ctype.h>
#include<conio.h>
void  wwjt(); 

void  fun(char *s,int num)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}
main()
{
  char s[10];
  printf("输入8个字符的字符串:");
  gets(s);
  fun(s,8);
  printf("\n%s",s);
  wwjt();
}
void wwjt()     
{     
  
  int i;
  char a[100];
  FILE *rf, *wf ;     
  rf = fopen("in.dat", "r") ;
  wf = fopen("out.dat", "w") ;
  for(i=0;i<3;i++)
  {
    fscanf(rf, "%s", &a);
    fun(a,8);
    fprintf(wf, "%s", a);
    fprintf(wf, "\n");
  }
  
  fclose(rf);
  fclose(wf);
}

答案：----------------------
 int i,j;
 char t;
 for(i=0;i<num;i++)
    for(j=i+1;j<num;j++)
       if(s[i]<s[j])
         { t=s[i];s[i]=s[j];s[j]=t;}
----------------------

第194题 （10.0分）        题号:194        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求大于lim（lim小于100的整数）并且小于100的所
      有素数并放在aa数组中，该函数返回所求出素数的
      个数。

------------------------------------------------*/

#include<stdio.h>
#include<conio.h>
#define MAX 100
void  wwjt(); 

int fun(int lim,int aa[MAX])
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}
main()
{
  int limit,i,sum;
  int aa[MAX];
  printf("Please input ainteger:");
  scanf("%d",&limit);
  sum=fun(limit,aa);
  for(i=0;i<sum;i++){
    if(i%10==0&&i!=0) printf("\n");
    printf("%5d",aa[i]);
  }
  wwjt();
}
void wwjt()     
{     
  int i,j,array[100],sum,lim;
  FILE *rf, *wf ;     
  rf = fopen("in.dat", "r") ;
  wf = fopen("out.dat", "w") ;
  for (j=0; j <= 5; j++)
  {
    fscanf(rf, "%d", &lim);
    sum=fun(lim,array);
    for(i=0;i<sum;i++)
      fprintf(wf, "%7d", array[i]);
    fprintf(wf, "\n");     
  }     
  fclose(rf);
  fclose(wf);
}

答案：----------------------
 int n=0;
 int i,j;
 for(i=lim;i<=100;i++)
    {for(j=2;j<i;j++)
      if(i%j==0) break;
      if(j==i) aa[n++]=i;
     }
     return n;
----------------------

第195题 （10.0分）        题号:195        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：根据整型形参m，计算如下公式的值：
      y=1/5+1/6＋1/7＋1/8＋1/9+1/10...＋1/(m+5)
例如：若m=9，则应输出：1.168229

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
  
double fun(int m)   
{
  /**********Program**********/
  
  
  
  
  
  /**********  End  **********/
}
main()   
{
  int n;   
  printf("Enter n: ");   
  scanf("%d", &n);   
  printf("\nThe result is %1f\n", fun(n));
  wwjt();  
}   

void wwjt()
{
  FILE *IN,*OUT;
  int i ;
  int t;
  double o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(i=0;i<5;i++)
  {  
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%f\n",o);
    
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
     double y=0;
     int i;
     for(i=0; i<=m; i++)
     {y+=1.0/(i+5);  }
     return(y);
----------------------    

第196题 （10.0分）        题号:196        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：根据整型形参m，计算如下公式的值：y=sin(m)*10。
例如：若m=9，则应输出：4.121185

------------------------------------------------*/

#include <stdio.h>
#include"math.h"
void  wwjt(); 
  
double fun(int m)   
{
  /**********Program**********/
  
  
  
  
  
  /**********  End  **********/
}
main()   
{
  int n;   
  printf("Enter n: ");   
  scanf("%d", &n);   
  printf("\nThe result is %1f\n", fun(n));
  wwjt();  
}   

void wwjt()
{
  FILE *IN,*OUT;
  int i ;
  int t;
  double o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(i=0;i<5;i++)
  {  
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%f\n",o);
    
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
     double y=0;
     y=sin(m)*10;
     return(y);
----------------------

第197题 （10.0分）        题号:197        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：实现两个整数的交换。
例如：给a和b分别输入：60和65，输入为：a=65 b=60

------------------------------------------------*/

#include<stdio.h>
#include<conio.h>
void  wwjt(); 

void fun(int *a,int *b)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
} 
main()
{
  int a,b;
  printf("Enter a,b:");
  scanf("%d%d",&a,&b);
  fun(&a,&b);
  printf("a=%d b=%d\n",a,b);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int a,b,n;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<5;n++)
  {   
    fscanf(IN,"%d%d",&a,&b);
    fun(&a,&b);
    fprintf(OUT,"a=%d b=%d\n",a,b);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
 int t;
 t=*a;*a=*b;*b=t;
----------------------

第198题 （10.0分）        题号:198        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：把20个随机数存入一个数组，然后输出该数组中的
      最大值。   

------------------------------------------------*/

#include <stdio.h>
#define VSIZE 20     
void  wwjt(); 

int vector[VSIZE] ;     
int fun(int list[],int size)     
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/     
  
}     
main()     
{     
  int i;     
  for (i=0;i<VSIZE;i++)
  {
    vector[i]=rand();     
    printf("Vector[%d]=%6d\n",i,vector[i]);     
  }     
  i=fun(vector,VSIZE);     
  printf("\nMaxnum: Vector[%d]=%6d\n",i,vector[i]);
  
  wwjt();
}     
void wwjt()     

{     
  int i,t;
  FILE *fp ;     
  fp = fopen("out.dat", "w") ;
  for (i=0;i<VSIZE;i++)
  {
    fprintf(fp,"Vector[%d]=%6d\n",i,vector[i]);
  }     
  t=fun(vector,VSIZE);
  fprintf(fp,"\nMaxnum: Vector[%d]=%6d\n",t,vector[t]);
  fclose(fp) ;     
}

答案：----------------------
int i,max=0;     
for(i=1; i <size; i++)
if(list[max]<list[i])     
max=i;     
return max;
----------------------

第199题 （10.0分）        题号:199        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写程序, 求矩阵（3行3列）与2的乘积  
例如：输入下面的矩阵: 
      100 200 300     
      400 500 600     
      700 800 900 
      程序输出:   
      200  400  600     
      800 1000 1200     
      1400 1600 1800 

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
         
void fun(int array[3][3])     
{
  /**********Program**********/   
  
  
  
  
  /**********  End  **********/
} 

main()     
{     
  int i,j;     
  int array[3][3]={{100,200,300},     
  {400,500,600},     
  {700,800,900}};     
  for (i=0; i < 3; i++)     
  { 
    for (j=0; j < 3; j++)     
      printf("%7d",array[i][j]);     
    printf("\n");     
  }     
  fun(array);     
  printf("Converted array:\n");     
  for (i=0; i < 3; i++)     
  { 
    for (j=0; j < 3; j++)     
      printf("%7d",array[i][j]);     
    printf("\n");
  }
  wwjt();     
}     
void wwjt()     
{     
  
  int i,j, array[3][3];     
  FILE *rf, *wf ;     
  rf = fopen("in.dat", "r") ;
  wf = fopen("out.dat", "w") ;
  for (i=0; i < 3; i++)     
    for (j=0; j < 3; j++)     
      fscanf(rf, "%d", &array[i][j]);     
    fun(array);     
    for (i=0; i < 3; i++)     
    { 
      for (j=0; j < 3; j++)     
        fprintf(wf, "%7d", array[i][j]);     
      fprintf(wf, "\n");     
    }     
    fclose(rf) ;     
    fclose(wf) ;     
}

答案：----------------------
int i,j;     
for(i=0; i < 3; i++)     
for(j=0; j < 3; j++)     
array[i][j]=array[i][j]*2;  
----------------------

第200题 （10.0分）        题号:200        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求给定正整数m以内的素数之和。
例如：当m=20时，函数值为77。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
    
int fun(int m)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  int y;
  y=fun(20);
  printf("y=%d\n",y);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int iIN,iOUT,i;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<5;i++)
  {  
    fscanf(IN,"%d",&iIN);
    iOUT=fun(iIN);
    fprintf(OUT,"%d\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
 int i,k,s=0;
   for(i=2;i<=m;i++)
     {for(k=2;k<i;k++)
      if(i%k==0)break;
      if(k==i)s=s+i;
     }
return s;
----------------------

第201题 （10.0分）        题号:201        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求一个给定字符串中的字母的个数。

------------------------------------------------*/

#include <stdio.h>
void wwjt();
    
int fun(char s[])
{
  
  /**********Program**********/
 
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  char str[]="Best wishes for you!";
  int k;
  k=fun(str);
  printf("k=%d\n",k);
  wwjt();
  
}

void wwjt()
{
  FILE *IN,*OUT;
  char sin[80];
  int iOUT,i;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. It May Be Changed");
  }
  for(i=0;i<10;i++)
  {    
    fscanf(IN,"%s",sin);
    iOUT=fun(sin);
  }
  fprintf(OUT,"%d\n",iOUT);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i,k=0;
   for(i=0;s[i]!='\0';i++)
    if(s[i]>='a'&&s[i]<='z'||s[i]>='A'&&s[i]<='Z')
     k++;
    return k;
----------------------

第202题 （10.0分）        题号:202        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求一个四位数的各位数字的立方和。

-----------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
    
int fun(int n)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  int k;
  k=fun(1234);
  printf("k=%d\n",k);
  wwjt();
}
void wwjt()
{
  FILE *IN,*OUT;
  int iIN,iOUT,i;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<5;i++)
  {
    fscanf(IN,"%d",&iIN);
    iOUT=fun(iIN);
    fprintf(OUT,"%d\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int d,s=0;
   while (n>0)
    {d=n%10;
    s+=d*d*d;
     n/=10;
     }
     return s;
----------------------

第203题 （10.0分）        题号:203        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求1到100之间的偶数之积。

------------------------------------------------*/
    
#include <stdio.h>
void  wwjt(); 
    
double  fun(int m)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  printf("ji=%f\n",fun(100));
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int iIN,i;
  double dOUT;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<5;i++)
  {
    fscanf(IN,"%d",&iIN);
    dOUT=fun(iIN);
    fprintf(OUT,"%f\n",dOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
double   y=1;
    int i;
    for(i=1;i<=m;i++)
     if(i%2==0)y*=i;
     return y;
----------------------

第204题 （10.0分）        题号:204        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求一组数中大于平均值的数的个数。
例如：给定的一组数为1,3,6,9,4,23,35,67,12,88时，函
      数值为3。

------------------------------------------------*/
    
#include <stdio.h>
void  wwjt(); 

int fun(int a[],int n)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}
main()
{
  int a[10]={1,3,6,9,4,23,35,67,12,88};
  int y;
  y=fun(a,10);
  printf("y=%d\n",y);
  wwjt();
}
void wwjt()
{
  FILE *IN,*OUT;
  int iIN[10],iOUT,i,j;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(j=0;j<10;j++)
  {     
    for(i=0;i<10;i++)
      fscanf(IN,"%d",&iIN[i]);
    iOUT=fun(iIN,10);
  }
  fprintf(OUT,"%d\n",iOUT);
  
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i,k=0;
   float s=0,ave;
   for(i=0;i<n;i++)
    s+=a[i];
    ave=s/n;
    printf("%f  ",ave);
   for(i=0;i<n;i++)
    if(a[i]>ave)k++;
    return k;
----------------------

第205题 （10.0分）        题号:205        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：找出一批正整数中的最大的偶数。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
    
int fun(int a[],int n)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  int a[]={1,2,9,24,35,18},k;
  k=fun(a,6);
  printf("max=%d\n",k);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int iIN[10],iOUT,i,j;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(j=0;j<10;j++)
  {     
    for(i=0;i<10;i++)
      fscanf(IN,"%d",&iIN[i]);
    iOUT=fun(iIN,10); 
  }
  fprintf(OUT,"%d\n",iOUT);
  
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i,amax=-1;
    for(i=0;i<n;i++)
     if(a[i]%2==0)
      if (a[i]>amax) amax=a[i];
     return amax;
----------------------

第206题 （10.0分）        题号:206        难度:难        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求一分数序列2/1，3/2，5/3，8/5，13/8，21/13…
      的前n项之和。
说明：每一分数的分母是前两项的分母之和，每一分数的
      分子是前两项的分子之和
例如：求前20项之和的值为32.660259。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
        
float fun(int n)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  float y;
  y=fun(20);
  printf("y=%f\n",y);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int iIN,i;
  float fOUT;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<5;i++)
  {   
    fscanf(IN,"%d",&iIN);
    fOUT=fun(iIN);
    fprintf(OUT,"%f\n",fOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
 int i;
   float f1=1,f2=1,f3,s=0;
   for(i=1;i<=n;i++)
    {f3=f1+f2;
     f1=f2;
     f2=f3;
     s=s+f2/f1;
     }
    return s;
----------------------

第207题 （10.0分）        题号:207        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数判断一个整数m的各位数字之和能否被7整除，
      可以被7整除则返回1，否则返回0。调用该函数找出
      100~200之间满足条件的所有数。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

int sub(int m)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}
main()
{
  int i;
  for(i=100;i<=200;i++)
    if(sub(i)==1)
      printf("%4d",i);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[10];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<10;n++)
  {    
    fscanf(IN,"%d",&i[n]);
  }
  for(n=0;n<10;n++)
  {
    o=sub(i[n]);
    fprintf(OUT,"%d\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int k,s=0;
 do
 {s=s+m%10;
  m=m/10;
  }while(m!=0);
 if(s%7==0)k=1;
 else k=0;
 return(k);
----------------------

第208题 （10.0分）        题号:209        难度:难        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

题目：用函数求一个N阶方阵右下三角元素的和（包括副
      对角线上的元素）。    

------------------------------------------------*/

#include <stdlib.h>
#include <stdio.h>
#define N 3
void  wwjt(); 

int sum(int a[][N])
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  int a[N][N],i,j;
  for(i=0;i<N;i++)
  {
    for(j=0;j<N;j++)
    {
      a[i][j]=random(10)+10;
      printf("%3d",a[i][j]);
    }
    printf("\n");
  }
  printf("===================\n");
  printf("sum=%5d\n",sum(a));
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int m,n;
  int i[3][3];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(m=0;m<3;m++)
    for(n=0;n<3;n++)
      fscanf(IN,"%d",&i[m][n]);
    o=sum(i);
    fprintf(OUT,"%d\n",o);
    fclose(IN);
    fclose(OUT);
}

答案：----------------------
int i,j,k=0;
 for(i=0;i<N;i++)
  for(j=N-1-i;j<N;j++)
    k=k+a[i][j];
 return(k);
----------------------

第209题 （10.0分）        题号:210        难度:难        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：用函数求fibonacci数列前n项的和。
说明：fibonacci数列为数列的第一项值为1，第二项值也
      为1，从第三项开始，每一项均为其前面相邻两项
      的和。
例如：当n=28时，运行结果：832039

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

long sum(long f1,long f2)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  long int f1=1,f2=1;
  printf("sum=%ld\n",sum(f1,f2));
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[2];
  long int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  
  for(n=0;n<2;n++)
    fscanf(IN,"%d",&i[n]);
  o = sum(i[0],i[1]);
  fprintf(OUT,"%ld\n",o);
  
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
 long f,k=f1+f2;
 int i;
 for(i=3;i<=28;i++)
  {f=f1+f2;
   k=k+f;
   f1=f2;
   f2=f;
   }
 return(k);
----------------------

第210题 （10.0分）        题号:211        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数实现两个数据的交换，在主函数中输入任
      意三个数据，调用函数对这三个数据从大到小排序。

------------------------------------------------*/

#include<stdio.h>
void  wwjt(); 

void swap(int *a,int *b)
{
  /**********Program**********/ 
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  int x,y,z;
  scanf("%d%d%d",&x,&y,&z);
  if(x<y)swap(&x,&y);
  if(x<z)swap(&x,&z);
  if(y<z)swap(&y,&z);
  printf("%3d%3d%3d",x,y,z);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int m,n;
  int i[2];
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<3;n++)
  {    
    for(m=0;m<2;m++)
    {
      fscanf(IN,"%d",&i[m]);
    }
    swap(&i[0],&i[1]);
    fprintf(OUT,"%d\n",i[0]);
    fprintf(OUT,"%d\n",i[1]);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------

int k;
 k=*a;
 *a=*b;
 *b=k;
----------------------

第211题 （10.0分）        题号:212        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：从键盘上输入任意实数,求出其所对应的函数值。
        z=e的x次幂（x>10)
        z=log(x+3) (x>-3)
        z=sin(x)/((cos(x)+4)

------------------------------------------------*/

#include <math.h>
#include<stdio.h>
void  wwjt(); 

double y(float x)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  float x;
  scanf("%f",&x);
  printf("y=%f\n",y(x));
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  float i;
  double o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<10;n++)
  {    
    fscanf(IN,"%f",&i);
    o=y(i);
    fprintf(OUT,"%ld\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
double z;
  if(x>10) z=exp(x);
  else if(x>-3) z=log(x+3);
  else z=sin(x)/(cos(x)+4);
  return(z);
----------------------

第212题 （10.0分）        题号:213        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：从键盘上输入任意实数x,求出其所对应的函数值。
     z=(x-4)的二次幂（x>4)
     z=x的八次幂(x>-4)
     z=z=4/(x*(x+1))(x>-10)
     z=|x|+20(其他）

------------------------------------------------*/

#include <math.h>
#include <stdio.h>
void  wwjt(); 

float y(float x)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  float x;
  scanf("%f",&x);
  printf("y=%f\n",y(x));
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  float i;
  float o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<10;n++)
  {    
    fscanf(IN,"%f",&i);
    o=y(i);
    fprintf(OUT,"%f\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
float z;
  if(x>4) z=sqrt(x-4);
  else if(x>-4) z=pow(x,8);
  else if(x>-10) z=4/(x*(x+1));
  else z=fabs(x)+20;
  return(z);
----------------------

第213题 （10.0分）        题号:214        难度:难        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数用选择排序法对数组中的数据进行从小到
      大的排序。

------------------------------------------------*/

#include <stdlib.h>
#include<stdio.h>
void  wwjt(); 

void sort(int a[],int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  int a[13],i;
  for(i=0;i<13;i++)
    a[i]=random(20)-5;
  for(i=0;i<13;i++)
    printf("%3d",a[i]);
  printf("\n-------------------\n");
  sort(a,13);
  for(i=0;i<13;i++)
    printf("%3d",a[i]);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[10];
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<10;n++)
  {    
    fscanf(IN,"%d",&i[n]);
  }
  sort(i,10);
  for(n=0;n<10;n++)
    fprintf(OUT,"%d\n",i[n]);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
 int i,j,k,t;
 for(i=0;i<n-1;i++)
  {k=i;
   for(j=i+1;j<n;j++)
     if(a[k]>a[j]) k=j;
   if(k!=i)
    {t=a[i];
     a[i]=a[k];
     a[k]=t;
     }
   }
----------------------

第214题 （10.0分）        题号:215        难度:难        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数用冒泡排序法对数组中的数据进行从小到
      大的排序。

------------------------------------------------*/

#include <stdlib.h>
#include<stdio.h>
void  wwjt(); 

void sort(int a[],int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  int a[16],i;
  for(i=0;i<16;i++)
    a[i]=random(30)+15;
  for(i=0;i<16;i++)
    printf("%3d",a[i]);
  printf("\n-------------------\n");
  sort(a,16);
  for(i=0;i<16;i++)
    printf("%3d",a[i]);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[10];
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<10;n++)
  {    
    fscanf(IN,"%d",&i[n]);
  }
  sort(i,10);
  for(n=0;n<10;n++)
    fprintf(OUT,"%d\n",i[n]);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i,j,t;
 for(i=0;i<n-1;i++)
   for(j=0;j<n-1-i;j++)
     if(a[j]>a[j+1])
       {t=a[j];
    a[j]=a[j+1];
    a[j+1]=t;
    }
----------------------

第215题 （10.0分）        题号:216        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：给定n个数据, 求最大值出现的位置（如果最大值出
      现多次，求出第一次出现的位置即可)。

------------------------------------------------*/

#include<stdio.h>
void  wwjt(); 

int station(int s[],int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  int a[100],n,i,t;
  scanf("%d",&n);
  for(i=0;i<n;i++)
    scanf("%d",&a[i]);
  t=station(a,n);
  printf("the max_value position is:%d\n",t);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[10];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<10;n++)
  {    
    fscanf(IN,"%d",&i[n]);
  }
  o=station(i,10);
  fprintf(OUT,"%d\n",o);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i,k;
 k=0;
 for(i=1;i<=n;i++)
   if(s[i]>s[k]) k=i;
 return(k+1);
----------------------

第216题 （10.0分）        题号:217        难度:难        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：用辗转相除法求两个整数的最大公约数。

------------------------------------------------*/

#include<stdio.h>
void  wwjt(); 

int gcd(int n,int m)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  int n,m,result;
  scanf("%d%d",&n,&m);
  result=gcd(n,m);
  printf("the gcd is %d\n",result);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int m,n;
  int i[2];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<6;n++)
  {    
    for(m=0;m<2;m++)
    {    
      fscanf(IN,"%d",&i[m]);
    }
    o=gcd(i[0],i[1]);
    fprintf(OUT,"%d\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int r,t;
 if(n<m) { t=n;n=m;m=t;}
 r=n%m;
 while(r!=0)
 { n=m;m=r;r=n%m;}
 return(m);
----------------------

第217题 （10.0分）        题号:218        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求一批数中小于平均值的数的个数。

------------------------------------------------*/

#include<stdio.h>
void  wwjt(); 

int average_num(int a[],int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  int n,a[100],i,num;
  scanf("%d",&n);
  for(i=0;i<n;i++)
    scanf("%d",&a[i]);
  num=average_num(a,n);
  printf("the num is:%d\n",num);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[10];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<5;n++)
  {    
    fscanf(IN,"%d",&i[n]);
  }
  o=average_num(i,5);
  fprintf(OUT,"%d\n",o);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i,sum=0,k=0;
    double average;
    for(i=0;i<n;i++)
      sum=sum+a[i];
    average=sum*1.0/n;
    for(i=0;i<n;i++)
      if(average>a[i]) k++;
return(k);
----------------------

第218题 （10.0分）        题号:219        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：给定n个数据, 求最小值出现的位置（如果最小值
      出现多次,求出第一次出现的位置即可）。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

int station(int s[],int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  int a[100],n,i,t;
  scanf("%d",&n);
  for(i=0;i<n;i++)
    scanf("%d",&a[i]);
  t=station(a,n);
  printf("the min_value position is:%d\n",t);
  wwjt();
}
void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[10];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<10;n++)
  {    
    fscanf(IN,"%d",&i[n]);
    
  }
  o=station(i,10);
  fprintf(OUT,"%d\n",o);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i,k;
 k=0;
 for(i=1;i<n;i++)
   if(s[i]<s[k]) k=i;
 return(k);
----------------------

第219题 （10.0分）        题号:220        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：用函数实现字符串的复制, 不允许用strcpy()函数。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

void copy(char str1[],char str2[])
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  void copy();
  char c1[40],c2[40];
  gets(c1);
  copy(c1,c2);
  puts(c2);
  wwjt();
}


void wwjt()
{
  FILE *IN,*OUT;
  char i[100];
  char o[100];
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  fscanf(IN,"%s",i);
  copy(i,o);
  fprintf(OUT,"%s\n",o);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i;
    for(i=0;str1[i]!='\0';i++)
       str2[i]=str1[i];
    str2[i]='\0';
----------------------

第220题 （10.0分）        题号:221        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：产生20个[30,120]上的随机整数放入二维数组a[5][4]
      中，求每行元素的和。

------------------------------------------------*/

#include "stdlib.h"
#include <stdio.h>
void  wwjt(); 

void row_sum(int a[5][4],int b[5])
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  void row_sum();
  int a[5][4],b[5],i,j;
  for(i=0;i<5;i++)
    for(j=0;j<4;j++)
      a[i][j]=random(120-30+1)+30;
    for(i=0;i<5;i++)
    {
      for(j=0;j<4;j++)
        printf("%5d",a[i][j]);
      printf("\n");
    }
    row_sum(a,b);
    for(i=0;i<5;i++)
      printf("%6d",b[i]);
    printf("\n");
    wwjt();
}


void wwjt()
{
  FILE *IN,*OUT;
  int m,n;
  int i[5][4];
  int o[5];
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(m=0;m<5;m++)
    for(n=0;n<4;n++)
      fscanf(IN,"%d",&i[m][n]);
    row_sum(i,o);
    for(n=0;n<5;n++)
      fprintf(OUT,"%d\n",o[n]);
    fclose(IN);
    fclose(OUT);
}

答案：----------------------
 int i,j;
    for(i=0;i<5;i++)
    { b[i]=0;
      for(j=0;j<4;j++)
        b[i]=b[i]+a[i][j];
      }
----------------------

第221题 （10.0分）        题号:223        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：用函数求N个[10,60]上的整数中能被5整除的最大
      的数，如存在则返回这个最大值，如果不存在则
      返回0。

------------------------------------------------*/
#define N 30
#include "stdlib.h"
#include <stdio.h>
void  wwjt(); 

int find(int arr[],int n)
{ 
  int m=0;
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  return(m);
}

main()
{
  int a[N],i,k;
  for(i=0;i<N;i++)
    a[i]=random(51)+10;
  for(i=0;i<N;i++)
  {
    printf("%5d",a[i]);
    if((i+1)%5==0) printf("\n");
  }
  k=find(a,N);
  if(k==0) 
    printf("NO FOUND\n");
  else
    printf("the max is:%d\n",k);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[5];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<5;n++)
  {    
    fscanf(IN,"%d",&i[n]);
  }
  o=find(i,5);
  fprintf(OUT,"%d\n",o);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i;
  for(i=0;i<n;i++)
    if(arr[i]%5==0 && arr[i]>m)
      m=arr[i];
----------------------

第222题 （10.0分）        题号:224        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求一批数中最大值和最小值的差。

------------------------------------------------*/
#define N 30
#include "stdlib.h"
#include <stdio.h>
void  wwjt(); 

int max_min(int a[],int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}


main()
{
  int a[N],i,k;
  for(i=0;i<N;i++)
    a[i]=random(51)+10;
  for(i=0;i<N;i++)
  {
    printf("%5d",a[i]);
    if((i+1)%5==0) printf("\n");
  }
  k=max_min(a,N);
  printf("the result is:%d\n",k);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[30];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<5;n++)
  {    
    fscanf(IN,"%d",&i[n]);
  }
  o=max_min(i,5);
  fprintf(OUT,"%d\n",o);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i,max,min;
    max=min=a[0];
    for(i=1;i<n;i++)
      if(a[i]>max) max=a[i];
      else if(a[i]<min) min=a[i];
   return(max-min);
----------------------

第223题 （10.0分）        题号:225        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数判断一个整数能否同时被3和5整除，若能
      则返回值为1，否则为0。调用该函数求出15~300之
      间能同时被3和5整除的数的个数。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

int sum(int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}
main()
{
  int i,s=0;
  for(i=15;i<=300;i++)
    if(sum(i)==1) s=s+1;
    printf("s=%d\n",s);
    wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[12];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<5;n++)
  {    
    fscanf(IN,"%d",&i[n]);
  }
  for(n=0;n<5;n++)
  {    
    o = sum(i[n]);
    fprintf(OUT,"%d\n",o);    
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
if(n%3==0&&n%5==0) return(1);
 return(0);
----------------------

第224题 （10.0分）        题号:226        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数求表达式的和（n的值由主函数输入）。
      1-1/2+1/3-1/4+......+1/m
例如：当n=20时,表达式的值为0.668771。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

double sum(int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  int n;
  scanf("%d",&n);
  printf("sum=%f\n",sum(n));
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[10];
  double o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<5;n++)
    fscanf(IN,"%d",&i[n]);
  for(n=0;n<5;n++)
  {
    o = sum(i[n]);
    fprintf(OUT,"%f\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
float s=0;
 int i,k=1;
 for(i=1;i<=n;i++)
   { s=s+k*1.0/i;
     k=-k;
     }
 return(s);
----------------------

第225题 （10.0分）        题号:227        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数求1~100中奇数的平方和。
      结果为166650.000000。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

float sum(int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  printf("sum=%f\n",sum(100));
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int i;
  float o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(j=0;j<5;j++)
  {
    fscanf(IN,"%d",&i);
    o=sum(i);
    fprintf(OUT,"%f\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
float s=0;
 int i;
 for(i=1;i<=n;i=i+2)
   s=s+i*i;
 return(s);
----------------------

第226题 （10.0分）        题号:228        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：将字符串中的小写字母转换为对应的大写字母，
      其它字符不变。

------------------------------------------------*/

#include "string.h"
#include <stdio.h>
void  wwjt(); 

void change(char str[])
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  void change();
  char str[40];
  gets(str);
  change(str);
  puts(str);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  char i[200];
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  fscanf(IN,"%s",i);
  change(i);
  fprintf(OUT,"%s\n",i);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i;
    for(i=0;str[i]!='\0';i++)
      if(str[i]>='a' && str[i]<='z') 
         str[i]=str[i]-32;
----------------------

第227题 （10.0分）        题号:229        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：求一批数中最大值和最小值的积。

------------------------------------------------*/

#define N 30
#include "stdlib.h"
#include <stdio.h>
void  wwjt(); 

int max_min(int a[],int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  int a[N],i,k;
  for(i=0;i<N;i++)
    a[i]=random(51)+10;
  for(i=0;i<N;i++)
  {
    printf("%5d",a[i]);
    if((i+1)%5==0) printf("\n");
  }
  k=max_min(a,N);
  printf("the result is:%d\n",k);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[10];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<10;n++)
  {    
    fscanf(IN,"%d",&i[n]);
  }
  o=max_min(i,10);
  fprintf(OUT,"%d\n",o);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
 int i,max,min;
   max=min=a[0];
   for(i=1;i<n;i++)
     if(a[i]>max) max=a[i];
     else if(a[i]<min) min=a[i];
   return(max*min);
----------------------

第228题 （10.0分）        题号:230        难度:难        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数求3!+6!+9!+12!+15+18!+21!。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

float sum(int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  printf("this sum=%e\n",sum(21));
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int i;
  float o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  fscanf(IN,"%d",&i);
  o=sum(i);
  fprintf(OUT,"%f\n",o);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i,j;
    float t,s=0;
    for(i=3;i<=n;i=i+3)
     {t=1;
      for(j=1;j<=i;j++)
        t=t*j;
      s=s+t;}      
    return(s);
----------------------

第229题 （10.0分）        题号:231        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：产生20个[30,120]上的随机整数放入二维数组
      a[5][4]中, 求其中的最小值。

------------------------------------------------*/

#include "stdlib.h"
#include <stdio.h>
void  wwjt(); 

int amin(int a[5][4])
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  int a[5][4],i,j;
  for(i=0;i<5;i++)
    for(j=0;j<4;j++)
      a[i][j]=random(120-30+1)+30;
    for(i=0;i<5;i++)
    {
      for(j=0;j<4;j++)
        printf("%5d",a[i][j]);
      printf("\n");
    }
    printf("min=%d\n",amin(a));
    wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int m,n;
  int i[5][4];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)  
  {
    printf("Write FILE Error");
  }
  for(m=0;m<5;m++)
    for(n=0;n<4;n++)
    {    
      fscanf(IN,"%d",&i[m][n]);
    }
    o=amin(i);
    fprintf(OUT,"%d\n",o);
    fclose(IN);
    fclose(OUT);
}

答案：----------------------
int i,j,s;
 s=a[0][0];
 for(i=0;i<5;i++)
   for(j=0;j<4;j++)
     if(s>a[i][j])s=a[i][j];
  return(s);
----------------------

第230题 （10.0分）        题号:232        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------
功能：求n阶方阵主、副对角线上的元素之积。
------------------------------------------------*/

#define N 4
#include "stdlib.h"
#include <stdio.h>
void  wwjt(); 

float mul(int arr[][N])
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  int a[N][N],i,j;
  for(i=0;i<N;i++)
    for(j=0;j<N;j++)
      a[i][j]=random(10);
    for(i=0;i<N;i++)
    {
      for(j=0;j<N;j++)
        printf("%4d",a[i][j]);
      printf("\n");
    }
    printf("The sum is %d\n",mul(a));
    wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int m,n;
  int i[4][4];
  float o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(m=0;m<100;m++)
    for(n=0;n<100;n++)
    {    
      fscanf(IN,"%d",&i[m][n]);
    }
    o=mul(i);
    fprintf(OUT,"%f\n",o);
    fclose(IN);
    fclose(OUT);
}

答案：----------------------
int i,j;
    float t=1;
    for(i=0;i<N;i++)
      for(j=0;j<N;j++)
        if(i==j||i+j==N-1)
          t=t*arr[i][j];
    return(t);
----------------------

第231题 （10.0分）        题号:233        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数fun对主程序中用户输入的具有10
      个数据的数组a按由大到小排序，并在主程序中输出
      排序结果。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

int fun(int array[], int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  int a[10],i;
  printf("请输入数组a中的十个数:\n");
  for (i=0;i<10;i++)
    scanf("%d",&a[i]);
  fun(a,10);
  printf("由大到小的排序结果是:\n");
  for (i=0;i<10;i++)
    printf("%4d",a[i]);
  printf("\n");  
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[10];
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<10;n++)
  {    
    fscanf(IN,"%d",&i[n]);
  }
  fun(i,10);
  for(n=0;n<10;n++)
  {    
    fprintf(OUT,"%d\n",i[n]);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int  k,j,t;
  for (k=0;k<n-1;k++)
    for (j=k+1;j<n;j++)
      if (array[k]<array[j])
    {
    t=array[k];
    array[k]=array[j];
    array[j]=t;
    }
----------------------

第232题 （10.0分）        题号:234        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数fun(str,i,n)，从字符串str中删除第i个
      字符开始的连续n个字符（注意:str[0]代表字符串
      的第一个字符）。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 


fun(char str[],int i,int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{
  char  str[81];
  int   i,n;
  printf("请输入字符串str的值:\n");
  scanf("%s",str);
  printf("你输入的字符串str是:%s\n",str);
  printf("请输入删除位置i和待删字符个数n的值:\n");
  scanf("%d%d",&i,&n);
  while (i+n-1>strlen(str))
  {
    printf("删除位置i和待删字符个数n的值错！请重新输入i和n的值\n");
    scanf("%d%d",&i,&n);
  }
  fun(str,i,n);
  printf("删除后的字符串str是:%s\n",str);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  char i[200];
  char o[200];
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  fscanf(IN,"%s",i);
  fun(i,2,8);
  fprintf(OUT,"%s\n",i);
  
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
while(str[i+n-1])
   {
    str[i-1]=str[i+n-1];
    i++;
   }
  str[i-1]='\0';
----------------------

第233题 （10.0分）        题号:235        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数fun求s=1^k+2^k +3^k + ......+N^k的值，
     （1的K次方到N的K次方的累加和）。

------------------------------------------------*/

#define K 4
#define N 5
#include <stdio.h>
void  wwjt(); 

long  fun(int n,int k)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  long int sum;
  printf("Sum of %d powers of integers from 1 to %d = ",K,N);
  sum=fun(N,K);
  printf("%ld\n",sum);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[2];
  long o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<2;n++)
  {    
    fscanf(IN,"%d",&i[n]);
  }
  o=fun(i[0],i[1]);
  fprintf(OUT,"%ld\n",o);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
long power,sum=0;
 int i,j;
 for(i=1;i<=n;i++)
   { power=i;
     for(j=1;j<k;j++)
    power *= i;
     sum += power;
   }
 return sum;
----------------------

第234题 （10.0分）        题号:236        难度:难        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写程序求无理数e的值并输出。计算公式为：
      e=1+1/1!+1/2!+1/3!+......+1/n!
      当1/n!<0.000001时e=2.718282。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

main()
{
  float fun();
  printf("无理数e的值是:%f\n",fun());
  wwjt();
}

float fun()
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

void wwjt()
{
  FILE *IN,*OUT;
  float o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  o = fun();
  fprintf(OUT,"%f\n",o);
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
long int j;
 int i,k;
 double e,jc;
 i=1;
 e=0.0;
 jc=1.0;
 while(jc>=0.000001)
   {
     e=e+jc;
     j=1;
     for(k=1;k<=i;k++)
    j=j*k;
     jc=1.0/j;
     i++;
   }
 return e;
----------------------

第235题 （10.0分）        题号:237        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写main程序调用函数fact求解从m个元素选n个元
      素的组合数的个数。计算公式是：
      组合数＝m!/(n!.(m-n)!)。要求:m不能小于n，否则
      应有容错处理。
说明：函数fact(x)的功能是求x!。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

long fact(int x)
{
  long y;
  int i;
  y=1;
  for(i=1;i<=x;i++)
    y=y*i;
  return y;
}

main()
{
  int m,n;
  long zhsgs;
  printf("请输入m和n:\n");  scanf("%d%d",&m,&n);
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  printf("从%d个元素选%d个元素的组合数的个数是:%d\n",m,n,zhsgs);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i;
  long o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<5;n++)
  {    
    fscanf(IN,"%d",&i);
    o = fact(i);
    fprintf(OUT,"%ld\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
while(m<n)
  {
   printf("m和n输入错！请重新输入:\n");
   scanf("%d%d",&m,&n);
  }
 zhsgs=fact(m)/(fact(n)*fact(m-n));
----------------------

第236题 （10.0分）        题号:238        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：若x、y为奇数，求x到y之间的奇数和；若x、y为偶
      数，则求x到y之间的偶数和。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

int fun(int x,int y)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{ 
  int s;
  s=fun(1,1999)-fun(2,1998);
  printf("s=%d\n",s);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[2];
  int o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<2;n++)
  {    
    fscanf(IN,"%d",&i[n]);
  }
  o = fun(i[0],i[1]);
  fprintf(OUT,"%d\n",o);
  fclose(IN);
  fclose(OUT);
}

答案：---------------------- 
  int i,s=0;
  for(i=x;i<=y;i+=2)
     s=s+i;
  return s;
----------------------

第237题 （10.0分）        题号:240        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数fun，求任一整数m的n次方。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

long fun(int m,int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{ 
  int m,n;
  long  s;
  long fun(int,int);
  printf("输入m和n的值:");
  scanf("%d,%d",&m,&n);
  s=fun(m,n);
  printf("s=%ld\n",s);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[2];
  long o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<2;n++)
  {    
    fscanf(IN,"%d",&i[n]);
  }
  o = fun(i[0],i[1]);
  fprintf(OUT,"%ld\n",o);
  
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
long int x=1;
  int i;
  for(i=1;i<=n;i++)
       x=x*m;
  return x;
----------------------

第238题 （10.0分）        题号:242        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数fun计算下列分段函数的值：
             x^2+x+6      x<0且x≠-3
       f(x)= x^2-5x+6     0≤x<10且x≠2及x≠3
             x^2-x-1      其它

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
    
float fun(float x)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{ 
  float x,f;
  printf("input x=");
  scanf("%f",&x);
  f=fun(x);
  printf("x=%f,f(x)=%f\n",x,f);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  float i;
  float o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<10;n++)
  {    
    fscanf(IN,"%f",&i);
    o=fun(i);
    fprintf(OUT,"%f\n",o);
  }
  
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
 float y;
  if (x<0 && x!=-3.0)
     y=x*x+x+6;
  else if(x>=0 && x<10.0 && x!=2.0 && x!=3.0)
     y=x*x-5*x+6;
  else y=x*x-x-1;
return y;
----------------------

第239题 （10.0分）        题号:244        难度:难        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数fun求sum=d+dd+ddd+……+dd...d(n个d)，
      其中d为1-9的数字。
例如：3+33+333+3333+33333(此时d=3,n=5)，d和n在主函
      数中输入。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

long int fun(int d,int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
}

main()
{ 
  int d,n;
  long sum,fun();
  printf("d=");
  scanf("%d",&d);
  printf("n=");
  scanf("%d",&n);
  sum=fun(d,n);
  printf("sum=%ld\n",sum);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[2];
  long o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<2;n++)
  {    
    fscanf(IN,"%d",&i[n]);
  }
  o = fun(i[0],i[1]);
  fprintf(OUT,"%ld\n",o);
  
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
long int s=0,t=0;
  int i;
  for(i=1;i<=n;i++)
    { t=t+d;
      s=s+t;
      d=d*10;
    }
  return s;
----------------------

第240题 （10.0分）        题号:246        难度:易        第20章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：输入华氏温度求摄氏温度。转换公式为 c=5/9（f-32），
      输出结果取两位小数。

-------------------------------------------------------*/
#include <stdio.h>
void  wwjt(); 

double fun(double m)
{
  
  /**********Program**********/



  /**********  End  **********/
  
}

void main()
{
  double c,f;
   printf("请输入一个华氏温度:");
   scanf("%f",&f);

   c=fun(f);

   printf("摄氏温度为:%5.2f\n",c);
   wwjt();
}



void wwjt()
{
  FILE *IN,*OUT;
  int i;
  double iIN,iOUT;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<5;i++)
  {        
    fscanf(IN,"%f",&iIN);
    iOUT=fun(iIN);
    fprintf(OUT,"%f\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：  float n;
  n=(5.0/9.0)*(m-32);   
  return n; 

  

第241题 （10.0分）        题号:247        难度:易        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数fun将一个数组中的值按逆序存放，并在
      main()函数中输出。
例如：原来存顺序为8,6,5,4,1。要求改为：1,4,5,6,8。

------------------------------------------------*/

#include <stdio.h>
#define N 5
void  wwjt(); 


void  fun(int arr[],int n)
{
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main()
{
  int a[N]={8,6,5,4,1},i;
  for(i=0;i<N;i++)
    printf("%4d",a[i]);
  printf("\n");
  fun(a,N);
  for(i=0;i<N;i++)
    printf("%4d",a[i]);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int n;
  int i[10];
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(n=0;n<10;n++)
  {    
    fscanf(IN,"%d",&i[n]);
  }
  fun(i,10);
  for(n=0;n<10;n++)
  {    
    fprintf(OUT,"%d\n",i[n]);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
int i,t;
 for(i=0;i<n/2;i++)
  { t=arr[i];
    arr[i]=arr[n-1-i];
    arr[n-1-i]=t;
  }
----------------------

第242题 （10.0分）        题号:248        难度:中        第20章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：对任意输入的 x，用下式计算并输出 y 的值。

           -1      x<0
      y=    0      x=0
            1      x>0

------------------------------------------------*/

#include<stdio.h>
void  wwjt(); 

int fun(int n)
{
 
  /**********Program**********/





  /**********  End  **********/
  
}
void main ()
{
    int  x,y;
    printf("enter x:");
    scanf("%d",&x);
    y=fun(x);
    printf("x=%d,y=%d\n",x,y);
    wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int i;
  int iIN;
  long int iOUT;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<5;i++)
  {        
    fscanf(IN,"%d",&iIN);
    iOUT=fun(iIN);
    fprintf(OUT,"%ld\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：    int m;
    if(n<0)
      m=-1;
    else 
      if(n==0) m=0;
    else m=1;
return m;
或
   int m;
   if(n>=0)
      if(n>0)  
         m=1;
      else m=0;
   else m=-1;
return m;






第243题 （10.0分）        题号:249        难度:较难        第20章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：有一个一维数组score，内放10个学生的成绩，用一
      个函数来求平均成绩。

例如：如果10个学生的成绩分别为92，87，68，56，92，84，
      70，65，90，60 则平均成绩为：76.400000

------------------------------------------------*/
  
#include <stdio.h>
void  wwjt(); 

float average (float array[10])       
{
  /**********Program**********/




  /**********  End  **********/
}

main()
{
  float score[]={92,87,68,56,92,84,70,65,90,60};
  printf("average score is %f\n",average (score));
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int i;
  float fIN[10];
  float fOUT;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<10;i++)
  {    
   fscanf(IN,"%f",&fIN[i]);
  }
  fOUT=average (fIN);
  fprintf(OUT,"%f\n",fOUT);

  fclose(IN);
  fclose(OUT);
}

答案：----------------------
   int i;
   float aver,sum=array[0];        
   for(i=1;i<10;i++)
       sum=sum+array[i];
   aver=sum/10;
   return aver;

----------------------

第244题 （10.0分）        题号:250        难度:易        第20章
#include <stdio.h>
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：从键盘输入一个大写字母，要求改用小写字母输出。

-------------------------------------------------------*/
#include <stdio.h>
void  wwjt(); 

char  fun(char c)
{
  
  /**********Program**********/



  /**********  End  **********/
  
}

void  main()
{  
  char c1, c2;
  printf("Please input a char:");
  c1=getchar();
  printf("%c,%d\n",c1,c1);

  c2=fun(c1);

  printf("%c,%d\n",c2,c2);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  int i;
  char iIN,iOUT;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<5;i++)
  {        
    fscanf(IN,"%c",&iIN);
    iOUT=fun(iIN);
    fprintf(OUT,"%c\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：  c=c+32;
  return c;

第245题 （10.0分）        题号:251        难度:中        第20章
#include <stdio.h>
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：用while语句求1～100的累计和。

-------------------------------------------------------*/
void  wwjt(); 

int  fun(int n)
{
  
  /**********Program**********/



  /**********  End  **********/
  
}

void  main()
{  
  int  sum = 0; 

  sum=fun(100);

  printf ("sum = %d\n", sum);

  wwjt();

}

void wwjt()
{
  FILE *IN,*OUT;
  int i;
  int iIN,iOUT;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<5;i++)
  {        
    fscanf(IN,"%d",&iIN);
    iOUT=fun(iIN);
    fprintf(OUT,"%d\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：  int i=1,sum=0;
  while(i<=n)     
  {
	sum=sum+i;	   
    i++;		   
  }
  return sum;

第246题 （10.0分）        题号:252        难度:较难        第20章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：分别统计字符串中字母、数字、空格和其他字符出现的
      次数（字符长度小于80）。

-------------------------------------------------------*/
#include <stdio.h>
void  wwjt(); 

/*-全局变量，a用于保存字母个数、num用于保存数字个数
b用于保存空格个数、other用于保存其他字符字数*/
int a=0,num=0,b=0,other=0;

void count(char c[])
{
   /**********Program**********/



  /**********  End  **********/

}

void main()
{
                                
 char ch[80];  
 
 printf ("input string:"); 
 gets(ch);                                             

 count(ch); 

 printf ("a=%d num=%d b=%d other=%d\n",a,num,b,other);  

 wwjt();
}





void wwjt()
{
  FILE *IN,*OUT;
  int i;
  char sin[80];
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<5;i++)
  { 
    a=0;
    num=0;
    b=0;
    other=0;       
    fscanf(IN,"%s",&sin);
    count(sin);
    fprintf(OUT,"%d\n",a);
    fprintf(OUT,"%d\n",num);
    fprintf(OUT,"%d\n",b);
    fprintf(OUT,"%d\n",other);  
  }
  
  fclose(IN);
  fclose(OUT);
}

答案：  int i;
  for(i=0;c[i]!='\0';i++)                                
    if((c[i]>='A'&&c[i]<='Z')||(c[i]>='a'&&c[i]<='z')) 
      a=a+1;  
    else if (c[i]>='0'&&c[i]<='9') 
		   num=num+1;                 
         else if (c[i]==' ') 
		        b=b+1;                            
		      else 
				 other=other+1;

第247题 （10.0分）        题号:253        难度:中        第20章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写程序打印如图1所示图形。

   *
  ***
 *****
*******      
 *****
  ***
   *
要求：要求使用abs()。

------------------------------------------------*/

#include <stdio.h>
#include "math.h"   
void  wwjt(); 

void fun(int i)
{
  int m,n;
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
}

main( )
{ 
  fun(3);
}

答案：  for(m=-i;m<=i;m++)
  {  
     for(n=0;n<abs(m);n++) printf(" ");
     for(n=0;n<7-2*abs(m);n++) printf("*"); 
     printf("\n"); 
  }

第248题 （10.0分）        题号:254        难度:易        第1章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数fun求一个字符串的长度,在main函数中
      输入字符串,并输出其长度。

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 

int fun(char *p1)
{
  
  /**********Program**********/
  
  
  
  
  
  
  /**********  End  **********/
  
  
}

main()
{
  char *p,a[20];
  int len;
  p=a;
  printf("please input a string:\n");
  gets(p);
  len=fun(p);
  printf("The string's length is:%d\n",len);
  wwjt();
}

void wwjt()
{
  FILE *IN,*OUT;
  char *pIN,sin[20];
  int iOUT,i;
  pIN=sin;
  IN=fopen("3.IN","r");
  if(IN==NULL)
  {
    printf("Please Verify The Currernt Dir..it May Be Changed");
  }
  OUT=fopen("3.out","w");
  if(OUT==NULL)
  {
    printf("Please Verify The Current Dir.. it May Be Changed");
  }
  for(i=0;i<10;i++)
  {        
    fscanf(IN,"%s",pIN);
    iOUT=fun(pIN);
    fprintf(OUT,"%d\n",iOUT);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
char *p;
int n=0;
p=p1;
while(*p++)
 n++;
  return n;
----------------------

第249题 （10.0分）        题号:255        难度:中        第2章
/*------------------------------------------------
【程序设计】
--------------------------------------------------

功能：编写函数fun其功能是：根据整型形参m，计算如下
      公式的值：y=1＋1/3＋1/5＋1/7＋…＋1/(2m+1)
例如：若m=9，则应输出：2.133256

------------------------------------------------*/

#include <stdio.h>
void  wwjt(); 
    
double fun(int m)   
{
  /**********Program**********/
  
  
  
  
  
  /**********  End  **********/
}

main()   
{
  int n;   
  printf("Enter n: ");   
  scanf("%d", &n);   
  printf("\nThe result is %1f\n", fun(n));
  wwjt();  
}   

void wwjt()
{
  FILE *IN,*OUT;
  int s,i ;
  int t;
  float o;
  IN=fopen("in.dat","r");
  if(IN==NULL)
  {
    printf("Read FILE Error");
  }
  OUT=fopen("out.dat","w");
  if(OUT==NULL)
  {
    printf("Write FILE Error");
  }
  for(i=0;i<5;i++)
  {   
    fscanf(IN,"%d",&t);
    o=fun(t);
    fprintf(OUT,"%f\n",o);
  }
  fclose(IN);
  fclose(OUT);
}

答案：----------------------
     double y=1;
     int i;
     for(i=1; i<=m; i++)
     {y+=1.0/(2*i+1);  }
     return(y);
----------------------

第250题 （10.0分）        题号:256        难度:中        第94章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编一个程序，输入x的值，按如图所示公式计算并输出y值:

-------------------------------------------------------*/
#include <stdio.h>
void wwjt();

float fun(float x)
{

/**********Program**********/



/**********  End  **********/

        return y;
}


void main( )
{  
         float x ;
        printf("输入数 x:  \n");  
        scanf("%f", &x); 
        printf("y=%f\n",fun(x) ) ;        
        wwjt();
}



void wwjt()
{
        
        FILE *IN,*OUT;
        int j;
        float a;
        IN=fopen("in.dat","r");
        if(IN==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        OUT=fopen("out.dat","w");
        if(OUT==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for(j=0;j<3;j++)
        {
                fscanf(IN,"%f",&a);
                fprintf(OUT,"%f\n",fun(a));

        } 
        
        fclose(IN);
        fclose(OUT);
}


答案：    float y ;

	if (x<=1)  y=x;
	else if (x<10)  
		y=2*x-1;
	else  
		y=3*x -11;

第251题 （10.0分）        题号:257        难度:中        第94章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：一个3×5的整数矩阵，输出其中最大值max、最小值min和它们各自的下标。

-------------------------------------------------------*/
#include <stdio.h>
void wwjt();

int min, minl,minh, max, maxl,maxh;

void fun(int a[3][5])
{
        int i,j;

/**********Program**********/



/**********  End  **********/
}

void main( )
{  
        int  a[3][5]={0,1,2,3,4,5,6,7,8,9,10,11,12,13,14}, i, j;
        for (i=0 ; i<3; i++)
                for (j=0; j<5; j++)
                        
    fun(a);
        printf ( "最大值=%d，下标：%d行，%d列\n ", max, maxl, maxh);
        printf ( "最小值=%d，下标：%d行，%d列\n ", min, minl, minh);
        wwjt();
}




void wwjt()
{
        
        FILE *IN,*OUT;
        int i,j;
        int a[3][5];
        IN=fopen("in.dat","r");
        if(IN==NULL)
        {
                printf("Please Verify The Currernt Dir..It May Be Changed");
        }
        OUT=fopen("out.dat","w");
        if(OUT==NULL)
        {
                printf("Please Verify The Current Dir.. It May Be Changed");
        }
        for (i=0 ; i<3; i++)
                for (j=0; j<5; j++)
                   fscanf(IN,"%d",&a[i][j]);
    fun(a);
        fprintf(OUT,"%d\n",max+minl+maxh);
    fprintf(OUT,"%d\n",min+maxl+minh);
        fclose(IN);
        fclose(OUT);
}


答案：	max=min=a[0][0];
	for(i=0; i<3; i++)
		for (j=0; j<5; j++)
		{    
			if (a[i][j]>max) 
			{
				max=a[i][j];  
				maxl=i;  
				maxh=j; 
			}
			if (a[i][j]<min) 
			{ 
				min=a[i][j];   
				minl=i;  
				minh=j; 
			}
		}

第252题 （10.0分）        题号:258        难度:中        第95章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：找出1000以内的所有完数。(一个数若恰好等于它的真因子（即除了本身以外的约数）之和，
      这个数就称为完数，如6=1+2+3)。

-------------------------------------------------------*/
#include <stdio.h>

void main( )
{   
        int i,j,s=1;

/**********Program**********/



/**********  End  **********/
}


答案：	for(i=2;i<=1000;i++) 
	{   
		s=1;
		for(j=2;j<=i/2;j++) 
			if(i%j==0) 
				s+=j;  
			if(s==i)  
				printf("%d\n",i);          
	}

第253题 （10.0分）        题号:259        难度:中        第95章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编程序,输入两个字符串a,b（<40个字符），将两者连接后输出c（不能用strcat库函数）。

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>

  void main( )
   { 

/**********Program**********/



/**********  End  **********/
   }

答案：      char  a[40], b[40], c[80];
      int  i, j;
      printf("分二行输入两个字符串: \n");
      gets(a);  gets(b);
      for( i=0; a[i]!='\0'; i++)  c[i]=a[i];
      for( j=0; b[j]!='\0'; j++)  c[i+j]=b[j];		 
      c[i+j]='\0';
      puts(c);

第254题 （10.0分）        题号:260        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：从键盘输入实数x，按照如图片所示的公式计算并输出y值：

-------------------------------------------------------*/
#include <stdio.h>
#include<math.h>
main()
{  
   double x,y;

/**********Program**********/



/**********  End  **********/
   printf("y=%f\n",y);
}

答案：   scanf("%f",&x);
   if(x>7) 
     y=2+sqrt(x);
   else if(x>=-7)
           y=5+3*x; 
        else 
           y=3*x*x;

第255题 （10.0分）        题号:261        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：输入5个整数x，输出其中正整数的累加和sum与正整数的平均值ave，输入输出格式
      如以下示例。

      如输入：10  0  20  -5  31
      则输出：Sum=61, Average=20.3

-------------------------------------------------------*/
#include <stdio.h>
main()
{
    int  i, x, n, sum;

/**********Program**********/



/**********  End  **********/
}


答案：    float  ave;
    sum = 0;
    n = 0;
    for ( i=0; i<5; i++ )
    {
        scanf( "%d", &x );
        if ( x>0 )
        {
            sum += x;
            n++;
        }
    }
    ave = (float)sum / n;
    printf( "Sum=%d, Average=%4.1f\n", sum, ave );

第256题 （10.0分）        题号:262        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编程计算a+aa+aaa+……+aa…a(n个a)的和sum，要求a和n由用户从键盘输入。

      如输入：2,4↙    表示求2+22+222+2222的值
      输出：sum = 2468

-------------------------------------------------------*/
#include <stdio.h>  
#include <iostream.h>

void wwjt();

//计算a+aa+aaa+……+aa…a(n个a)的和sum
long sum(int a,int n)
{
/**********Program**********/




/**********  End  **********/
        return sum;
}

    
main()
{
        int a , n;
        printf("Input a,n: ");
        scanf("%d,%d", &a, &n);        
        printf("sum=%ld\n",sum(a,n));
        wwjt();
}


void wwjt()
{

  FILE *IN,*OUT;
  int i,j,k;
  IN=fopen("in.dat","r");
  OUT=fopen("out.dat","w");
  for(i=0;i<3;i++)
  { 

    fscanf(IN,"%d",&j);
        fscanf(IN,"%d",&k);

    fprintf(OUT,"%d\n",sum(j,k));
  }
  
  fclose(IN);
  fclose(OUT);
}

答案：	long term = 0,sum = 0;
	int  i;

	for (i = 1; i <= n; i++)
	{
		term = term * 10 + a;	/*求出累加项*/
		sum = sum + term;		/*进行累加*/
	}


第257题 （10.0分）        题号:263        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：对于一个如图片1所示4乘3的矩阵a，找出其中最大值max及该值所在位置（m，n）。
      从键盘输入:12 23  34  2  4   6  7  8   9  1  43  5
      则输出：max=43
              行号=3     列号=1

-------------------------------------------------------*/
#include<stdio.h>
void wwjt();

main()
{
    int  a[4][3], i,j, max, m,n;
    /**********Program**********/


    /**********  End  **********/
    wwjt(max,m,n);
}


void wwjt(int max,int m, int n)
{

  FILE *IN,*OUT;
  int i,j,k;
  IN=fopen("in.dat","r");
  OUT=fopen("out.dat","w");
  for(i=0;i<3;i++)
  { 
    fscanf(IN,"%d",&j);
    fprintf(OUT,"%d\n",max+j);
    fprintf(OUT,"%d\n",m*j);
    fprintf(OUT,"%d\n",n*10-j);
  }
  
  fclose(IN);
  fclose(OUT);
}

答案：	for (i=0; i<4; i++)  
	{
	  for(j=0 ;j<3 ;j++)
         scanf("%d",&a[i][j]);
	}
	max = a[0][0]; 
	m= n = 0;
	for (i=0; i<4; i++)
	{
      for(j=0 ;j<3;j++)
  		if (max<a[i][j]) 
   		{
   			max = a[i][j]; 
   			m = i ;
          n=j ;
	 	}
  	}
	printf("max=%d\n",max);
	printf("行号=%d\t列号=%d\n",m,n);

第258题 （10.0分）        题号:264        难度:中        第2章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：从键盘输入实数x，按照如图片1所示公式计算并输出y值。

-------------------------------------------------------*/
#include <stdio.h>
#include<math.h>
void wwjt();

//计算公式
double fun(int x)
{
/**********Program**********/




/**********  End  **********/
        return y;
}

    

main()
{  
      float x;
      scanf("%f",&x);
      printf("y=%f\n",fun(x));
      wwjt(x);
}


void wwjt()
{

  FILE *IN,*OUT;
  int i,x;
  IN=fopen("in.dat","r");
  OUT=fopen("out.dat","w");
  for(i=0;i<3;i++)
  { 
    fscanf(IN,"%d",&x);
    fprintf(OUT,"%f\n",fun(x));
  }
  
  fclose(IN);
  fclose(OUT);
}


答案：	double y;
      if(x<-6) y=1+2*x*2;
      else if(x<=6) y=2+x; 
           else y=4+sqrt(x);

第259题 （10.0分）        题号:265        难度:中        第2章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：输入正整数m和n（设100≤m≤n≤999），输出m到n之间满足下列条件的三位数：它的
      个位数的立方加十位数的平方再加上百位数等于该数的本身
     （例如135＝1＋3*3＋5*5*5）。

      如输入：135  600
      则输出：135  175  518  598

-------------------------------------------------------*/
#include <stdio.h>
main()
{
    int  m,n;
/**********Program**********/




/**********  End  **********/
}



答案：    int  i,a,b,c;
    scanf( "%d%d", &m, &n );
    for ( i=m; i<=n; i++ )
    {
        a = i%10;
        b = i/10%10;
        c = i/100%10;
        if ( i==c+b*b+a*a*a )
            printf( "%d  ", i );
    }

第260题 （10.0分）        题号:266        难度:中        第2章
/*-------------------------------------------------------
【程序设计】 
---------------------------------------------------------

题目：编写程序计算并输出：1 + 12 + 123 + 1234 + …… 的前n(设0<n<10)项的和sum，
      n从键盘输入。

      例如输入：3     则输出：136
      又如输入：6     则输出：137171

-------------------------------------------------------*/
#include <stdio.h>
void wwjt();

//计算1 + 12 + 123 + 1234 + …… 的前n(设0<n<10)项的和
long sum(int n)
{
/**********Program**********/




/**********  End  **********/
        return sum;
}

    
main()
{
        int n;
        printf("Input n: ");
        scanf("%d",  &n);        
        printf("sum=%ld\n",sum(n));
        wwjt();
}


void wwjt()
{

  FILE *IN,*OUT;
  int i,j;
  IN=fopen("in.dat","r");
  OUT=fopen("out.dat","w");
  for(i=0;i<3;i++)
  { 

    fscanf(IN,"%d",&j);
    fprintf(OUT,"%d\n",sum(j));
  }
  
  fclose(IN);
  fclose(OUT);
}

答案：    int i;
    long  k, sum;
    sum = 0;
    k = 0;
    for ( i=1; i<=n; i++ )
    {
        k = 10*k + i;
        sum += k;
    }

第261题 （10.0分）        题号:267        难度:中        第2章
/*-------------------------------------------------------
【程序设计】
--------------------------------------------------------- 

题目：对于一个如图片1所示4乘3的矩阵a，找出其中最大值及该值所在位置。
      从键盘输入:12 23  34  2  4   6  7  8   9  1  43  5
      则输出：min=2
              行号=1     列号=0

-------------------------------------------------------*/
#include<stdio.h>
void wwjt();

main()
{
        int  a[4][3], i,j, min, m,n;
/**********Program**********/


/**********  End  **********/
        wwjt(min,m,n);
}


void wwjt(int min,int m, int n)
{

  FILE *IN,*OUT;
  int i,j,k;
  IN=fopen("in.dat","r");
  OUT=fopen("out.dat","w");
  for(i=0;i<3;i++)
  { 
    fscanf(IN,"%d",&j);
    fprintf(OUT,"%d\n",min+j);
        fprintf(OUT,"%d\n",m*j);
        fprintf(OUT,"%d\n",n*10-j);
  }
  
  fclose(IN);
  fclose(OUT);
}

答案：	for (i=0; i<4; i++)  
	{
	  for(j=0 ;j<3 ;j++)
         scanf("%d",&a[i][j]);
	}
	min = a[0][0]; 
	m= n = 0;
	for (i=0; i<4; i++)
	{
      for(j=0 ;j<3;j++)
  		if (min>a[i][j]) 
   		{
   			min = a[i][j]; 
   			m = i ;
          n=j ;
	 	}
  	}
	printf("min=%d\n",min);
	printf("行号=%d\t列号=%d\n",m,n);

第262题 （10.0分）        题号:268        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：输入2个学生的成绩，每人有6门课程，要求编程实现如下功能：
     （1）输入全部成绩，存入二维数组score[ROW][COL]
     （2）计算每门课程的平均分，存入一维数组ave1[COL]
     （3）计算每个学生各门课程的平均分，存入一维数组ave2[ROW]

-------------------------------------------------------*/
#include <stdio.h>
#define ROW 2
#define COL 6
void main()
{
        float score[ROW][COL],ave1[COL],ave2[ROW],sum=0;
        int i,j;
       
/**********Program**********/
        //输入全部成绩，存入二维数组
        printf("请输入2学生的6门成绩！按百分制输入数据。\n");




        //计算每门课程的平均分，存入一维数组





        //计算每个学生各门课程的平均分，存入一维数组



/**********  End  **********/
        printf("**************每门课程的平均分*******************\n");
        for(j=0;j<COL;j++)
                printf("第%2d门课程的平均分为：%6.2f\n",j+1,ave1[j]);
    
    printf("\n############每个学生各门课程的平均分############\n");
        for(i=0;i<ROW;i++)
                printf("第%2d个学生各门课程的平均分：%6.2f\n",i+1,ave2[i]);
}

答案：	//输入全部成绩，存入二维数组
	for(i=0;i<ROW;i++)
		for(j=0;j<COL;j++)
			scanf("%f",&score[i][j]);
	//计算每门课程的平均分，存入一维数组ave1[COL]
	for(j=0;j<COL;j++)
	{  
		for(i=0;i<ROW;i++)
			sum+=score[i][j];
		ave1[j]=sum/ROW;
		sum=0;
	}
    //printf("sum=%d",sum);
	//计算每个学生各门课程的平均分，存入一维数组ave2[ROW]
	for(i=0;i<ROW;i++)
	{
		for(j=0;j<COL;j++)
			sum+=score[i][j];
		ave2[i]=sum/COL;
		sum=0;
	}


第263题 （10.0分）        题号:269        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：任输入十个国家的名字，按由小到大排序。

-------------------------------------------------------*/
#include  <stdio.h>
#include <string.h>
void main( )
{    
      char a[10][20],b[20]; //用来保存国家的名字 b表示中间变量
      int i,j;  //循环变量

/**********Program**********/




/**********  End  **********/
      for (i=0;i<10;i++)   printf("%s\n",a[i]);
}


答案：      for (i=0;i<10;i++)
            gets(a[i]);
      for (i=0;i<9;i++)
          for (j=i+1;j<10;j++)
             if (strcmp(a[i],a[j])>0)
             {   strcpy(b,a[i]);  
                  strcpy(a[i],a[j]); 
                  strcpy(a[j],b); 
              }

第264题 （10.0分）        题号:270        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：求4×4整型数组的主对角线元素的和，请编fun函数。

-------------------------------------------------------*/
#include <stdio.h>

void  wwjt(); 

int fun(int a[4][4])
{

    /**********Program**********/
        

    /**********  End  **********/
}

void main()
{  
    int a[4][4], s, i, j;
   
    for(i=0; i < 4; i ++)
        for(j = 0; j < 4;j ++)
    scanf("%d", &a[i][j]);
    s=fun(a);
    printf("%d",s);

    wwjt();
    
}

void wwjt()
{
    FILE *IN, *OUT;
    int m, n, o;
    int i[4][4];
    IN=fopen("in.dat", "r");
    if(IN == NULL)
    {
        printf("Read FILE Error");
    }
    OUT = fopen("out.dat", "w");
    if(OUT == NULL)
    {
        printf("Write FILE Error");
    }
    for(m = 0; m < 4; m ++)
    {
        for(n = 0; n < 4; n ++)
            fscanf(IN,"%d", &i[m][n]);
    }
    o = fun(i);
    {   
        fprintf(OUT,"%d\n", o);
    
    }
    fclose(IN);
    fclose(OUT);
}

答案：    int i, sum = 0;
    for(i = 0; i < 4; i ++)
        sum = sum + a[i][i];
    return sum;


第265题 （10.0分）        题号:271        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：从键盘输入10个学生的成绩，统计及格（60分及其60分
      以上）的人数。请编fun函数。

-------------------------------------------------------*/
#include "stdio.h"

void wwjt();

int fun (int a[])
{
        
    /**********Program**********/


    /**********  End  **********/

}

void main()
{        
    int a[10], i, s;
    for(i = 0; i < 10; i ++)
        scanf("%d", &a[i]);
    s=fun(a);
    printf("%d", s);

    wwjt();
}

void wwjt()
{
    FILE *IN, *OUT;
    int iIN[10], i;
    int iOUT, iCOUNT;
    IN=fopen("in.dat", "r");
    if(IN == NULL)
    {
        printf("Please Verify The Currernt Dir..it May Be Changed");
    }
    OUT = fopen("out.dat", "w");
    if(OUT == NULL)
    {
        printf("Please Verify The Current Dir.. It May Be Changed");
    }
    for(i = 0; i < 5; i ++)
    {  
        for(iCOUNT = 0; iCOUNT < 10; iCOUNT++)
        fscanf(IN,"%d", &iIN[iCOUNT]);
        iOUT=fun(iIN);
        fprintf(OUT,"%d\n",iOUT);
    }
    fclose(IN);
    fclose(OUT);
}

答案：    int i, count = 0;
    for(i = 0; i < 10; i ++)
        if(a[i] >= 60) 
            count ++; 
    return count ;


第266题 （10.0分）        题号:272        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：对从键盘输入的10个整数进行降序排序；
      排序后输出第2大的数，请编fun函数。

-------------------------------------------------------*/
#include "stdio.h"

void wwjt();

int fun(int a[])
{

    /**********Program**********/
        

    /**********  End  **********/
}
void main()
{  
    int a[10],i,m;
    for(i=0;i<10;i++)
        scanf("%d",&a[i]);
    m=fun(a);
    printf("%d ",m);
    wwjt();
}
void wwjt()
{
    FILE *IN,*OUT;
    int iIN[10],i;
    int iOUT,iCOUNT;
    IN=fopen("in.dat","r");
    if(IN==NULL)
    {
        printf("Please Verify The Currernt Dir..it May Be Changed");
    }
    OUT=fopen("out.dat","w");
    if(OUT==NULL)
    {
        printf("Please Verify The Current Dir.. It May Be Changed");
    }
    for(i=0;i<5;i++)
    {  
        for(iCOUNT=0;iCOUNT<10;iCOUNT++)
            fscanf(IN,"%d",&iIN[iCOUNT]);
        iOUT=fun(iIN);
        fprintf(OUT,"%d\n",iOUT);
    }
    fclose(IN);
    fclose(OUT);
}

答案：    int i,j,t;
    for(i=0;i<9;i++)
        for(j=0;j<9-i;j++)
            if (a[j]<a[j+1] ) 
            {
                t=a[j];
                a[j]=a[j+1];
                a[j+1]=t;
            }
     return a[1];

第267题 （10.0分）        题号:273        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：假设m是一个三位数，编写程序输出由m的个位、十位、百
      位反序而成的三位数（例如：123反序为321）。请编fun函数。

-------------------------------------------------------*/
#include"stdio.h"

void wwjt();

int fun(int a)
{
        
    /**********Program**********/


    /**********  End  **********/
}

void main()
{
    int a,k;
    scanf("%d",&a);
    k=fun(a);
    printf("k=%d",k);

    wwjt();
}

void wwjt()
{
    FILE *IN,*OUT;
    int iIN,i;
    int dOUT;
    IN=fopen("in.dat","r");
    if(IN==NULL)
    {
        printf("Please Verify The Currernt Dir..it May Be Changed");
    }
    OUT=fopen("out.dat","w");
    if(OUT==NULL)
    {
        printf("Please Verify The Current Dir.. it May Be Changed");
    }
    for(i=0;i<5;i++)
    {
        fscanf(IN,"%d",&iIN);
        dOUT=fun(iIN);
        fprintf(OUT,"%d\n",dOUT);
    }
    fclose(IN);
    fclose(OUT);
}

答案：    int m,k,n,b;
    m=a/100;
    n=(a-m*100)/10;
    b=a%10;
    k=b*100+n*10+m;
    return k;


第268题 （10.0分）        题号:274        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：有一函数：如样张所示，请编fun函数，x,y均为整型，
      输入x值，输出y值。

-------------------------------------------------------*/
#include"stdio.h"

void wwjt();

int fun(int x)
{

    /**********Program**********/


    /**********  End  **********/

}

void main()
{
    int x,y;
    scanf("%d",&x);
    y=fun(x);
    printf("%d",y);
    wwjt();
}

void wwjt()
{
    FILE *IN,*OUT;
    int iIN,i;
    int dOUT;
    IN=fopen("in.dat","r");
    if(IN==NULL)
    {
        printf("Please Verify The Currernt Dir..it May Be Changed");
    }
    OUT=fopen("out.dat","w");
    if(OUT==NULL)
    {
        printf("Please Verify The Current Dir.. it May Be Changed");
    }
    for(i=0;i<5;i++)
    {
        fscanf(IN,"%d",&iIN);
        dOUT=fun(iIN);
        fprintf(OUT,"%d\n",dOUT);
  }
    fclose(IN);
    fclose(OUT);
}

答案：    int y;
    if(x<0) 
        y=x*x+x-6;
    else if(x>=0&&x<=10)
        y=x*x-5*x+6;
    else 
        y=x*x-x-1;
    return y;


第269题 （10.0分）        题号:275        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写程序，输入一个华氏温度，要求输出摄氏温度。

     公式为 C=5/9*(F-32)

     要求：输入为整型，输出为实型，保留两位小数。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt();

double fun(int f)
{ 

    /**********Program**********/
    

    /**********  End  **********/
}

void main()
{
    int f;
    scanf("%d",&f);
    printf("%.2f",fun(f));
    wwjt();

}

void wwjt()
{
    FILE *IN,*OUT;
    int i;
    int iIN;
    double iOUT;
    IN=fopen("in.dat","r");
    if(IN==NULL)
    {
        printf("Please Verify The Currernt Dir..It May Be Changed");
    }
    OUT=fopen("out.dat","w");
    if(OUT==NULL)
    {
        printf("Please Verify The Current Dir.. It May Be Changed");
    }
    for(i=0;i<5;i++)
    {        
        fscanf(IN,"%d",&iIN);
        iOUT=fun(iIN);
        fprintf(OUT,"%.2f\n",iOUT);
    }
    fclose(IN);
    fclose(OUT);
}

答案：    double c;
    c = 5.0 / 9.0 * (f - 32);
    return c;


第270题 （10.0分）        题号:276        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写fun函数程序，从键盘输入某一年，判断该年是否为
      闰年。

闰年的条件是：（1）能被4整除但不能被100整除。
              （2）能被400整除。符合任何一个条件就是闰年。
                   输入年份为整型

-------------------------------------------------------*/
#include <stdio.h>

void wwjt();

int fun(int year )
{

    /**********Program**********/

        
    /**********  End  **********/
}
    
void main( )
{  
    int year ;
        
    scanf("%d", &year); 
       
    if(fun(year) == 1)
        printf("yes");
    else
        printf("no");

    wwjt();
}

void wwjt()
{
        
    FILE *IN,*OUT;
    int j;
    int a;
    IN=fopen("in.dat","r");
    if(IN==NULL)
    {
        printf("Please Verify The Currernt Dir..It May Be Changed");
    }
    OUT=fopen("out.dat","w");
    if(OUT==NULL)
    {
        printf("Please Verify The Current Dir.. It May Be Changed");
    }
    for(j=0;j<3;j++)
    {
        fscanf(IN,"%d",&a);
        fprintf(OUT,"%d\n",fun(a));

    } 
        
    fclose(IN);
    fclose(OUT);
}




答案：    int leap;

    if((year % 4 == 0 && year % 100 != 0) || (year % 400 ==0))
        leap = 1;
    else
        leap = 0;

    return leap;


第271题 （10.0分）        题号:277        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：从键盘上输入一个字符串，放在数组中，要求将字符串中
      的大写字母转换成小写字母，小写字母转换成大写字母，
      非字母字符不变，并输出

-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include <conio.h>
#define N 80

void wwjt();

char fun(char a[])
{

    /**********Program**********/
         

    /**********  End  **********/
}

void main()

{
    char a[80];
    char s;
    gets(a);
    s=fun(a);
    puts(a);
    wwjt();
}

void wwjt()
{
    FILE *IN,*OUT;
    char sin[N];
    char iOUT;
    IN=fopen("in.dat","r");
    if(IN==NULL)
    {
        printf("Please Verify The Currernt Dir..it May Be Changed");
    }
    OUT=fopen("out.dat","w");
    if(OUT==NULL)
    {
        printf("Please Verify The Current Dir.. it May Be Changed");
    }
    fscanf(IN,"%s",sin);
    iOUT=fun(sin);
    fprintf(OUT,"%s\n",sin);
    fclose(IN);
    fclose(OUT);
}

答案：    int i;
    for(i = 0; i < (strlen(a)); i ++)
    if(a[i] >= 'A' && a[i] <= 'Z')
        a[i] = a[i] + 32;
    else if(a[i] >= 'a' && a[i] <= 'z')
        a[i] = a[i] - 32;
    return a[i];


第272题 （10.0分）        题号:278        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编fun函数写程序，从键盘输入百分制成绩，要求输出
      等级制成绩A、B、C、D。90～100分为A，80～89分为B，
      60～79分为C，1～59分为D。不考虑小数，输入为整数，
      输出为字符。

-------------------------------------------------------*/
#include <stdio.h>

void wwjt();

char fun (int n)
{
  
    /**********Program**********/
  

    /**********  End  **********/
}

void main()
{
    int score,n;
    char p;
    scanf("%d",&score);
    n=score/10;
    p=fun(n);
    printf("%c" , p);
    wwjt();
}

void wwjt()
{
    FILE *IN,*OUT;
    int iIN,i;
    char cOUT;
    IN=fopen("in.dat","r");
    if(IN==NULL)
    {
        printf("Please Verify The Currernt Dir..it May Be Changed");
    }
    OUT=fopen("out.dat","w");
    if(OUT==NULL)
    {
        printf("Please Verify The Current Dir.. it May Be Changed");
    }
    for(i=0;i<5;i++)
    {  
        fscanf(IN,"%d",&iIN);
        cOUT=fun(iIN);
        fprintf(OUT,"%c\n",cOUT);
    }
    fclose(IN);
    fclose(OUT);
}

答案：    char s;
    switch(n)
    {
        case 10:
        case 9:s='A';break;
        case 8:s='B';break;
        case 7:
        case 6:s='C';break;
        default:s='D';
    }
    return s;


第273题 （10.0分）        题号:279        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

编写函数fun()，它的功能是求n以内(不包括n)同时能被5与11整
除的所有自然数之和的平方根s，并作为函数值返回。

例如：n为1000时，函数值应为s=96.979379。

注意：部分源程序给出如下。
请勿改动主函数main和其他函数中的任何内容，仅在函数
fun的花括号中填入所编写的若干语句。

试题程序：
-------------------------------------------------------*/
#include <conio.h>
#include <math.h>
#include <stdio.h>
#include <stdlib.h>

double  fun(int n)
{
    double  s = 0.0;
    int  i;
 
    /**********Program**********/
    

    /**********  End  **********/
}

void main()
{
    FILE *wf;
    system("CLS");
    printf("s=%f\n", fun(1000));
    wf=fopen("out.txt", "w");
    fprintf(wf, "%f", fun(1000));
    fclose(wf);
}


答案：    for(i = 0; i < n; i++)     
    if(i % 5 == 0 && i % 11 == 0)     
        s = s + i;
    s = sqrt(s);           
    return  s;

第274题 （10.0分）        题号:280        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

请编一个函数void fun(int  tt[M][N], int  pp[N]), tt指向
一个M行N列的二维数组，求出二维数组每列中最大元素，并依次
放入pp所指的一维数组中。二维数组中的数已在主函数中给出。

注意：部分源程序给出如下。
请勿改动主函数main和其他函数中的任何内容，仅在函数
fun的花括号中填入所编写的若干语句。

试题程序：


-------------------------------------------------------*/
#include <conio.h>
#include <stdio.h>
#include <stdlib.h>
#define M  3
#define N  4

void  fun(int tt[M][N], int pp[N])
{
    int  i, j, max;

    /**********Program**********/
   

    /**********  End  **********/
}
void main()
{
    FILE *wf;
    int t[M][N] = {{68, 32, 54, 12},{14, 24, 88, 58},{42, 22, 44, 56}};
    int p[N], i, j, k;
    system("CLS");
    printf("The riginal data is:\n");
    for(i = 0; i < M; i++)
    {
        for(j = 0; j < N; j++)
            printf("%6d", t[i][j]);
        printf("\n");
    }
    fun(t, p);
    printf("\nThe result  is:\n");
    for(k = 0; k < N; k++)
        printf("%4d", p[k]);
    printf("\n");
    wf=fopen("out.txt", "w");
    for(k=0; k < N; k++)
        fprintf(wf, "%4d", p[k]);
    fclose(wf);
}


答案：    for(j = 0; j < N; j++)
    {
        max = tt[0][j];           
        for(i = 0; i < M; i++)
            if(tt[i][j] > max)   
	max = tt[i][j];
        pp[j] = max;             
    }

第275题 （10.0分）        题号:281        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

请编写一个函数int fun（int *s，int t，int *k），用来求出
数组的最小元素在数组中的下标并存放在k所指的存储单元中。

例如，输入如下整数：
234 345 753 134 436 458 100 321 135 760则输出结果为6，100。

注意：部分源程序给出如下。
请勿改动主函数main和其他函数中的任何内容，仅在函数
fun的花括号中填入所编写的若干语句。

试题程序：



-------------------------------------------------------*/
#include <conio.h>
#include <stdio.h>
#include <stdlib.h>

int fun(int *s, int t, int *k)
{
    int i;
    *k=0;

    /**********Program**********/
   
        
    /**********  End  **********/

}

void main()
{
    FILE *wf;
    int a[10] = {234, 345, 753, 134, 436, 458, 100, 321, 135, 760}, k;
    system("CLS");
    fun(a, 10, &k);
    printf("%d, %d\n ", k, a[k]);
    wf=fopen("out.txt", "w");
    fprintf(wf, "%d, %d", k, a[k]);
    fclose(wf);
}

答案：    for(i = 0; i < t; i++)
        if(s[*k] > s[i]) 
            *k = i;   
     return s[*k];

第276题 （10.0分）        题号:282        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

编写函数fun，其功能是：将两个两位数的正整数a、b合并形成一
个整数放在c中。合并的方式是：将a数的十位和个位数依次放在c
数个位和十位上，b数的十位和个位数依次放在c数的百位和千位上。

例如，当a=16，b=35，调用该函数后，c=5361。

注意：部分源程序给出如下。
请勿改动主函数main和其他函数中的任何内容，仅在函数
fun的花括号中填入所编写的若干语句。

试题程序：


-------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>

void fun(int a , int b, long *c)
{

    /**********Program**********/
    
 
    /**********  End  **********/
}

void main()
{ 
    FILE *wf;
    int a, b; 
    long  c;
    system("CLS");
    printf("Input a, b;");
    scanf("%d%d", &a,  &b);
    fun(a, b, &c);
    printf("The result is:%ld\n", c);
    wf=fopen("out.txt", "w");
    fun(16, 35, &c);
    fprintf(wf, "%ld", c);
    fclose(wf);
}


答案： *c = (b % 10 * 1000 + (b / 10) * 100 + ( a % 10) * 10 + a / 10);

第277题 （10.0分）        题号:283        难度:中        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

请编写函数fun()，对长度为7个字符的字符串，除首、尾字符外，
将其余5个字符按ASCII值码升序排列。

编写完程序，运行程序后输入：字符串为Bdsihad，
则排序后输出为应为Badhisd。

注意：部分源程序给出如下。
请勿改动主函数main和其他函数中的任何内容，仅在函数
fun的花括号中填入所编写的若干语句。

试题程序：

-------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include <conio.h>

void fun(char *s, int num)
{
    char t; 
    int i, j;

    /**********Program**********/



    /**********  End  **********/

}

void main()
{
    FILE *wf;
    char s[10];
    char b[10]="Bdsihad";
    system("CLS");
    printf("输入7个字符的字符串:");
    gets(s);
    fun(s,7);
    printf("\n%s",s);
    wf=fopen("out.txt","w");
    strcpy(s,"Bdsihad");
    fun(b,7);
    fprintf(wf,"%s",b);
    fclose(wf);
}


答案：    for(i = 1; i < num - 2; i++)     
        for(j = i + 1; j < num - 1; j++)  
            if(s[i] > s[j])                              
            {     
                t = s[i];       
                s[i] = s[j];
                s[j] = t; 
            }

第278题 （10.0分）        题号:284        难度:难        第1章
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：求出1000以内前20个不能被2，3，5，7整除的数之和。

要求：使用程序中定义的变量
  
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/

#include <stdio.h>
#include<stdlib.h>
int  fun(int n)  
{
        int i,j=0,a[20],sum=0; /*前20个不能被2,3,5,7整除的数保存在a数组中，它们的和保存在sum中。*/
        /**********Program**********/

        for(i=0;【?】)
        {
                if((【?】))
                {
                        a[j++]【?】;  
                        //printf("%d,",i);
                }
                if(j>n-1) break;                
        }

        for(i=0;【?】)
                【?】a[i];




        /**********  End  **********/
        return sum;
}


main()
{
        printf("和为：%d\n",fun(20));
        system("pause");
}

答案：	for(i=0;i<1000;i++)
	{
		if((i%2!=0)&&(i%3!=0)&&(i%5!=0)&&(i%7!=0))
		{
			a[j++]=i;  
			//printf("%d,",i);
		}
		if(j>n-1) break;		
	}

	for(i=0;i<n;i++)
		sum+=a[i];

第279题 （10.0分）        题号:285        难度:难        第1章
/*----------------------------------------------------------------------
【程序设计】
------------------------------------------------------------------------

 题目：   编写程序，要求读入一个英文文本行，将其中每个单词的第一个字母改
          成大写，然后输出此文本行(这里"单词"是指由空格隔开的字符串)。
          例如，若输入：I am a student to take the examination.，
          则应输出：I Am A Student To Take The Examination.。

------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdlib.h>
#include<ctype.h>
#include<string.h>
#include<stdio.h>
void upfst(char *p)
{  
    /**********Program**********/
【?】 k=0;
for(【?】)
  if(k)
   { 
          if(【?】) 
          k=0;
    }
   else if(【?】)
          {  k=1;【?】;}


        

    /**********  End  **********/
}
int main()
{          
    char chrstr[81];
    printf("\nPlease enter an English text line:\n");
    gets(chrstr);
    printf("\nBefore changing:\n %s",chrstr);
    upfst(chrstr);
    printf("\nAfter changing:\n %s\n ",chrstr);
    system("pause");
}

答案：int k=0;
for(;*p;p++)
  if(k)
   { 
          if(*p==' ') 
          k=0;
    }
   else if(*p!= ' ')
          {  k=1;*p=toupper(*p);}

第280题 （10.0分）        题号:286        难度:难        第1章
/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------

函数fun的功能：对一个任意位数的正整数n，，从十位起计算隔位数字之和，即十位、
千位、……等数字之和。例如输入1234567，6+4+2的结果为12。

------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
int fun(int n)
{
    int sum=0;
    /**********Program**********/
    n=【?】;

     【?】(n>0)
     {  
          【?】+=【?】;
    
          n=【?】;
     }
    /**********  End  **********/  
    return sum;
}

#include <stdio.h>
int main()
{
    int n;
    printf("输入一个正整数: ");
    scanf("%d",&n);
    printf("从十位起,隔位数字之和是%d\n",fun(n));
    return 0;
} 


答案： n=n/10;
 while(n>0)
{  sum=sum+n%10;
    n=n/100;
}

第281题 （10.0分）        题号:287        难度:难        第1章
/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------

程序功能：从键盘输入三个整数，比较三个数并显示相应信息，具体如下：
（1）如果三个数都相等，显示"***"；
（2）如果三个数中只有某两个数相等，显示"$$"；
（3）如果三个数互不相等，则显示"#"。
（输出要换行）
 
------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include<stdio.h>
int main()
{
    int a,b,c;
    scanf("%d%d%d",&a,&b,&c);
    /**********Program**********/
    if(【?】)  printf("【?】");

    else if(【?】)  printf("【?】");

    else  printf("【?】");

    /**********  End  **********/
    return 0;
}


答案：if(a==b && b==c)  printf("***\n");
else if(a==b || b==c || c==a)  printf("$$\n");
else  printf("#\n");

第282题 （10.0分）        题号:288        难度:难        第1章
/*--------------------------------------------------------------------
【程序设计】
----------------------------------------------------------------------

题目：s=1+(2*2)+(3*3*3)+(4*4*4*4)+...+(9*9*9*9*9*9*9*9*9)的值
要求：使用循环实现。 输出格式：s=405071317

------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdio.h>
int main()
{
    int i;
    int j;
    int sum = 0;
    int tmp;
    /**********Program**********/

      for (i=1;【?】)
  {
      【?】;
      for (j = 1; 【?】)
      {
          【?】;
      }

       【?】;
  }

    /**********  End  **********/
    printf("s=%d\n", sum);
    return (0);
}

答案：for (i = 1; i <= 9; ++i)
  {
      tmp = 1;
      for (j = 1; j <= i; j++)
      {
          tmp *= i;
      }

      sum += tmp;
  }

第283题 （10.0分）        题号:289        难度:难        第1章
/*--------------------------------------------------------------------
【程序设计】
----------------------------------------------------------------------

题目：有如下数列：1,2,2,3,3,3,4,4,4,4,5,5,5,5,5,..计算并输出前1000项的和
要求：使用循环实现。 输出结果的形式为：s=29820

------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdio.h>
int main()
{
    int j = 1;
    int num = 1;
    int countNum = 0;
    int sum = 0;
    /**********Program**********/

 while (【?】)
    {
        for (【?】)
        {
            【?】;
            if (【?】)
            {
                break;
            }
            【?】 num;
        }
        ++num;
    }

    /**********  End  **********/
    printf("s=%d", sum);
    fclose(stdout);
    return (0);
}



答案： while (countNum <= 1000)
    {
        for (j = 1; j <= num; j++)
        {
            ++countNum;
            if (countNum > 1000)
            {
                break;
            }
            sum += num;
        }
        ++num;
    }

第284题 （10.0分）        题号:290        难度:难        第1章
/*--------------------------------------------------------------------
【程序设计】
----------------------------------------------------------------------

题目：根据下式求s的值。s=1/1+1/4+1/7+1/10+...+1/298.
要求：要求使用循环实现，输出结果的形式为：s=2.579

------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdio.h>
int main()
{
    double sum = 1.0f;
    int i = 4;
    /**********Program**********/

 for (【?】 )
    {
        【?】 1.0【?】;
        【?】+=【?】;
    }




    /**********  End  **********/
    printf("s=%.3f", sum);
    return (0);
}


答案： for (i=4; i <= 298; )
    {
        sum += 1.0/i;
        i +=3;
    }

第285题 （10.0分）        题号:291        难度:难        第1章
/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------

题目：函数fun的功能：返回1+12+123+1234+12345……，共n（≤9）项相加的值。
例如：输入5，输出 sum=13715  

------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/
#include <stdio.h>
int fun(int n)
{
    int sum=0;
    /**********Program**********/

【?】=0,i;
for(【?】)
{
    t【?】;
    【?】t;
【?】

    /**********  End  **********/
    return sum;
}
int main()
{
    int n;
    do
    {   printf("请输入n（1~9）：");
        scanf("%d",&n);
    }while(n<1||n>9);
    printf ("sum =%d\n",fun(n)) ;
    return 0;
}


答案：int t=0,i;
for(i=1;i<=n;i++)
{
    t=t*10+i;
    sum+=t;
  }

第286题 （10.0分）        题号:292        难度:难        第1章
/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------

题目：编写函数fun，该函数的数学表达式如样张所示。

      程序输出：
      fun(-2.1) =   -2.100
      fun(0.3) =    1.350
      fun(1.5) =    0.162

------------------------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main或其它函数中给出的内容，仅在
      Program-End之间删除【?】填入若干语句。不要删除标志否则不得分。
----------------------------------------------------------------------*/

#include<stdio.h>
#include<math.h>
double fun(double x)
{ 
    double y;
    /**********Program**********/
   
 if【?】
        【?】;
    else if【?】
            y= 【?】;
    else
           【?】;



    /**********  End  **********/         
    return y;
}

int main()
{        
    printf("fun(-2.1) = %8.3lf\n", fun(-2.1));
    printf("fun(0.3) = %8.3lf\n", fun(0.3));
    printf("fun(1.5) = %8.3lf\n", fun(1.5));
}

答案： if(x<-1)
	y=x;
    else if(x<=1)
	    y= exp(x);
    else
	    y=log(x)/(x+1);


